{"url": "https://es.wikipedia.org/wiki/Filosof%C3%ADa_de_Unix", "title": "Filosofía de Unix", "summary": "La filosofía de Unix, originada por Ken Thompson, es un conjunto de normas culturales y enfoques filosóficos para el desarrollo de software minimalista y modular. Se basa en la experiencia de los principales desarrolladores del sistema operativo Unix. Los primeros desarrolladores de Unix fueron importantes para llevar los conceptos de modularidad y reutilización a la práctica de la ingeniería de programas informáticos, lo que dio lugar a un movimiento de \"herramientas de software\". Con el tiempo, los principales desarrolladores de Unix (y de los programas que se ejecutaban en él) establecieron un conjunto de normas culturales para el desarrollo de programas informáticos; estas normas llegaron a ser tan importantes e influyentes como la propia tecnología de Unix; esto se ha denominado \"filosofía Unix\".\nLa filosofía de Unix hace hincapié en la construcción de código simple, corto, claro, modular y extensible que pueda ser fácilmente mantenido y reutilizado por otros desarrolladores que no sean sus creadores. La filosofía de Unix favorece la componibilidad en oposición al diseño monolítico.", "sections": [{"name": "Origen", "text": "La filosofía de Unix está documentada por Douglas McIlroy[1]​ en el Bell System Technical Journal de 1978:[2]​\nHaz que cada programa haga una cosa bien. Para hacer un nuevo trabajo, construye de nuevo en lugar de complicar los viejos programas añadiendo nuevas \"características\".\nEspere que la salida de cada programa se convierta en la entrada de otro programa aún desconocido. No llene la salida con información extraña. Evite los formatos de entrada binarios o en columnas. No insista en la entrada interactiva.\nDiseña y construye software, incluso sistemas operativos, para ser probados temprano, idealmente en semanas. No duden en tirar las partes torpes y reconstruirlas.\nUsar herramientas en lugar de ayuda no especializada para aligerar una tarea de programación, incluso si tienes que desviarte para construir las herramientas y esperas tirar algunas de ellas después de haberlas usado.\nFue resumido más tarde por Peter H. Salus en A Quarter-Century of Unix (1994):[1]​\nEscribe programas que hagan una cosa y la hagan bien.\nEscribe programas para trabajar juntos.\nEscribe programas para manejar flujos de texto, porque esa es una interfaz universal.\nEn su premiado trabajo de Unix de 1974, Ritchie y Thompson citan las siguientes consideraciones de diseño:[3]​\nFacilita la escritura, la prueba y la ejecución de programas.\nUso interactivo en lugar de procesamiento por lotes.\nEconomía y elegancia de diseño debido a las limitaciones de tamaño (\"salvación a través del sufrimiento\").\nSistema autosuficiente: todo el software de Unix se mantiene bajo Unix. ", "subsections": []}, {"name": "El Entorno de Programación del UNIX", "text": "En su prefacio al libro de 1984, The UNIX Programming Environment, Brian Kernighan y Rob Pike, ambos de Bell Labs, dan una breve descripción del diseño y la filosofía de Unix:[4]​\n \nLos autores escriben además que su objetivo para este libro es \"comunicar la filosofía de programación de UNIX\".[4]​", "subsections": []}, {"name": "Diseño de programas en el entorno UNIX", "text": "En octubre de 1984, Brian Kernighan y Rob Pike publicaron un artículo llamado Diseño de Programas en el Entorno UNIX. En este documento, critican la acumulación de opciones y características de los programas que se encuentran en algunos sistemas Unix más recientes como el 4.2BSD y el System V, y explican la filosofía Unix de las herramientas de software, cada una de las cuales realiza una función general:[5]​\n \nLos autores contrastan las herramientas de Unix, como cat, con las suites de programas más grandes utilizadas por otros sistemas.[5]​\n ", "subsections": []}, {"name": "Doug McIlroy sobre la programación de Unix", "text": "McIlroy, entonces jefe del Centro de Investigación de Ciencias de la Computación de Bell Labs, e inventor del Unix pipe,[6]​ resumió la filosofía de Unix de la siguiente manera:[1]​\n \nMás allá de estas declaraciones, también ha enfatizado la simplicidad y el minimalismo en la programación de Unix:[1]​\n \nPor el contrario, McIlroy ha criticado el Linux moderno por tener un software inflado, remarcando que, \"los admiradores adoradores han alimentado a Linux con golosinas a un estado descorazonador de obesidad\".[7]​ Él contrasta esto con el enfoque anterior tomado en los laboratorios Bell al desarrollar y revisar Research Unix:[8]​\n ", "subsections": []}, {"name": "Haz una cosa y hazla bien", "text": "Como dijo McIlroy, y generalmente aceptado por toda la comunidad Unix, siempre se ha esperado que los programas Unix sigan el concepto de DOTADIW, o \"Haz una cosa y hazla bien\". Hay fuentes limitadas para el acrónimo DOTADIW en Internet, pero se discute ampliamente durante el desarrollo y empaquetado de nuevos sistemas operativos, especialmente en la comunidad Linux.\nPatrick Volkerding, el líder del proyecto Slackware Linux, invocó este principio de diseño en una crítica a la arquitectura del sistema, afirmando que, \"intentar controlar servicios, enchufes, dispositivos, montajes, etc., todo dentro de un demonio va en contra del concepto de Unix de hacer una cosa y hacerla bien\"[9]​", "subsections": []}, {"name": "Las 17 Reglas de Unix de Eric Raymond", "text": "En su libro El arte de la programación Unix, publicado por primera vez en 2003,[10]​ Eric S. Raymond, un programador americano y defensor del código abierto, resume la filosofía Unix como el principio KISS de \"Keep it Simple, Stupid\".[11]​ Él proporciona una serie de reglas de diseño:[1]​\nConstruye programas modulares\nEscribe programas legibles\nUsa la composición de uso\nMecanismos separados de la política\nEscribe programas simples\nEscribe pequeños programas\nEscribe programas transparentes\nEscribe programas robustos\nComplicar los datos cuando sea necesario, no el programa\nAprovechar los conocimientos esperados de los usuarios potenciales\nEvitar la salida innecesaria\nEscribe programas que fallan de una manera que es fácil de diagnosticar\nValorar el tiempo del desarrollador sobre el tiempo de la máquina\nEscribe programas abstractos que generen código en lugar de escribir código a mano\nPrototipo de software antes de pulirlo\nEscribe programas flexibles y abiertos\nHacer el programa y los protocolos extensibles.", "subsections": []}, {"name": "Mike Gancarz: La Filosofía de UNIX", "text": "En 1994, Mike Gancarz (miembro del equipo que diseñó el Sistema X Window), se basó en su propia experiencia con Unix, así como en discusiones con otros programadores y personas de otros campos que dependían de Unix, para producir La Filosofía de UNIX que la resume en nueve preceptos primordiales:\nLo pequeño es hermoso.\nHaz que cada programa haga una cosa bien.\nConstruya un prototipo lo antes posible.\nElija la portabilidad en lugar de la eficiencia.\nAlmacenar los datos en archivos de texto plano.\nUtiliza el aprovechamiento del software a tu favor.\nUsar scripts de shell para aumentar el apalancamiento y la portabilidad.\nEvite las interfaces de usuario cautivas.\nHaz de cada programa un filtro.", "subsections": []}, {"name": "\"Peor es mejor\"", "text": "Richard P. Gabriel sugiere que una ventaja clave de Unix era que encarnaba una filosofía de diseño que él denominó \"lo peor es mejor\", en la que la simplicidad tanto de la interfaz como de la implementación son más importantes que cualquier otro atributo del sistema, incluyendo la corrección, la consistencia y la integridad. Gabriel sostiene que este estilo de diseño tiene ventajas evolutivas clave, aunque cuestiona la calidad de algunos resultados.\nPor ejemplo, en los primeros tiempos, Unix utilizaba un núcleo monolítico (lo que significa que los procesos de usuario llevaban a cabo llamadas del sistema del núcleo en la pila de usuarios). Si se entregaba una señal a un proceso mientras estaba bloqueado en una I/O a largo plazo en el núcleo, ¿qué se debía hacer? ¿Debería retrasarse la señal, posiblemente durante mucho tiempo (tal vez indefinidamente) mientras se completa la I/O? El manejador de señales no podría ser ejecutado cuando el proceso estuviera en modo kernel, con datos sensibles del kernel en la pila. ¿Debería el núcleo hacer una copia de seguridad de la llamada al sistema, y almacenarla, para su reproducción y reinicio posterior, asumiendo que el manejador de señales se complete con éxito?\nEn estos casos, Ken Thompson y Dennis Ritchie favorecieron la simplicidad sobre la perfección. El sistema Unix ocasionalmente regresaba antes de tiempo de una llamada al sistema con un error que indicaba que no había hecho nada - la \"Llamada al Sistema Interrumpido\", o un error número 4 (EINTR) en los sistemas actuales. Por supuesto que la llamada había sido abortada para llamar al manejador de la señal. Esto sólo podía suceder para un puñado de llamadas de sistema de larga duración como read(), write(), open() y select(). En el lado positivo, esto hizo que el sistema de I/O fuera mucho más simple de diseñar y entender. La gran mayoría de los programas de usuario nunca se vieron afectados porque no manejaban o experimentaban otras señales aparte de SIGINT y morían inmediatamente si uno se levantaba. Para los otros pocos programas, como los shells o los editores de texto que responden a las teclas de control de trabajo, se podían añadir pequeños envoltorios a las llamadas del sistema para reintentar la llamada de inmediato si se producía este error EINTR. De esta manera, el problema se resolvió de una manera simple.", "subsections": []}, {"name": "Crítica", "text": "En un artículo de 1981 titulado \"La verdad sobre Unix: La interfaz de usuario es horrible\" publicado en Datamation, Don Norman criticó la filosofía de diseño de Unix por su falta de preocupación por la interfaz de usuario.[12]​ Escribiendo desde su formación en ciencia cognitiva y desde la perspectiva de la entonces actual filosofía de la ingeniería cognitiva, se centró en cómo los usuarios finales comprenden y forman un modelo cognitivo personal de sistemas - o, en el caso de Unix, no lo entienden, con el resultado de que los errores desastrosos (como perder una hora de trabajo) son demasiado fáciles.", "subsections": []}, {"name": "Véase también", "text": "Ingeniería cognitiva\nArquitectura de Unix\nMinimalismo (informática)\nIngeniería de software\nHacker ético\nLista de filosofías de desarrollo del software\nTodo es un archivo", "subsections": []}, {"name": "Notas", "text": "↑ a b c d e Raymond, Eric S. (23 de septiembre de 2003). «Basics of the Unix Philosophy». The Art of Unix Programming. Addison-Wesley Professional. ISBN 0-13-142901-9. Consultado el 1 de noviembre de 2016. \n↑ Doug McIlroy, E. N. Pinson, B. A. Tague (8 de julio de 1978). «Unix Time-Sharing System: Foreword». Bell Laboratories. pp. 1902-1903. \n↑ Dennis Ritchie; Ken Thompson (1974), «The UNIX time-sharing system», Communications of the ACM 17 (7): 365-375, doi:10.1145/361011.361061 .\n↑ a b Kernighan, Brian W. Pike, Rob. The UNIX Programming Environment. 1984. viii\n↑ a b Rob Pike (October 1984). «Program Design in the UNIX Environment». \n↑ Dennis Ritchie (1984), «The Evolution of the UNIX Time-Sharing System», AT&T Bell Laboratories Technical Journal 63 (8): 1577-1593, doi:10.1002/j.1538-7305.1984.tb00054.x .\n↑ Douglas McIlroy. «Remarks for Japan Prize award ceremony for Dennis Ritchie, May 19, 2011, Murray Hill, NJ». Consultado el 19 de junio de 2014. \n↑ Bill McGonigle. «Ancestry of Linux — How the Fun Began (2005)». Consultado el 19 de junio de 2014. \n↑ «Interview with Patrick Volkerding of Slackware». linuxquestions.org. 7 de junio de 2012. Consultado el 24 de octubre de 2015. \n↑ Raymond, Eric (19 de septiembre de 2003). The Art of Unix Programming. Addison-Wesley. ISBN 0-13-142901-9. Consultado el 9 de febrero de 2009. \n↑ Raymond, Eric (19 de septiembre de 2003). «The Unix Philosophy in One Lesson». The Art of Unix Programming. Addison-Wesley. ISBN 0-13-142901-9. Consultado el 9 de febrero de 2009. \n↑ Norman, Don (1981). «The truth about Unix: The user interface is horrid» (27(12)). ", "subsections": []}, {"name": "Referencias", "text": "The Unix Programming Environment by Brian Kernighan and Rob Pike, 1984\nProgram Design in the UNIX Environment – The paper by Pike and Kernighan that preceded the book.\nNotes on Programming in C, Rob Pike, September 21, 1989\nA Quarter Century of Unix, Peter H. Salus, Addison-Wesley, May 31, 1994 (ISBN 0-201-54777-5)\nPhilosophy — from The Art of Unix Programming, Eric S. Raymond, Addison-Wesley, September 17, 2003 (ISBN 0-13-142901-9)\nFinal Report of the Multics Kernel Design Project by M. D. Schroeder, D. D. Clark, J. H. Saltzer, and D. H. Wells, 1977.\nThe UNIX Philosophy, Mike Gancarz, ISBN 1-55558-123-4", "subsections": []}, {"name": "Enlaces externos", "text": "Basics of the Unix Philosophy – by Catb.org\nThe Unix Philosophy: A Brief Introduction – by The Linux Information Project (LINFO)\nThe Unix Philosophy\nWhy the Unix Philosophy still matter", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Flask", "title": "Flask", "summary": "Flask es un framework minimalista escrito en Python que permite crear aplicaciones web rápidamente y con un mínimo número de líneas de código. Está basado en la especificación WSGI de Werkzeug y el motor de templates Jinja2 y tiene una licencia BSD.", "sections": [{"name": "Historia", "text": "Flask fue creado por Armin Ronacher de Pocoo, un grupo internacional de entusiastas de Python formado en 2004. Según Ronacher, la idea original era una broma del Día de los Inocentes que fue lo suficientemente popular como para convertirse en una aplicación seria. El nombre es una referencia al marco anterior de Bottle.\nCuando Ronacher y Georg Brandl crearon un sistema de tablones de anuncios escrito en Python en 2004, se desarrollaron los proyectos de Pocoo Werkzeug y Jinja.\nEn abril de 2016, el equipo de Pocoo se disolvió y el desarrollo de Flask y bibliotecas relacionadas pasó al nuevo proyecto Pallets. Desde 2018, los datos y objetos relacionados con Flask se pueden renderizar con Bootstrap.\nFlask se ha hecho popular entre los entusiastas de Python. A partir de octubre de 2020, tiene la segunda mayor cantidad de estrellas en GitHub entre los marcos de desarrollo web de Python, solo un poco detrás de Django, y fue votada como el marco web más popular en la encuesta de desarrolladores de Python para los años entre y que incluyen 2018 y 2022 [1]​.", "subsections": []}, {"name": "Ejemplo", "text": "El código siguiente muestra una aplicación simple que imprime \"¡Hola Mundo!\":\nfrom\nflask\nimport\nFlask\napp\n=\n(\n__name__\n)\n@app\n.\nroute\n\"/\"\ndef\nholamundo\n():\nreturn\n\"¡Hola Mundo!\"\nrun\nport\n5000", "subsections": []}, {"name": "Referencias", "text": "↑  https://en.wikipedia.org/wiki/Flask_(web_framework) Flask (web framework) ", "subsections": []}, {"name": "Enlaces externos", "text": "Sitio Web de Flask\nDocumentación de Flask\nCódigo fuente del proyecto en Github\nFlask en PyPI\nLocalización para aplicaciones Flas", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Foreach", "title": "Foreach", "summary": "Busca fuentes: «Foreach» – noticias · libros · académico · imágenes\nForeach (de la palabra inglesa for each = para cada uno) es un bloque constructivo de los lenguajes de programación para recorrer los elementos de una colección. Foreach se utiliza por lo general en lugar de una norma para la declaración. A diferencia de otras construcciones de bucle, los bucles foreach por lo general no mantienen contra-indicación explícita, que esencialmente dice \"haga esto a todo en este juego\" en lugar de \"hacer esto x veces.\" Esto evita posibles errores off-by-one y hace el código más fácil de leer. En lenguajes orientados a objetos un iterador, aunque implícito, a menudo se utiliza como medio de recorrido. Este bucle, implementado a partir de las versiones de PHP4, nos ayuda a recorrer los valores de un array, lo cual puede resultar muy útil por ejemplo para efectuar una lectura rápida del mismo. Recordemos que un array es una variable que guarda un conjunto de elementos (valores) catalogados por claves.[1]​\nLa sintaxis en pseudocódigo es la siguiente:\nUn ejemplo práctico es la lectura de un array, lo cual podría hacerse del siguiente modo:  \nforeach\n \n(\n$array\nas\n$clave\n=>\n$valor\n)\n{\n   \ninstrucción\n1\n;\n  \n2\n…", "sections": [{"name": "Ejemplo en PHP", "text": "foreach\n$conjunto\nas\n$variable\n// operar con la variable;\n}", "subsections": []}, {"name": "Ejemplo en Java", "text": "for\ntipo\nvar\n:\narreglo", "subsections": []}, {"name": "Ejemplo en C#", "text": "variable\nin\n//Procesos\n//", "subsections": []}, {"name": "Ejemplo en LISP", "text": "dolist\nexp\nlista\n\t\n;operaciones...", "subsections": []}, {"name": "Véase también", "text": "While", "subsections": []}, {"name": "Referencias", "text": "↑ «PHP: foreach - Manual». php.net. Consultado el 2 de noviembre de 2017. \nForeach en C# (Documentación oficial Microsoft)\nForeach en MDN\nForeach en PHP (Documentación oficia", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Free_Software_Foundation", "title": "Free Software Foundation", "summary": "La Fundación por el Software Libre o Free Software Foundation es una organización creada en octubre de 1985 por Richard Stallman y otros entusiastas del software libre con el propósito de difundir este movimiento.\nLa Free Software Foundation (FSF) es una organización sin fines de lucro con la misión mundial de promover la libertad de los usuarios de computadoras. Defendemos los derechos de todos los usuarios de software.[1]​\nFSF centra su trabajo fundamentalmente en asuntos legales, organizativos y promocionales en beneficio de la comunidad de usuarios de software libre.", "sections": [{"name": "Historia", "text": "La Free Software Foundation fue fundada en 1985. Continuó los proyectos existentes de GNU, como la venta de manuales y cintas, y contrató a desarrolladores del sistema de software libre.[2]​ Desde entonces, ha continuado con estas actividades, además de abogar por el movimiento del software libre. La FSF también es la administradora de varias licencias de software libre, lo que significa que las publica y tiene la capacidad de realizar revisiones según sea necesario.[3]​\nLa FSF posee los derechos de autor de muchas piezas del sistema GNU, como el GNU Compiler Collection. Como titular de estos derechos de autor, tiene la autoridad para hacer cumplir los requisitos de copyleft de la GNU General Public License (GPL) cuando se produce una infracción de derechos de autor en ese software.\nDesde 1991 hasta 2001, la aplicación de la GPL se realizó de manera informal, generalmente por el propio Stallman, a menudo con la asistencia del abogado de la FSF, Eben Moglen. En el interés de promover la asertividad copyleft por parte de las compañías de software al nivel que la FSF ya estaba haciendo, en 2004 Harald Welte lanzó gpl-violations.org.\nLa aplicación de la GPL y las campañas educativas sobre el cumplimiento de la GPL fueron un foco principal de los esfuerzos de la FSF a partir de este período.[4]​\nDe 2003 a 2005, FSF celebró seminarios legales para explicar la GPL y la ley circundante.[5]​ Generalmente impartidos por Bradley M. Kuhn y Daniel Ravicher, estos seminarios fueron el primer esfuerzo para brindar educación legal formal sobre la GPL.[6]​\nEn 2007, la FSF publicó la tercera versión de la Licencia Pública General GNU después de una importante contribución externa.[7]​", "subsections": []}, {"name": "Actividades", "text": "Proyecto GNU\nEl propósito original de la FSF era promover los ideales del software libre. La organización desarrolló el sistema operativo GNU como un ejemplo de esto. \nLicencias GNU\nLa FSF elabora, mantiene y defiende la Licencia Pública General GNU (GNU GPL),la licencia de software libre más utilizada, cuya última versión es la GPLv3 que fue publicada en forma definitiva en junio de 2007. Aparte la FSF también es responsable de la [GNU LGPL|Licencia Pública General Reducida GNU] (GNU LGPL) y la Licencia de documentación libre GNU (GNU iFDL). La FSF tiene recursos y voluntad para hacer cumplir las licencias que elabora. Pero solo puede presentar demandas, sobre software del cual posea derechos de autor. La fundación se enfrenta cada año a unas 50 violaciones de la GPL y siempre trata de evitar llegar a los tribunales. \nAlojamiento de proyectos\nLa FSF aloja proyectos de software libre en su sitio web Savannah. Ofrece una de interfaz web para el hosting y el mantenimiento de las páginas web de los proyectos, seguimiento de errores, CVS, FTP, y listas de correo. Hospeda más de 2800 proyectos.\nFormación legal\nLa FSF organiza seminarios sobre los aspectos legales a tener en cuenta cuando se usa la licencia GPL.\nFree Software Directory\nEs un directorio con más de 5000 programas que se ha comprobado que son software libre. La Unesco ayuda en la financiación de este proyecto. \nPremios y reconocimientos\nPremio para el Avance del Software Libre de la FSF (FSF Award for the Advancement of Free Software) que otorga la fundación a una persona que haya hecho una gran contribución al progreso del software libre y Premio de software libre para proyectos de beneficio social (Free Software Award for Projects of Social Benefit).\nGNU Press\nEl departamento de publicaciones de la FSF es el responsable de publicar libros asequibles sobre informática usando licencias de libre distribución.\nDefinición de software libre\nMantiene muchos documentos que definen y explican claramente que es el software libre.\nCampañas\nLas campañas de la FSF apuntan a oportunidades importantes para la adopción y desarrollo de software libre, empoderan a las personas contra amenazas específicas a su libertad y nos acercan a una sociedad libre:[8]​\nProyectos de software libre de alta prioridad: La lista de proyectos de alta prioridad de la FSF y la lista de tareas de ingeniería inversa sirven para fomentar el desarrollo de proyectos que son importantes para aumentar la adopción y el uso de software libre y sistemas operativos de software libre.\nJavaScript libre: FreeJS La campaña Free JavaScript es un esfuerzo continuo para persuadir a las organizaciones de hacer que sus sitios web funcionen sin requerir que los usuarios ejecuten ningún software no libre.\nArranque seguro vs arranque restringido: La implementación de Secure boot ocasiona en ciertos casos que las computadoras no arrancarán sistemas operativos no autorizados, incluidos los sistemas autorizados inicialmente que se han modificado sin ser aprobados nuevamente.\nActualizar desde Windows: el sistema operativo más utilizado del mundo aprovecha su posición dominante sobre sus usuarios, negando libertades de uso.\nVigilancia: Si queremos desempañar programas de vigilancia como PRISM, debemos dejar de usar sistemas centralizados y unirnos para construir un Internet descentralizado, confiable y libre \"como en libertad\".\nDefectiveByDesign: Campaña para eliminar el DRM.\nPlayOgg.org: Para promocionar Ogg, una alternativa a formatos privativos como MP3 y AAC.\nFree BIOS: \"BIOS libre\". Campaña de apoyo al proyecto de creación de un BIOS libre.\nHardware devices that support free software: Campaña para promocionar la compra de «hardware que de soporte al software libre».\nEncourage governments to adopt OpenDocument': Para «promover en los gobiernos la adopción de OpenDocument».\nFin de patentes de software: Las campañas de la FSF para formatos que están libres de patentes de software, también trabajamos en la tarea más fundamental de finalizar por completo las patentes de software, a través de acciones legales y legislativas.[9]​", "subsections": []}, {"name": "Organización", "text": "La junta Directiva de la FSF incluye entre ellos profesores en las principales universidades, ingenieros superiores y fundadores. También se admiten algunos activistas de alto perfil y empresarios de software.\nJohn Sullivan es el actual director ejecutivo de la FSF. Los miembros anteriores que ocuparon el puesto fueron Peter T. Brown (2005-2010) y Bradley M. Kuhn (2001-2005).\nMiembros actuales de la junta:\nGeoffrey Knauth, ingeniero de software sénior en SFA, Inc. (desde el 23 de octubre de 1997)\nHenry Poole, fundador de CivicActions, una firma gubernamental de servicios digitales (con servicio desde el 12 de diciembre de 2002)\nGerald Jay Sussman, profesor de ciencias de la computación en el Instituto de Tecnología de Massachusetts (desde sus inicios)\nAlexander Oliva, Vicepresidente (servido desde el 28 de agosto de 2019) [39]\nKat Walsh, abogada de derechos de autor y tecnología, defensora de la cultura libre y el software libre, y expresidenta de la Fundación Wikimedia [40]\nLos miembros anteriores de la junta incluyen:\nHal Abelson, miembro fundador,[10]​ profesor de ciencias de la computación en el Instituto de Tecnología de Massachusetts (ejerció desde el inicio hasta el 5 de marzo de 1998, y se reincorporó alrededor de 2005)\nRobert J. Chassell, tesorero fundador,[10]​ así como director fundador (ejerció desde el inicio hasta el 3 de junio de 1997)\nMiguel de Icaza (ejerció desde agosto de 1999 hasta el 25 de febrero de 2002)\nBenjamin Mako Hill, profesor asistente de la Universidad de Washington (ejerció desde el 25 de julio de 2007 hasta octubre de 2019)[11]​\nMatthew Garrett, desarrollador de software (sirvió desde el 16 de octubre de 2014)[12]​\nBradley Kuhn, director ejecutivo de Software Freedom Conservancy y exdirector ejecutivo de FSF (ejerció del 25 de marzo de 2010[13]​ al 13 de octubre de 2019[14]​)\nLawrence Lessig, profesor de derecho en la Universidad de Stanford (ejerció desde el 28 de marzo de 2004 hasta 2008)\nEben Moglen (ejerció desde el 28 de julio de 2000 hasta 2007)\nLen Tower Jr., miembro fundador,[10]​ (ejerció hasta el 2 de septiembre de 1997)\nRichard Stallman, presidente fundador, lanzó el proyecto GNU, autor de la Licencia Pública General de GNU (ejerció como presidente desde el inicio, hasta el 16 de septiembre de 2019)\nFree Software Foundation Europe. Fundada en el 2001\nFree Software Foundation of India. Fundada en el 2003\nFree Software Foundation América Latina. Fundada en el 2005", "subsections": [{"name": "Afiliación", "text": "El 25 de noviembre de 2002, la FSF lanzó el programa de Miembros Asociados de la FSF para individuos.[15]​ Bradley M. Kuhn (director ejecutivo de la FSF, 2001-2005) lanzó el programa y también se inscribió como el primer Miembro Asociado.[16]​\nLos miembros asociados desempeñan principalmente un papel honorífico y de apoyo a la financiación.[17]​ En 2023, los miembros asociados obtuvieron la capacidad de hacer nominaciones al consejo, junto con el personal de la FSF y los miembros con derecho a voto de la FSF. También hay una reunión anual de los miembros de la FSF, normalmente durante el almuerzo en LibrePlanet, en la que se solicitan opiniones para la FSF."}, {"name": "Financiación", "text": "La mayor parte de la financiación de la FSF proviene de patrocinadores y miembros.[18]​ Los ingresos también provienen de laboratorios de cumplimiento relacionados con el software libre, ofertas de trabajo, obras publicadas y una tienda web. La FSF ofrece ponentes y seminarios de pago, y todos los proyectos de la FSF aceptan donaciones.\nLos ingresos financian programas y campañas de software libre, mientras que el efectivo se invierte de forma conservadora en inversiones socialmente responsables. La estrategia financiera está diseñada para mantener el futuro a largo plazo de la Fundación a través de la estabilidad económica.\nLa FSF es una organización exenta de impuestos y publica anualmente en Internet el formulario 990 del Internal Revenue Service.[19]​"}, {"name": "Equipo legal", "text": "Eben Moglen y Dan Ravicher trabajaron anteriormente de forma individual como asesores legales pro bono de la FSF. Después de formar el Software Freedom Law Center, Eben Moglen continuó como asesor general de la FSF hasta 2016.[20]​"}, {"name": "Empleados", "text": "La Fundación tiene alrededor de una docena de empleados.[21]​ La mayoría, pero no todos, trabajan en la sede de la FSF en Boston, Massachusetts.[22]​[23]​"}]}, {"name": "Críticas y detractores", "text": "La FSF ha desempeñado y desempeña un papel muy importante en el desarrollo del software libre, por ello goza de muchas simpatías entre los usuarios de dicho software y tiene muchos enemigos en la industria del software privativo.\nAl margen de este hecho, dentro de la comunidad no todos comparten plenamente la filosofía o actuaciones de la FSF siendo la Open Source Initiative (OSI) la principal línea de pensamiento alternativa a la FSF.", "subsections": [{"name": "Posición sobre la Gestión de derechos digitales  DRM", "text": "Linus Torvalds ha criticado a la FSF por utilizar la GPLv3 como arma en la lucha contra los DRM. Torvalds argumenta que la cuestión de la DRM y la de una licencia de software deberían tratarse como dos cuestiones separadas.[24]​"}, {"name": "Campaña Defective by Design", "text": "El 16 de junio de 2010, Joe Brockmeier, periodista de Linux Magazine, criticó la campaña Defective by Design de la FSF por ser \"negativa\" e \"infantil\" y no ser adecuada para proporcionar a los usuarios \"alternativas creíbles\" al software privativo.[25]​ La FSF respondió a esta crítica diciendo \"que hay una diferencia fundamental entre hablar en contra de las políticas o acciones y las campañas de desprestigio\", y \"que si uno está tomando una posición ética, está justificado, y a menudo es necesario, no sólo hablar de los beneficios de la libertad, sino en contra de los actos de desposesión y privación de derechos\".[26]​"}, {"name": "Controversia sobre la licencia GNU LibreDWG", "text": "En 2009, una actualización de la licencia de LibDWG/LibreDWG a la versión 3 de la GPL de GNU,[27]​ hizo imposible que los proyectos de software libre LibreCAD y FreeCAD usaran LibreDWG legalmente.[28]​ Muchos proyectos expresaron su descontento por la selección de la licencia GPLv3 para LibreDWG, como FreeCAD, LibreCAD, Assimp y Blender.[29]​ Algunos sugirieron la selección de una licencia con una compatibilidad más amplia, por ejemplo MIT, BSD, o LGPL 2.1..[29]​ Se hizo una petición a la FSF para relicenciar GNU LibreDWG como GPLv2, que fue rechazada en 2012.[30]​\nLa libDWG se ha estancado desde 2011 por varias razones, incluyendo problemas de licencia.[31]​"}]}, {"name": "Véase también", "text": " Portal:Software libre. Contenido relacionado con Software libre.\nDerecho digital\nDefective by Design\nLibrePlanet\nLinux-libre\nRichard Stallman\nProyecto GNU\nSoftware libre\nSoftware libre y de código abierto\nAnexo:Licencias de software aprobadas por la FSF", "subsections": []}, {"name": "Referencias", "text": "↑ fsf. «Free software is a matter of liberty, not price — Free Software Foundation — working together for free software» (en inglés). Consultado el 5 de marzo de 2020. \n↑ «El Proyecto GNU». \n↑ «Licencias». \n↑ «DennisKennedy.blog: A Great Learning Opportunity for Software Lawyers - Upcoming GPL Seminar». web.archive.org. 28 de septiembre de 2007. Archivado desde el original el 28 de septiembre de 2007. Consultado el 5 de marzo de 2020. \n↑ «Seminar On Details Of The GPL And Related Licenses - Slashdot». yro.slashdot.org (en inglés). Consultado el 5 de marzo de 2020. \n↑ «FSF Bulletin Issue 2, June 2003». \n↑ «GNU General Public License». \n↑ «Current campaigns — Free Software Foundation — working together for free software». www.fsf.org. Consultado el 5 de marzo de 2020. \n↑ Patent Absurdity en FSF.org\n↑ a b c «February 1986        G N U ' S   B U L L E T I N         Volume 1 No.1». \n↑ «The Free Software Foundation (FSF) Lost Almost Half (3 Out of 8) Board Members in Only One Month». Techrights. 17 de octubre de 2019. Consultado el 5 de marzo de 2020. \n↑ «Matthew Garrett joins Free Software Foundation board of directors». \n↑ «Bradley Kuhn Joins the FSF Board». \n↑ «On Recent Controversial Events - Bradley M. Kuhn ( Brad ) ( bkuhn )». ebb.org. Consultado el 5 de marzo de 2020. \n↑ The site member.fsf.org first appears in the Internet Archive in December 2002, and that site lists the date of the launch as 25 November 2002. «FSF Membership Page». The Internet Archive. Archivado desde el original el 20 de diciembre de 2002. \n↑ «Homepage of Bradley M. Kuhn». Bradley M. Kuhn. 5 de enero de 2008. Consultado el 5 de enero de 2008. \n↑ «Amended Bylaws». Free Software Foundation. Consultado el 24 de enero de 2023. \n↑ Stallman, Richard. «About the GNU Project». Gnu Project. FSF. Consultado el 18 de mayo de 2014. \n↑ «FSF Financial Information». \n↑ «FSF announces change in general counsel». www.fsf.org (en inglés). Free Software Foundation. Consultado el 18 de mayo de 2017. \n↑ «Meet the staff of the Free Software Foundation». \n↑ «Meet the staff of the Free Software Foundation». \n↑ «Certificate of Change of Principal Office». The Commonwealth of Massachusetts. 26 de mayo de 2005. Consultado el 4 de julio de 2008. \n↑ patrick_g. «Linus Torvalds: the anniversary interview of the 20 years of the kernel». LinuxFr.org. Consultado el 23 de octubre de 2019. \n↑ «The Party of Gno.». Archivado desde el original el 20 de junio de 2010. Consultado el 22 de junio de 2010. \n↑ «In defense of negativity». www.fsf.org. Free Software Foundation. Consultado el 23 de octubre de 2019. \n↑ trunk/copying on sourceforge.net/p/libdwg\n↑ Larabel, Michael (24 de enero de 2013). «FSF Wastes Away Another \"High Priority\" Project». Phoronix. Archivado desde el original el 9 de noviembre de 2016. Consultado el 22 de agosto de 2013. «Tanto LibreCAD como FreeCAD quieren usar LibreDWG y tienen parches disponibles para soportar la librería del formato de archivo DWG, pero no pueden integrarlos. Los programas dependen de la popular licencia GPLv2, mientras que la Free Software Foundation sólo permite el uso de LibreDWG bajo licencia GPLv3, no GPLv2.» \n↑ a b Prokoudine, Alexandre (26 de enero de 2012). «What's up with DWG adoption in free software?». libregraphicsworld.org. Archivado desde el original el 9 de noviembre de 2016. Consultado el 3 de noviembre de 2013. «[Alexander Gessler de Assimp:] \"Personalmente, estoy muy descontento con su licencia GPL [de LibreDWG - LGW]. Prohíbe su uso en Assimp y también para muchas otras aplicaciones. No me gustan las ideologías dogmáticas, y liberar software por la fuerza (como hace GPL/GNU) es algo que me disgusta en particular. Está bien para las aplicaciones, porque a estas alturas no hace daño, pero, en mi opinión, no para las bibliotecas que están diseñadas para ser usadas lo más libremente posible.\" [Toni Roosendaal, de Blender:] \"Blender también sigue siendo \"GPLv2 o posterior\". Por el momento nos ceñimos a eso, pasar a GPL 3 no tiene beneficios evidentes que yo conozca. Mi consejo para LibreDWG: si haces una biblioteca, elegir una licencia ampliamente compatible (MIT, BSD o LGPL) es una elección muy positiva.» \n↑ Prokoudine, Alexandre (27 de diciembre de 2012). «LibreDWG drama: the end or the new beginning?». libregraphicsworld.org. Archivado desde el original el 9 de noviembre de 2016. Consultado el 23 de agosto de 2013. «[...]la desafortunada situación con el soporte para archivos DWG en software CAD libre a través de LibreDWG. Creemos que a estas alturas ya debería estar cerrado. Tenemos la respuesta final de la FSF. [...] \"No vamos a cambiar la licencia.\"». \n↑ Prokoudine, Alexandre (26 de enero de 2012). «What's up with DWG adoption in free software?». libregraphicsworld.org. Archivado desde el original el 9 de noviembre de 2016. Consultado el 3 de noviembre de 2013. «Licencia GPLv3. No funciona para el software de usuario final, porque tienden a utilizar componentes de terceros bajo licencias diferentes que imponen restricciones. La FSF, que es la única propietaria de los derechos de autor de LibreDWG, se opuso a la relicencia. Con respecto al proyecto FreeCAD y Yorik van Havre, su contribuidor, Richard Stallman declaró: \"No deberías cambiar la licencia de tu librería. Más bien, es mejor dejarle claro cuáles son las condiciones\". [...] Personalmente, estoy extremadamente descontento con su licencia GPL [de LibreDWG - LGW]. Prohíbe su uso en Assimp y también para muchas otras aplicaciones. No me gustan las ideologías dogmáticas, y liberar software por la fuerza (como hace GPL/GNU) es algo que me disgusta en particular. Está bien para las aplicaciones, porque no hace daño en este momento, pero, en mi opinión, no para las bibliotecas que están diseñadas para ser usadas tan libremente como sea posible.» ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una galería multimedia sobre Free Software Foundation.\nSitio web oficial de la Free Software Foundation\nSitio web oficial de la Free Software Foundation América Latina\nSitio web oficial de la Free Software Foundation Europa\nSitio web oficial de la Free Software Foundation Indi", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/GNU_General_Public_License", "title": "GNU General Public License", "summary": " \n \n \n \nSí\n[\n]\nNo\n \nLa Licencia Pública General de GNU o más conocida por su nombre en inglés GNU General Public License (o simplemente sus siglas en inglés GNU GPL) es una licencia de derecho de autor ampliamente usada en el mundo del software libre y código abierto,[6]​ y garantiza a los usuarios finales (personas, organizaciones, compañías) la libertad de usar, estudiar, compartir (copiar) y modificar el software. Su propósito es doble: declarar que el software cubierto por esta licencia es libre, y protegerlo (mediante una práctica conocida como copyleft) de intentos de apropiación que restrinjan esas libertades a nuevos usuarios cada vez que la obra es distribuida, modificada o ampliada. Esta licencia fue creada originalmente por Richard Stallman, fundador de la Free Software Foundation (FSF) para el proyecto GNU.\nLa Free Software Foundation pone la GPL a disposición de cualquiera que desee proteger los derechos de sus usuarios finales (usar, compartir, estudiar y modificar), y otorgar a los beneficiarios de un programa de ordenador u otro tipo de obra los derechos de la definición de software libre.[7]​ La GPL se distingue del dominio público o de otras licencias de software libre conocidas como permisivas por hacer hincapié en el copyleft, o solo permitir que las copias y derivados de una obra bajo la GPL perpetúen la misma licencia.\nLa mayor parte del software GNU es copyleft, pero no todo; sin embargo, todo el software GNU debe ser software libre.\nParte del software GNU fue escrito por el equipo de la Free Software Foundation, pero la mayor parte proviene de algunos voluntarios. La Free Software Foundation es titular del copyright de parte de ese software, otra parte está bajo el copyright de sus autores.\nDavid A. Wheeler sostiene que el copyleft proporcionado por la GPL fue crucial para el éxito de sistemas basados en Linux, dando a los programadores que han contribuido al núcleo la seguridad de que de su trabajo se beneficiaría todo el mundo y seguirá siendo libre, en lugar de ser explotado por compañías de software que no tendrían que dar nada de nuevo a la comunidad.[8]​\nLos usuarios o compañías que distribuyen sus trabajos bajo las GPL, pueden cobrar o distribuirlas gratuitamente. Esto distingue las GPL de las licencias de software que prohíben su distribución comercial. La FSF argumenta que no se debe restringir la distribución comercial del software (incluyendo la redistribución),[9]​ y en ese tenor la GPL establece explícitamente que las obras cubiertas por esta licencia se pueden vender a cualquier precio", "sections": [{"name": "Historia", "text": "La GPL fue creada por Richard Stallman en 1989, para proteger los programas liberados como parte del proyecto GNU. La GPL original se basó en la unificación de licencias similares utilizadas en versiones anteriores de GNU Emacs, GNU Debugger y de GNU C Compiler.[10]​ Estas licencias contenían disposiciones similares a las actuales GPL, pero eran específicas para cada programa, haciéndolos incompatibles, a pesar de ser la misma licencia. El objetivo de Stallman era producir una licencia que pudiera ser aplicada a cualquier proyecto, por lo que es posible utilizarlas en muchos proyectos para compartir código.\nLa segunda parte de esta licencia, versión 2, fue liberada en 1991. Durante los siguientes 15 años, los miembros de la comunidad FOSS comenzaron a preocuparse con los problemas en la GPLv2 que permitían explotar software GPL con intenciones contrarias a la licencia.[11]​ Estos problemas incluían tivoización, que es la inclusión de software con GPL en hardware que rechazará ejecutar versiones modificadas de su software, problemas de compatibilidad como ocurre con la licencia Affero General Public License; y las disputas por patentes entre Microsoft y distribuidores de código libre y abierto, lo que se consideró como un intento de usar las patentes como arma contra la comunidad FOSS.\nHistóricamente, la familia de licencias de la GPL ha sido una de las licencias de software más populares en el software libre de dominio.[12]​[13]​[14]​[15]​[16]​[17]​[18]​ La tercera versión de esta licencia (GNU GPLv3) fue desarrollada para tratar de resolver estos problemas y fue lanzada oficialmente el 25 de julio de 2007. Esta es la primera licencia copyleft para uso general, lo que significa que los trabajos derivados solo pueden ser distribuidos bajo los términos de la misma licencia.", "subsections": [{"name": "Versión 1", "text": "La versión 1 de GNU GPL,[19]​ fue presentada el 25 de febrero de 1989,[20]​ impidió lo que eran las dos principales formas con las que los distribuidores de software restringían las libertades definidas por el software libre. El primer problema fue que los distribuidores publicaban únicamente los archivos binarios, funcionales y ejecutables, pero no entendibles o modificables por humanos. Para prevenir esto, la GPLv1 estableció que cualquier proveedor de software libre además de distribuir el archivo binario debía liberar a su vez código fuente entendible y que pudiera ser modificado por el ser humano, bajo la misma licencia (secciones 3a y 3b de la licencia).\nEl segundo problema era que los distribuidores podían añadir restricciones adicionales, ya fuera añadiendo restricciones a la licencia o mediante la combinación del software con otro que tuviera otras restricciones en su distribución. Si esto se hacía, entonces la unión de los dos conjuntos de restricciones sería aplicada al trabajo combinado entonces podrían añadirse restricciones inaceptables. Para prevenir esto, GPLv1 obligaba a que las versiones modificadas en su conjunto, tuvieran que ser distribuidas bajo los términos GPLv1 (secciones 2b y 4 de la licencia). Por lo tanto, el software distribuido bajo GPLv1 puede ser combinado con software bajo términos más permisivos y no con software con licencias más restrictivas, lo que entraría en conflicto con el requisito de que todo software tiene que ser distribuido bajo los términos de la GPLv1."}, {"name": "Versión 2", "text": "Según Richard Stallman, el mayor cambio en GPLv2 fue la cláusula “Liberty or Death” («libertad o muerte»), como la llama en la sección 7 de ese documento.[21]​ Esta sección dice que si alguien impone restricciones que le prohíben distribuir código GPL de tal forma que influya en las libertades de los usuarios (por ejemplo, si una ley impone que esa persona únicamente pueda distribuir el software en binario), esa persona no puede distribuir software GPL. La esperanza es que esto hará que sea menos tentador para las empresas el recurrir a las amenazas de patentes para exigir una remuneración de los desarrolladores de software libre.\nEn 1991 se hizo evidente que una licencia menos restrictiva sería estratégicamente útil para la biblioteca C y para las bibliotecas de software que esencialmente hacían el trabajo que llevaban a cabo otras bibliotecas comerciales ya existentes.[22]​ Cuando la versión 2 de GPL fue liberada en junio de 1991, una segunda licencia Library General Public License fue introducida al mismo tiempo y numerada con la versión 2 para denotar que ambas son complementarias. Los números de versiones divergieron en 1999 cuando la versión 2.1 de LGPL fue liberada, esta fue renombrada como GNU Lesser General Public License para reflejar su lugar en esta filosofía."}, {"name": "Versión 3", "text": "A finales de 2005, la Free Software Foundation (FSF) anunció estar trabajando en la versión 3 de la GPL (GPLv3). El 16 de enero de 2006, el primer borrador de GPLv3 fue publicado, y se inició la consulta pública. La consulta pública se planeó originalmente para durar de nueve a quince meses, pero finalmente se extendió a dieciocho meses, durante los cuales se publicaron cuatro borradores. La GPLv3 oficial fue liberada por la FSF el 29 de junio de 2007.[23]​\nSegún Stallman los cambios más importantes se produjeron en el campo de las patentes de software, la compatibilidad de licencias de software libre, la definición de código fuente, y restricciones de hardware respecto a las modificaciones de hardware.[23]​[24]​ Otros cambios están relacionados con la internacionalización, cómo son manejadas las violaciones de licencias, y cómo los permisos adicionales pueden ser concedidos por el titular de los derechos de autor. También añade disposiciones para quitar al DRM su valor legal, por es posible romper el DRM en el software de GPL sin romper leyes como la DMCA.[25]​\nEl proceso de consulta pública fue coordinado por la Free Software Foundation con asistencia de Software Freedom Law Center, Free Software Foundation Europe,[26]​ y otros grupos de software libre. Los comentarios del público fueron recolectados a través del portal gplv3.fsf.org.[27]​\nDurante el proceso de consulta pública, 962 comentarios fueron presentados para el primer borrador.[28]​ Finalmente, al final del proceso se alcanzó la cifra de 2,636 comentarios.[29]​[30]​[31]​\nEl tercer borrador fue liberado el 28 de marzo de 2007.[32]​ Este borrador incluye mecanismos destinados a evitar acuerdos relativos a las patentes, como el controvertido acuerdo entre Microsoft y Novell y restringe las cláusulas anti-tivoización a una definición legal de un \"usuario\" o \"producto de consumo\". También elimina la sección de \"Limitaciones geográficas\", cuyo probable borrado se había anunciado en el lanzamiento de la consulta pública.\nEl cuarto borrador,[33]​ que fue el último, fue liberado el 31 de mayo de 2007. Introdujo la compatibilidad con las Licencias Apache, clarificó el rol de los contratistas externos, y hace una excepción para evitar los problemas provocados por el acuerdo Microsoft-Novell, estableciendo en el párrafo 6 de la Sección 11 lo siguiente:\nEl objetivo de esto es hacer este tipo de acuerdos ineficaces. La licencia está orientada a que Microsoft tenga que extender las licencias de patentes para garantizar a los clientes de Novell el uso de GPLv3, lo que es posible únicamente si Microsoft es distribuidor legal del software bajo GPLv3.[34]​[35]​\nAlgunos desarrolladores de alto nivel del núcleo Linux, comentaron e hicieron declaraciones públicas a los medios de comunicación sobre sus objeciones a los borradores 1 y 2.[36]​"}]}, {"name": "Términos y condiciones", "text": "Los términos y condiciones de GPL deben estar disponible para cualquiera que reciba una copia de la obra al cual ha sido aplicada esta licencia. Cualquier licencia que se le apliquen dichos términos da permiso a realizar modificaciones a una obra, realizar copias y distribuirla o distribuir cualquiera de sus versiones derivadas. Con esta licencia, está permitido cobrar por la distribución de cada copia, o no cobrar nada. Este último punto distingue las licencias GPL de las licencias de software que prohíben la distribución comercial. La FSF argumenta que en el software libre no debe haber cabida para las restricciones comerciales,[37]​ y las obras bajo este tipo de licencias pueden ser vendidas a cualquier precio.\nLa GPL, además, establece que un distribuidor no puede imponer \"restricciones sobre los derechos otorgados por la GPL\". Esta prohíbe actividades como la distribución del software bajo un acuerdo de confidencialidad o contrato. Distribuidores bajo la GPL también conceder una licencia para cualquiera de sus patentes software, para ser utilizadas en software GPL.\nLa cuarta sección de la versión 2 de la licencia y la decimoséptima sección de la versión 3 requieren que los programas distribuidos como binarios precompilados estén acompañados de una copia del código fuente, una oferta por escrito para distribuir el código fuente a través del mismo mecanismo que el binario pre-compilado, o una oferta por escrito para obtener el código fuente del binario recibido bajo la GPL. La segunda sección de la versión 2 y la sección quinta de la versión 3 también apuntan que hay que suministrar \"a todos los destinatarios una copia de esta Licencia junto con el Programa\". La versión 3 de la licencia permite que el código fuente esté disponible en distintas plataformas en cumplimiento de la séptima sección. Estos incluyen la descarga de código fuente desde un servidor de red adyacente o la obtención del mismo a través de peer-to-peer, siempre que el código compilado esté disponible y que haya \"instrucciones claras” sobre dónde encontrar el código fuente.\nLa FSF no permite la aplicación de derechos de copyright a una obra licenciada bajo GPL, al menos que el autor los aplique explícitamente (esto sucede raras veces en con excepción de los programas que forman parte del proyecto GNU). Solo los titulares de los derechos individuales tienen la autoridad para demandar una violación de la licencia cuando se lleva a cabo.", "subsections": [{"name": "Copyleft", "text": "Los derechos de distribución otorgados por la GPL para versiones modificadas de la obra no son incondicionales. Cuando alguien distribuye bajo GPL añadiendo a la obra sus propias modificaciones, los requisitos para la distribución de la totalidad de la obra no puede ser mayor que los requisitos que están en la GPL.\nEste requisito se conoce como copyleft. Que alcanza su verdadero potencial en el caso de los derechos de autor sobre el software. Si una obra GPL tiene derechos copyright, no se tendrá derecho a distribuir esta obra, realizar modificaciones (excepto para uso propio). Al aplicar una GPL a una obra, los derechos de la misma estarán protegidos por la ley de derechos de autor. Y si por el contrario, si se distribuye copias de la obra (licenciada bajo GPL) sin atenerse a los términos de la GPL (por ejemplo, al mantener en secreto el código fuente), puede ser demandado por el autor original de los derechos de autor.\nCopyleft por lo tanto utiliza la ley de copyright para lograr lo opuesto de su propósito usual: en lugar de imponer restricciones, otorga derechos, de tal manera que garantice que los derechos no puedan ser posteriormente quitados o restringidos. También asegura que si los derechos ilimitados de redistribución no se conceden o se produce cualquier falla legal se encuentra bajo la protección de la ley.\nMuchos distribuidores de programas bajo GPL empaquetan el código fuente con el ejecutable. Una alternativa que cumple las bases de copyleft es la de proporcionar una oferta por escrito para distribuir el código fuente en un medio físico (como por ejemplo un CD) bajo demanda. En la práctica muchos programas bajo la GPL se distribuyen por internet, y el código se encuentra alojado en servidores FTP, HTTP, etc.\nCopyleft solo se aplica cuando se trata de redistribuir el programa. Según sus bases, está permitido hacer privadas las modificaciones realizadas, sin obligación de divulgar las modificaciones siempre y cuando este software sea de uso propio (no sea redistribuido).\nHubo un debate sobre si se trataba de una violación de la GPL de liberar el código fuente tanto en forma ofuscada, como en forma deliberadamente compleja a la comprensión. El consenso general fue que, si bien no ética, no se consideró una violación. El asunto fue aclarado cuando la licencia fue modificada para exigir que tuviera que estar disponible la versión «preferida» del código fuente.[38]​"}, {"name": "Licencias y temas contractuales", "text": "GPL fue diseñado orientado más a una licencia que a un contrato.[39]​[40]​ En algunas jurisdicciones, la distinción legal entre una licencia y un contrato es muy importante: los contratos son ejecutables por la ley de contratos, mientras que las licencias se aplican en virtud del derecho de autor. Sin embargo, esta distinción no es útil en las diversas jurisdicciones en que no existen diferencias entre los contratos y licencias, como los sistemas de derecho civil.[41]​\nAquellos que no aceptan los términos de la GPL y sus condiciones no tienen permiso, en virtud del derecho de autor, a copiar o distribuir software con la GPL o trabajos derivados. Sin embargo, si no redistribuyen el programa, pueden utilizar el software en su organización a su gusto, y estas obras (incluidos los programas) construidas bajo este uso no requieren estar bajo esta licencia."}, {"name": "Propietarios del copyright", "text": "El texto que compone la GPL es en sí está protegido bajo copyright y es propiedad de la FSF. Sin embargo, la FSF no es titular del derecho de autor de una obra publicada bajo la GPL, a menos que el autor asigne explícitamente los derechos de autor a la FSF (que rara vez sucede con excepción de los programas que forman parte del proyecto GNU). Solo los titulares de los derechos individuales tienen la autoridad para demandar una violación de la licencia cuando se lleva a cabo.\nLa FSF permite al público crear nuevas licencias basadas en la GPL, siempre y cuando las licencias derivadas no utilicen GPL sin permiso. Esto no se recomienda, ya que tal licencia puede ser incompatible con la GPL.\nOtras licencias creadas por el proyecto GNU incluyen la GNU Lesser General Public License y la GNU Free Documentation License."}]}, {"name": "Compatibilidad y licencias múltiples", "text": "Código licenciado bajo varias licencias puede ser combinado con programas con licencias GPL sin conflictos, siempre que la combinación de restricciones del trabajo en su conjunto no ponga ninguna restricción adicional más allá de lo permitido por la GPL.[42]​ Además de los términos regulares de la GPL, hay restricciones y permisos adicionales que se pueden aplicar:\nSi se quiere combinar código bajo diferentes versiones de GPL, se puede hacer si el código con la versión más antigua de GPL incluye la declaración “cualquier versión posterior”.[43]​\nCódigo bajo LGPL puede ser vinculado con cualquier otro código, no importa que licencia tenga ese código.[44]​ Código bajo LGPLv2 sin la declaración “cualquier versión posterior” puede ser relicenciado si el trabajo al completo se licencia con una GPLv2 o una GPLv3.[45]​\nLa FSF mantiene una lista[46]​ de las licencias de software libre GPL-compatibles[47]​[48]​ con muchas de las licencias de software libre más comunes, como la licencia original MIT/X la licencia BSD (en su forma actual de tres cláusulas) y la licencia Artistic 2.0.[49]​\nDavid A. Wheeler ha abogado a los desarrolladores de software libre/abierto a que usen solo licencias GPL-compatibles, porque hacerlo de otra manera hace más difícil para los demás la participación y la contribución al código.[50]​ Como ejemplo específico de incompatibilidad, ZFS de Sun Microsystems no puede ser incluido en la GPL del núcleo Linux, porque este está bajo una GPL-incompatible CDDL. Además, ZFS está protegido por patentes, así que la distribución independiente desarrollada por una implementación GPL requeriría el permiso de Oracle.[51]​\nVarias empresas usan licencias múltiples para distribuir una versión GPL y vender una propietaria a otras compañías que quieran combinar el paquete de código con código propietario, usando una vinculación dinámica o no. Ejemplos de estas compañías incluyen MySQL AB, Digia PLC (Qt framework, antes del 2011 de Nokia), Red Hat (Cygwin) y RiverBank Computing (PyQt). Otras compañías, como Mozilla Foundation (algunos de sus productos incluyen Mozilla Application Suite, Mozilla Thunderbird y Mozilla firefox), usan licencias múltiples para distribuir versiones bajo GPL y otras licencias de código abierto.", "subsections": []}, {"name": "Validez legal", "text": "La GPL, al ser un documento que cede ciertos derechos al usuario, asume la forma de un contrato, por lo que usualmente se la denomina contrato de licencia o acuerdo de licencia.[52]​[53]​ En los países de tradición anglosajona existe una distinción doctrinal entre licencias y contratos, pero esto no ocurre en los países de tradición civil o continental. Como contrato, la GPL debe cumplir los requisitos legales de formación contractual en cada jurisdicción.\nLa licencia ha sido reconocida, entre otros,[54]​ por juzgados en Alemania, particularmente en el caso de una sentencia en un tribunal de Múnich,[55]​ lo que indica positivamente su validez en jurisdicciones de derecho civil.", "subsections": []}, {"name": "Adopción", "text": "El software bajo la GPL puede ser aplicado bajo todos los propósitos, incluidos los propósitos comerciales e incluso como herramienta de creación de software propietario. En uso puramente privativo (o interno), sin ventas ni distribuciones implicadas, el software puede ser modificado sin liberar el código fuente pero, de lo contrario, el código fuente y cualquier cambio realizado en él debe estar disponible para los usuarios, ya que en este caso los derechos del usuario están protegidos por copyleft. De esta forma, las aplicaciones instaladas en sistemas operativos prominentes bajo la GPL como Linux y también el GNU Compiler Collection, no es necesario que estén licenciadas bajo la GPL o que estén distribuidas con su código fuente disponible ya que las licencias no dependen de la plataforma. Por ejemplo, si un programa está formado completamente por código original, o si está combinado con software que no cumple los requisitos de copyleft no es necesario que se licencie bajo la GPL o que se distribuya con su código fuente disponible. Solo si un programa utiliza fragmentos de código GPL (y el programa es distribuido) el código fuente en su totalidad debe estar disponible, bajo la misma licencia. La otra licencia de GNU, LGPL (GNU Lesser General Public License) fue creada para tener derechos menos restrictivos que GPL, por lo que en este caso en un programa que utiliza fragmentos de código LGPL, no es necesario liberar el código original. Algunos otros programas de software libre (como ejemplo prominente esta MySQL) son de doble licencia bajo varias licencias, a menudo con uno de los certificados que son la GPL.", "subsections": []}, {"name": "Véase también", "text": " Portal:Software libre. Contenido relacionado con Software libre.\nRichard Stallman\nEben Moglen\nGNU LGPL\nAffero General Public License\nCopyleft\nLicencia Creative Commons\nSoftware libre y de código abierto\nAnti-copyright\nLicencia dual\nEuropean Union Public License (EUPL)\nLicencia de software", "subsections": []}, {"name": "Notas", "text": "↑ A excepción de software licenciado bajo licencias compatibles con la GPLv3.[5]​", "subsections": []}, {"name": "Referencias", "text": "↑ «Debian – License information». Software in the Public Interest, Inc. Consultado el 10 de diciembre de 2009. \n↑ a b «Licenses – Free Software Foundation». Free Software Foundation. Archivado desde el original el 11 de julio de 2007. Consultado el 10 de diciembre de 2009. \n↑ «Licenses by Name». Open Source Initiative. Consultado el 10 de diciembre de 2009. \n↑ «Copyleft: Pragmatic Idealism – Free Software Foundation». Free Software Foundation. Consultado el 10 de diciembre de 2009. \n↑ «If a library is released under the GPL (not the LGPL)». Free Software Foundation. \n↑ «Open Source License Data». Archivado desde el original el 22 de febrero de 2018. Consultado el 24 de abril de 2018. \n↑ GPL FAQ: Does using the GPL for a program make it GNU Software?\n↑ «Why the GPL rocketed Linux to success». «So while the BSDs have lost energy every time a company gets involved, the GPL'ed programs gain every time a company gets involved.» \n↑ «Why the GPL rocketed Linux to success» (en inglés). Consultado el 2 de abril de 2014. «So while the BSDs have lost energy every time a company gets involved, the GPL'ed programs gain every time a company gets involved.» \n↑ «The History of the GPL». Consultado el 24 de noviembre de 2011. \n↑ «Why Upgrade to GPL Version 3» (en inglés). Fsf.org. 13 de marzo de 2003. Consultado el 17 de marzo de 2011. \n↑ «Top 20 licenses». Black Duck Software. 19 de noviembre de 2015. Archivado desde el original el 19 de julio de 2016. Consultado el 19 de noviembre de 2015. «1. MIT license 24%, 2. GNU General Public License (GPL) 2.0 23%, 3. Apache License 16%, 4. GNU General Public License (GPL) 3.0 9%, 5. BSD License 2.0 (3-clause, New or Revised) License 6%, 6. GNU Lesser General Public License (LGPL) 2.1 5%, 7. Artistic License (Perl) 4%, 8. GNU Lesser General Public License (LGPL) 3.0 2%, 9. Microsoft Public License 2%, 10. Eclipse Public License (EPL) 2%». \n↑ David A. Wheeler. «Make Your Open Source Software GPL-Compatible. Or Else». \n↑ David A. Wheeler. «Estimating Linux's Size». \n↑ «Freecode's statistics page». Archivado desde el original el 28 de agosto de 2008. «GPL 60.5%, lGPLv2 6.9%, GPLv2 1.9% GPLv3 1.6%». \n↑ Asay, Matt (23 de julio de 2009). «GPLv3 hits 50 percent adoption | The Open Road - CNET News». News.cnet.com. Archivado desde el original el 29 de octubre de 2013. Consultado el 2 de septiembre de 2013. \n↑ License proliferation: a naive quantitative analysis on lwn.net \"Walter van Holst is a legal consultant at the Dutch IT consulting company mitopics. .[...] Walter instead chose to use data from a software index, namely Freecode [...] Walter's 2009 data set consisted of 38,674 projects [...]The final column in the table shows the number of projects licensed under \"any version of the GPL\". In addition, Walter presented pie charts that showed the proportion of projects under various common licenses. Notable in those data sets was that, whereas in 2009 the proportion of projects licensed GPLv2-only and GPLv3 was respectively 3% and 2%, by 2013, those numbers had risen to 7% and 5%.\"\n↑ «Top 20 licenses». Black Duck Software. 23 de agosto de 2013. Archivado desde el original el 19 de julio de 2016. Consultado el 23 de agosto de 2013. «1. GNU General Public License (GPL) 2.0 33%, 2. Apache License 13%, 3. GNU General Public License (GPL) 3.0 12%». \n↑ «GNU General Public License, version 1» (en inglés). Consultado el 2 de abril de 2014. \n↑ «New General Public License». 25 de febrero de 1989. Consultado el 2 de abril de 2014. \n↑ «Transcripción de la presentación de Richard Stallman en la 2da Conferencia Internacional GPLv3, 21 de abril de 2006». Consultado el 2 de abril de 2014. \n↑ «El Proyecto GNU». 14 de marzo de 2014. Consultado el 2 de abril de 2014. \n↑ a b Stallman, Richard (25 de febrero de 2006). «Presentation in Brussels, Belgium—the first day of that year's FOSDEM conference.». \n↑ «Interview with Richard Stallman». Free Software Magazine (en inglés). 23 de enero de 2008. Archivado desde el original el 20 de noviembre de 2017. Consultado el 2 de abril de 2014. \n↑ «Neutralizing Laws That Prohibit Free Software But Not Forbidding DRM» (en inglés). Free Software Foundation. Consultado el 2 de abril de 2014. \n↑ «GPLv3: Creando la 3ª versión de la General Public License de GNU». Free Software Foundation Europe. Consultado el 2 de abril de 2014. \n↑ «gplv3.fsf.org comments for discussion draft 4». Archivado desde el original el 2 de octubre de 2008. Consultado el 2 de abril de 2014. \n↑ «gplv3.fsf.org comments for draft 1». Archivado desde el original el 26 de junio de 2008. Consultado el 11 de enero de 2013. «Showing comments in file 'gplv3-draft-1' [...] found 962». \n↑ «gplv3.fsf.org comments for draft 2». Archivado desde el original el 24 de julio de 2008. Consultado el 11 de enero de 2013. «Showing comments in file 'gplv3-draft-1' [...] found 727». \n↑ «gplv3.fsf.org comments for draft 3». Archivado desde el original el 3 de julio de 2008. Consultado el 11 de enero de 2013. «Showing comments in file 'gplv3-draft-3' [...] found 649». \n↑ «gplv3.fsf.org comments for draft 4». Archivado desde el original el 2 de octubre de 2008. Consultado el 11 de enero de 2013. «Showing comments in file 'gplv3-draft-4' [...] found 298». \n↑ «Guide to the third draft of GPLv3» (en inglés). 29 de junio de 2007. Consultado el 2 de abril de 2014. \n↑ «Final Discussion Draft». Consultado el 4 de junio de 2007. \n↑ «GPL version 3 FAQ». Consultado el 4 de junio de 2007. \n↑ «Fourth Discussion Draft Rationale». Consultado el 4 de junio de 2007. \n↑ «Kernel developers' position on GPLv3». LWN.net. Consultado el 4 de junio de 2007. \n↑ «Selling Free Software». Free Software Foundation. \n↑ «Reasoning behind the \"preferred form\" language in the GPL». LWN.net. 7 de marzo de 2011. \n↑ «Essay by Stallman explaining why a license is more suitable than a contract». \n↑ «Eben Moglen explaining why the GPL is a license and why it matters». \n↑ Guadamuz-Gonzalez, Andres (2004). «Viral contracts or unenforceable documents? Contractual validity of copyleft licenses». European Intellectual Property Review 26 (8): 331-339. \n↑ «The GNU General Public License v3.0 – GNU Project – Free Software Foundation (FSF)». fsf.org. Consultado el 24 de marzo de 2010. \n↑ «Frequently Asked Questions about the GNU Licenses – Is GPLv3 compatible with GPLv2?». The official site. Consultado el 13 de abril de 2011. \n↑ «GNU Lesser General Public License v2.1 – GNU Project – Free Software Foundation (FSF)». fsf.org. Consultado el 26 de abril de 2011. \n↑ «Frequently Asked Questions about the GNU Licenses – How are the various GNU licenses compatible with each other?». The official site. Consultado el 13 de abril de 2011. \n↑ «Various licenses with comments – GPL-Compatible Free Software Licenses». FSF. Consultado el 20 de abril de 2012. \n↑ «Frequently Asked Questions about the GNU Licenses – What does it mean to say that two licenses are \"compatible\"?». FSF. Consultado el 14 de abril de 2011. \n↑ «Frequently Asked Questions about the GNU Licenses – What does it mean to say a license is \"compatible with the GPL?\"». FSF. Consultado el 14 de abril de 2011. \n↑ «Black Duck Open Source Resource Center». blackducksoftware.com. Archivado desde el original el 14 de octubre de 2012. Consultado el 26 de abril de 2011. \n↑ «Make Your Open Source Software GPL-Compatible. Or Else.». David A. Wheeler. Consultado el 26 de abril de 2011. \n↑ Linux: ZFS, Licenses and Patents | KernelTrap\n↑ OMPI (1994). Glosario de Derechos de Autor y Derechos Conexos. Ginebra: World Intellectual Property Organization. p. 145. \n↑ Roncero Sánchez, Antonio (1999). El Contrato de Licencia de Marca. Madrid: Civitas. p. 64. \n↑ Web que recopila violaciones de la GPL denunciadas\n↑ Höppner, Julian (2004). «The GPL prevails: An analysis of the first-ever Court decision on the validity and effectivity of the GPL». SCRIPT-ed 1 (4): 628. doi:10.2966/scrip.010304.628. Archivado desde el original el 29 de octubre de 2007. ", "subsections": []}, {"name": "Enlaces externos", "text": "GPL en inglés (oficial)\nLista de traducciones no oficiales de la GPL a diversos idiomas\nTraducción no oficial del primer borrador de la GPL v3\nLicencias compatibles e incompatibles con la GPL\nTraducción no oficial de la GPL al castellano\nTraducciones no oficiales al español de la GPL\nAnálisis de la GPLv3\nDiseño de logos alternativos de las licencias GPLv3 (.svg) por Christian Cadena(CC BY 3.0", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/GTK", "title": "GTK", "summary": "GTK (conocido hasta febrero de 2019 como GTK+)[1]​[2]​ o The GIMP Toolkit[3]​[4]​: 3  es una biblioteca de componentes gráficos multiplataforma para desarrollar interfaces gráficas de usuario (GUI).[5]​[4]​: 3  Está licenciado bajo los términos de la GNU LGPL,[5]​ por lo que permite la creación de tanto software libre como software privativo. GTK es parte del proyecto GNU,[5]​ siendo usado por proyectos tan importantes como GIMP, Inkscape, GNOME, Xfce, entre otros.\nJunto a Qt, es uno de los kit de herramientas de widgets más popular para el sistema operativo GNU/Linux, teniendo un amplio soporte para Wayland y XOrg. Además, se puede emplear para desarrollar aplicaciones gráficas que funcionen sobre otros sistemas Unix-like o sistemas operativos como Microsoft Windows, Mac OS, entre otros.", "sections": [{"name": "Historia y Desarrollo", "text": "Fue desarrollada inicialmente por Peter Mattis, Spencer Kimball y Josh MacDonald[3]​[4]​: 3  para implementar la interfaz gráfica del programa de Manipulación de Imágenes de GNU (GIMP) como reemplazo del kit de herramientas Motif; en algún momento Peter Mattis se desencantó con Motif y comenzó a escribir su propio kit de herramientas GUI llamado GIMP toolkit, reemplazando con éxito Motif para la versión 0.60 de GIMP. Finalmente, GTK fue reescrito para ser orientado a objetos y pasó a llamarse GTK+, haciéndose uso de esto por primera vez en la versión 0.99 de GIMP. Siendo la primera versión estable de GTK lanzada el 14 de abril de 1998.[6]​\nGTK está escrito en lenguaje C, y es principalmente desarrollado por el Proyecto GNOME,[7]​ ya que en 1997 este proyecto escoge GTK como base sobre la cual desarrollar el entorno de escritorio GNOME.[8]​ Otras aplicaciones gráficas no directamente relacionadas con GNOME también han empleado GTK. Además de otros entornos gráficos para Linux como XFCE y ROX han elegido también GTK como su biblioteca de componentes gráficos.\nEl desarrollo de GTK se maneja libremente. La discusión ocurre principalmente en varias listas de correo públicas.[9]​ Los desarrolladores y usuarios de GNOME se reúnen en una reunión anual GNOME Users And Developers European Conference GUADEC para discutir el estado actual y la dirección futura de GNOME.[10]​ GNOME incorpora estándares y programas de freedesktop.org para interactuar mejor con otros escritorios.", "subsections": [{"name": "GTK+ 1", "text": "Esta biblioteca contenía algunas rutinas de ayuda para resolver tareas básicas de programación, como el almacenamiento de diversos datos. Estos requieren mucho tiempo para el programador, especialmente cuando se trata del desarrollo repetido de programas. Las primeras versiones de GTK incluían estructuras de datos para listas vinculadas, árboles binarios o cadenas \"en crecimiento\". Además, ya que fue reescrito para ser orientado a objetos, GTK permite usar este paradigma de programación dentro del lenguaje C. Estas herramientas también resultaron útiles para programas sin una interfaz gráfica de usuario y por lo tanto más tarde se trasladaron a una biblioteca separada, llamada biblioteca GLib de funciones C. El sistema orientado a objetos en la siguiente versión se relevo a la biblioteca GObject, los métodos de dibujo orientados al sistema a la biblioteca GDK (GTK + Kit de dibujo). Este último permite que GTK se ejecute de forma idéntica en plataformas en Windows, X Window System, macOS , entre otros."}, {"name": "GTK+ 2", "text": "La versión GTK 2 recibió nuevas funciones mejoradas para renderizar texto usando la biblioteca Pango, la creación de GObject, un nuevo motor de temas, una API más flexible y una biblioteca novedosa (ATK) para mejorar la accesibilidad del kit de herramientas para personas discapacitadas, por ejemplo, se puede abordar el software de lectura, las herramientas de aumento y los dispositivos de entrada alternativos. GTK 2 no es compatible con GTK 1, por lo que las aplicaciones existentes tuvieron que ser portadas.\nA partir de la versión 2.8, GTK + usa la biblioteca Cairo basada en vectores, que usa aceleración de hardware para renderizar si es posible. GTK 2.24 es la última versión de la serie 2.x."}, {"name": "GTK 3", "text": "La versión 3.0 fue lanzada el 10 de febrero de 2011.[11]​ Muchas funciones que se clasificaron como obsoletas se han eliminado y se han mejorado las interfaces existentes. GTK 3 no es compatible con versiones anteriores de GTK 2.x. Sin embargo, las bibliotecas de ambas versiones se pueden instalar en paralelo.\nLa serie GTK 3 incluye una nueva interfaz para dibujar widgets, que ahora está completamente basada en Cairo, un motor de temas basado en CSS que también permite transiciones de estado animadas, opciones de diseño mejoradas, un nuevo widget de interruptor deslizante, una clase de aplicación, soporte para múltiples dispositivos señaladores (punteros múltiples) e iconos simbólicos eso puede cambiar de color según la condición. Las estructuras internas se han separado y ocultado de la interfaz pública, por lo que será más fácil realizar cambios en el futuro sin tener que romper la interfaz. Además, se admiten múltiples backends GDK simultáneamente dentro de la misma biblioteca.[12]​ Hasta ahora, varias bibliotecas eran necesarias.\nSe introdujeron dos nuevos backends: uno para el servidor de visualización Wayland y un back-end HTML5 llamado Broadway, con el que las aplicaciones GTK pueden operarse de forma remota en el navegador a través de la red.[13]​ Se admite el desplazamiento múltiple y suave, que también está disponible para Windows,[14]​ además, se admite animaciones CSS y difuminación de sombras. La versión 3.6.4 es la última versión oficial para Windows de 32 bits y 64 bits.[15]​\nExisten más cambios como la mejora de la visualización de los monitores de alta resolución.[16]​ La presentación de Popover (burbujas de discurso cómicas que se pueden usar como ayuda),[17]​ se admite gestos multitáctiles.[18]​[19]​ Además, se admite la representación de ventanas a través de OpenGL. El nuevo elemento de control GtkGLArea también permitió integrar objetos 3D directamente en las interfaces del programa.[20]​[21]​ Desde GTK 3.18 (base de Gnome 3.18), la biblioteca es oficialmente compatible con Wayland, el sucesor del sistema X Windows.[22]​ GTK 3.20 integra el corrector ortográfico con gspell y mejora la temática CSS. Mientras que GTK 3.22 se presenta como una versión LTS y añade soporte a portales Flatpak para instalaciones de software simples.[23]​\nEl 1 de septiembre de 2016, una publicación en el blog de desarrollo de GTK denotó, entre otras cosas, el futuro esquema de numeración de GTK.[24]​ La versión 3.22 de GTK del otoño de 2016 será la última versión 3.x (o al menos eso era lo planeado).[25]​ Después de eso, todos los recursos se trasladarán a la serie de desarrollo GTK 4 con los nombres de versión 3.90, 3.92, etc. Incluso cuando la serie 4.x entre en desarrollo, las aplicaciones notables aún usan GTK 2.x y no se han portado a 3.22. Con respecto al futuro del software heredado que usa GTK, no existe un proyecto colectivo para portar el software GTK 2.x a 3.22.\nGTK 4.0 se está preparando con la serie inestable 3.9x. En marzo de 2017, se agregó el Scene Graph Kit (GSK) con la versión 3.90. Implementa un gráfico de escena y se encarga de la síntesis de imágenes. En febrero de 2019 se anunció que GTK 4.0 eliminará el signo más (\"+\") de la parte del nombre.[1]​"}, {"name": "GTK 4", "text": "Una de las principales novedades implementadas durante el ciclo de desarrollo de GTK 4 (es decir, GTK 3.92, etc.) ha sido la delegación de funcionalidad a objetos auxiliares en lugar de codificarla en las clases base proporcionadas por GTK.\nEl manejo de eventos desde los controladores de señales descritos por GtkWidget se delega a los controladores de eventos\nLa representación se delega a los objetos GtkSnapshot\nEl mecanismo de diseño de GtkWidget se delega a GtkLayoutManager\nEl 26 de enero de 2018 en DevConf.cz, Matthias Clasen ofreció una visión general del estado actual del desarrollo de GTK 4, incluida una explicación de alto nivel sobre cómo funcionaba el renderizado y la entrada en GTK 3, qué cambios se estaban realizando en GTK 4, y las razones de esos cambios. También se dieron ejemplos de cosas que se han hecho posibles con GTK 4.[26]​"}, {"name": "Soporte", "text": "Windows\nDe acuerdo con GTK 2.24.10 y 3.6.4, se detuvo el desarrollo de Windows con el instalador en Gnome. Se recomienda instalar el sistema de paquetes MSYS2 de Gnome en Windows.\nGTK 2.24.10 y 3.6.4 todavía están disponibles en la red, sin embargo, en comparación con las versiones actuales en Linux, están mucho más afectados por los errores.[27]​[28]​\nPara Windows de 64 bits (a partir de junio de 2018), el trabajo de Tom Schoonjans 2.24.32 (actual como Linux) y 3.22.30 (actual como Linux) ya está disponible.[29]​\nCon Windows 10 Fall Creators Update, GTK 3 ahora también está disponible en WSL. Las instrucciones para instalar programas con Windows están disponibles en la comunidad GTK.[30]​ Con distribuciones de Linux como Ubuntu o Debian disponibles en la Tienda Windows y un servidor X como Xming o VcXsvr, miles de programas como GTK 2 o 3 pueden ejecutarse con X o soporte de terminal.\nmacOS\nSobre el backend Quartz,[31]​ un puerto del sistema X Window, GTK puede usarse en macOS ."}, {"name": "Automatización de compilación", "text": "Anteriormente, GTK (y GNOME, GLib, etc.) utilizaban el sistema de compilación GNU (denominado Autotools) como el sistema de automatización de compilación elegido.\nDesde el 14 de agosto de 2017, la rama maestra de GTK compila con Meson, y los archivos del sistema de compilación de Autotools se han eliminado.[32]​"}]}, {"name": "Bibliotecas de GTK", "text": "GTK se basa en varias bibliotecas desarrolladas por el equipo de GTK y de GNOME:", "subsections": [{"name": "GLib", "text": "Artículo principal:\nEs un conjunto de bibliotecas de bajo nivel, que comprende, GLib Core, GObject y GIO.[33]​ Estas bibliotecas se desarrollan todas bajo un mismo repositorio de Git, denominado glib. Por lo que \"GLib\" puede referirse a \"GLib core\" o todo el conjunto de bibliotecas.\nGLib core\nGLib core proporciona el manejo de estructura de datos para C (Listas enlazadas, árboles, tablas hash, entre otras), envoltorios de portabilidad, bucle de eventos, subprocesos, carga dinámica de módulos y muchas más funciones.\nGObject\nGObject por su parte, simplifica los paradigmas de Programación orientada a objetos y la Arquitectura dirigida por eventos para C. La Arquitectura dirigida por eventos no solo es útil para interfaces gráficas de usuario sino también para demonios que respondan a cambios de hardware (insertar un USB, un monitor, etc), software de red u otros procesos, puede llegar a ser de bastante utilidad.\nGIO\nGIO depende de las anteriores bibliotecas del conjunto, este proporciona un API de alto nivel para entrada y salida, ya sea la lectura de un archivo local, una secuencia de red, procesos de comunicación con D-Bus y muchos usos más.\nEste conjunto de bibliotecas permite escribir servicios del sistema operativo, bibliotecas, utilidades de línea de comando y mucho más. Por lo que puede llegar a ser más cómodo y recomendable escribir un programa en C haciendo uso de GLib, además, ofrece una API de alto nivel como el estándar POSIX."}, {"name": "GTK", "text": "Biblioteca que contiene un kit de herramientas de widgets basados en GLib, este kit realmente contiene los objetos y funciones para crear la Interfaz gráfica de usuario (GUI). Maneja widgets como ventanas, botones, menús, etiquetas, deslizadores, pestañas, etc."}, {"name": "GDK", "text": "Biblioteca que actúa como intermediario entre gráficos de bajo nivel y gráficos de alto nivel. De manera que libera a GTK de preocupaciones de bajo nivel como la recopilación de entrada, arrastrar y soltar y la conversión de formato de píxeles. GDK es una capa intermedia que separa GTK de los detalles del sistema de ventanas.\nGDK es una parte importante de la portabilidad de GTK. Dado que GLib ya proporciona la funcionalidad multiplataforma de bajo nivel, todo lo que se necesita para hacer que GTK se ejecute en otras plataformas es portar GDK a la capa de gráficos del sistema operativo subyacente. Por lo tanto, los puertos GDK a la API de Windows y Quartz son los que permiten que las aplicaciones GTK se ejecuten en Windows y macOS, respectivamente."}, {"name": "ATK", "text": "Biblioteca para crear interfaces con características de una gran accesibilidad muy importante para personas discapacitadas o minusválidos. Pueden usarse utilerías como lupas de aumento, lectores de pantalla, o entradas de datos alternativas al clásico teclado o ratón."}, {"name": "Pango", "text": "Biblioteca para el diseño y renderizado de texto, hace hincapié especialmente en la internacionalización. Está diseñado de forma modular, esto significa que Pango puede ser usado por aplicaciones de diferentes arquitecturas o metodologías de programación. Además, es el núcleo para manejar las fuentes y el texto de la versión 2 de GTK."}, {"name": "Cairo", "text": "Biblioteca de renderizado avanzado de controles de aplicación. usada para proporcionar imágenes basadas en gráficos vectoriales. Además, proporciona primitivas para el dibujo bidimensional a través de una serie de backends diferentes."}]}, {"name": "Diseñadores de interfaces gráficas (GUI)", "text": "Algunos de los programas para diseño de interfaces gráficas con GTK son los siguientes:", "subsections": [{"name": "Glade", "text": "Es una herramienta de desarrollo visual de interfaces gráficas mediante GTK/GNOME. Es independiente del lenguaje de programación y predeterminadamente no genera código fuente sino un archivo XML gracias a GTKBuilder, que puede ser usado en numerosos lenguajes de programación incluyendo C, C++, C#, Vala, Java, Perl, Python. La posibilidad de generar automáticamente código fuente fue descontinuada desde la versión 3 de Glade.\nDe manera más técnica la clase describe la interfaz en un archivo de Lenguaje de marcado extensible (XML) y luego carga la descripción XML en tiempo de ejecución y crea los objetos automáticamente. Glade Interface Designer permite la creación de la interfaz de usuario de manera WYSIWYG. Por lo que la descripción de la interfaz de usuario es independiente del lenguaje de programación utilizado.\nGlade puede ser utilizado de manera directa, pero también está totalmente integrado en Anjuta 2. El proyecto se encuentra bajo la licencia GPL."}, {"name": "Stetic", "text": "Parte de MonoDevelop, orientado al trabajo con GTK#, Stetic es muy similar a Glade Interface Designer, pero está integrado en MonoDevelop con funciones como arrastrar y soltar. Ha sido criticado por ser más difícil de trabajar que Qt Designer y Microsoft Visual Studio Windows Forms Editor cuando el programador aún no tiene un diseño concreto en mente.\nMonoDevelop puede ejecutarse en las distintas distribuciones de Linux y en Mac. Desde la versión 2.2, MonoDevelop ya cuenta con soporte completo para GNU/Linux, Windows y Mac. Además, incluye un compilador que admite C # 1.0, C # 2.0, C # 3.0, C # 4.0, C # 5.0 y C # 6.0."}]}, {"name": "Uso", "text": "", "subsections": [{"name": "Aplicaciones", "text": "Editor de imagenes GIMP 2.10.8.\nEditor de gráficos vectoriales Inkscape 1.0.\nEditor de vídeo Pitivi.\nCliente para la red BitTorrent Transmission 2.92.\nAlgunas aplicaciones que usan GTK para desarrollar sus interfaces de usuario incluyen:\nAbiWord - Procesador de textos.\nCinePaint (ex FilmGimp) - Editor de gráficos animados en HDR.\nEkiga (ex GnomeMeeting) - Software telefónico VoIP H.323/SIP.\nEvolution - Cliente de correo electrónico.\nFirefox - Navegador web.\nGeany : un editor de texto IDE y GTK multiplataforma ligero basado en Scintilla .\nGIMP - Editor de gráficos.\nGNU Emacs puede usar GTK cuando se ejecuta en X.\nGnumeric - Programa de hoja de cálculo.\nChromium - Navegador Web basado en WebKit y desarrollado en gran medida por Google.\nGRAMPS - Software de genealogía.\nInkscape - Editor de gráficos vectoriales SVG.\nK-3D - Programa de modelado 3D libre.\nLiVES - Editor de video\nMarionnet - Un simulador de red interactivo.\nMidori - Navegador Web ligero, forma parte del proyecto XFCE.\nNero Linux - Un programa para la edición de discos.\nPidgin - Cliente de mensajería instantánea.\nVMware Player - Máquina virtual.\nWireshark - Capturador y analizador de paquetes de redes computacionales."}, {"name": "Entornos que utilizan GTK", "text": "Escritorio GNOME 3.36.3\nelementary OS Hera\nEscritorio XFCE 4.14\nEscritorio Cinnamon 4.4.8\nEscritorio MATE 1.20\nActivos\nGNOME, está basado en GTK 3, junto a los programas del entorno\nXfce, está basado en GTK 3\nCinnamon, una bifurcación de GNOME 3 que usa GTK 3\nMATE, una bifurcación de GNOME 2 y utiliza GTK 3 desde la versión 1.18\nPantheon, usa GTK 3 exclusivamente, desarrollado por Elementary OS\nBudgie construido desde cero para el sucesor de SolusOS, el sistema operativo Solus\nSugar un entorno de escritorio para la educación primaria juvenil, que utiliza GTK, especialmente PyGTK\nPhosh, una interfaz de usuario móvil diseñada para PureOS\nOne Laptop Per Child usa GTK y PyGTK\nMaemo (Nokia's Internet-tablet framework)\nInactivos\nUnity , el antiguo entorno de escritorio predeterminado de Ubuntu\nLXDE, está basado en GTK, significa \"Lightweight X11 Desktop Environment\"\nROX Desktop un escritorio ligero, con características de la GUI de RISC OS\nGPE Palmtop Environment\nAccess Linux Platform (sucesor de la plataforma Palm OS PDA)\nLos entornos de escritorio no son necesarios para ejecutar los programas GTK. Si las bibliotecas que requiere el programa están instaladas, un programa GTK puede ser ejecutado por encima de otros entornos basadas en X11 como KDE o cualquier otro entorno, lo que incluye Mac OS X, si X11.app está instalado. GTK también puede ejecutarse en Microsoft Windows, es utilizado por algunas aplicaciones populares multiplataforma como Pidgin y GIMP. wxWidgets, un toolkit gráfico multiplataforma usa GTK en sistemas tipo Unix.[34]​ Algunos de los ports más inusuales incluyen directfb y ncurses."}, {"name": "Gestor de ventanas", "text": "IceWM\nMarco\nMetacity\nMuffin\nMutter\nSawfish\nXfwm"}]}, {"name": "Implementaciones disponibles", "text": "Dado que GTK es una biblioteca C pura, se puede vincular fácilmente a muchos otros lenguajes de programación. Con los lenguajes de programación orientados a objetos, los GObjects no se usan ; los objetos GTK generalmente se pueden usar allí como objetos nativos del lenguaje de programación. El lenguaje de programación Vala utiliza GObject directamente como un sistema de objetos y, por lo tanto, no requiere una biblioteca en tiempo de ejecución para la conexión del lenguaje.\nExiste una gran variedad de lenguajes de programación con los cuales se puede usar GTK,[35]​ aunque no en todos está disponible en su última versión. Entre los más usados están los siguientes:", "subsections": []}, {"name": "Ejemplos", "text": "La forma clásica de programar con GTK es definir primero las propiedades de los elementos gráficos utilizados, luego agruparlos y vincularlos a rutinas específicas de manejo de eventos (un posible evento sería hacer clic en un botón , por ejemplo ). Sin embargo, también hay herramientas de diseño gráfico para superficies GTK como Glade o Stetic contenidas en MonoDevelop , que pueden ahorrarle los dos primeros pasos, expandir GTK con capacidades de creación de prototipos y hacer posible realizar cambios en la superficie de un programa sin tener que hacer cambios en el código fuente del software.", "subsections": [{"name": "C", "text": "Un programa típico de Hello World que se muestra en la imagen podría verse así:\n// Incluir gtk\n#include\n \n<gtk/gtk.h>\nstatic\nvoid\non_activate\n(\nGtkApplication\n*\napp\n)\n{\n  \n// Crear una nueva ventana\nGtkWidget\nwindow\n=\ngtk_application_window_new\n);\n// Crear un nuevo boton\nbutton\ngtk_button_new_with_label\n\"¡Hola Wikipedia!\"\n// Cuando se hace clic en el botón, destruye la ventana pasada como un argumento\ng_signal_connect_swapped\n,\n\"clicked\"\nG_CALLBACK\ngtk_widget_destroy\n),\ngtk_container_add\nGTK_CONTAINER\ngtk_widget_show_all\n}\nint\nmain\nargc\nchar\nargv\n[])\n// Crear una nueva aplicación\ngtk_application_new\n\"com.example.GtkApplication\"\n                                             \nG_APPLICATION_FLAGS_NONE\ng_signal_connect\n\"activate\"\non_activate\nNULL\nreturn\ng_application_run\nG_APPLICATION\nPara compilar este código son necesarias algunas dependencias según el sistema que poseas, en caso de usar Debian o derivadas sudo apt-get install libgtk-3-dev o en caso de usar Fedora sudo dnf install gtk3-devel clutter-devel webkit2gtk3-devel libgda-devel gobject-introspection-devel.[36]​ Para compilar el código, es necesario ubicarse en la ruta del archivo y escribir lo siguiente en una terminal\nPara ejecutar el archivo, se escribe"}, {"name": "Python", "text": "import\ngi\ngi\n.\nrequire_version\n\"Gtk\"\n\"3.0\"\nfrom\ngi.repository\nGtk\nWindow\ntitle\n\"¡Hola Wikipedia!\"\nshow\n()\nconnect\n\"destroy\"\nmain_quit\nmain\nPara abrir este código son necesarias algunas dependencias según el sistema que poseas,[37]​ en caso de usar Debian o derivadas sudo apt install python3-gi python3-gi-cairo gir1.2-gtk-3.0 o en caso de usar Fedora sudo dnf install python3-gobject gtk3.\nPara ejecutar el archivo, es necesario ubicarse en la ruta del archivo, luego ejecutarlo escribiendo"}]}, {"name": "Estilo gráfico", "text": "La apariencia de GTK es en gran medida configurable por el usuario, existiendo una gran cantidad de temas para elegir. Estos temas pueden ser descargados de diferentes sitios como GNOME Look. Los siguiente son los más populares:", "subsections": [{"name": "Adwaita", "text": "Es el nuevo tema estándar de GTK desde mediados de 2014, siendo el tema sobre el que se recomienda trabajar para realizar desarrollos en interfaces gráficas. Esto fue expresado en una carta abierta por los desarrolladores de las aplicaciones GNOME, donde invitaban a usar el tema predeterminado (es decir Adwaita), ya que aseguraban que hacer uso de otros temas podría traer diferencias en la percepción del usuario final, en un mismo programa.[38]​\nAfirmando que al alterar las hojas de estilo GTK las aplicaciones podrían parecer dañadas o inutilizables, los iconos podrían representar conceptos diferentes al pensado por el programador. También aseguraban que las capturas encontradas dentro de tiendas de software podrían engañar al usuario de la apariencia de la aplicación, y además, que podría llegar a generar conflictos en la compresión de la documentación para el usuario final.\nEsta propuesta fue aceptada por diferente distribuciones, las cuales adoptaron directamente Adwaita, o basaron sus temas sobre este, como es el caso de Ubuntu con su tema Yaru.[39]​"}, {"name": "Yaru", "text": "Es el tema oficial de Ubuntu, posee diferentes tonalidades las cuales puede elegir el usuario. El tema se basa en Adwaita."}]}, {"name": "Crítica", "text": "La crítica más común de GTK es la falta de compatibilidad con versiones anteriores en las principales actualizaciones, sobre todo en la interfaz de programación de aplicaciones (API)[40]​ y temas.[41]​\nBenjamin Otte explicó que las interrupciones de compatibilidad entre lanzamientos menores durante el ciclo de desarrollo de GTK 3.x se debieron a fuertes presiones para innovar, como proporcionar las características que los usuarios modernos esperan y apoyar el protocolo de servidor de pantalla Wayland cada vez más influyente. Con el lanzamiento de GTK 4, se habrá liberado la presión de la necesidad de innovar y el equilibrio entre estabilidad e innovación se inclinará hacia la estabilidad.[42]​ Del mismo modo, los cambios recientes en la temática están destinados específicamente a mejorar y estabilizar esa parte de la API, lo que significa que alguna inversión ahora debería recompensarse más adelante.\nDirk Hohndel, desarrollador de código de Subsurface y miembro del Centro de Tecnología de Código Abierto de Intel, criticó a los desarrolladores de GTK por ser abrasivos e ignorar la mayoría de las solicitudes de la comunidad.[43]​\nHong Jen Yee, desarrollador de LXDE (cuya versión GTK se eliminará y todos los esfuerzos se centraron en el puerto Qt),[44]​ expresó su desdén por la versión 3 de los cambios radicales de API del kit de herramientas GTK y el mayor uso de memoria, y portó el archivo PCMan File Manager (PCManFM) a Qt. PCManFM se está desarrollando con un GTK y con un backend Qt al mismo tiempo.[45]​\nEl reproductor de música Audacious se mudó a Qt en la versión 3.6.[46]​ Las razones indicadas por los desarrolladores para esto incluyen una transición a las decoraciones de ventanas del lado del cliente, que según ellos hacen que la aplicación se vea \" GNOME -y y fuera de lugar\".[47]​\nWireshark ha cambiado a Qt debido a que no tiene una buena experiencia con el soporte multiplataforma de GTK.[48]​", "subsections": []}, {"name": "Historial de lanzamientos", "text": "Versión antigua, sin servicio técnico:\nGtkFontSelector\nGtkPacker\nGtkItemFactory\nGtkCTree\nGtkInvisible\nGtkCalendar\nGtkLayout\nGtkPlug\nGtkSocket\nLeyenda:\nVersión antigua\nVersión antigua, con soporte técnico\nÚltima versión\nÚltima versión previa\nLanzamiento futuro\nSoporte general para UTF-8\nGtkFileChooser\nGtkComboBox\nGtkComboBoxEntry\nGtkExpander\nGtkFontButton\nGtkColorButton\nGtkIconView\nGtkAboutDialog\nGtkCellView\nEl último en admitir Windows 98/Me\nGtkStatusIcon\nGtkAssistant\nGtkLinkButton\nGtkRecentChooser\nSoporte de impresión: GtkPrintOperation\nAdvertencia de bloqueo de mayúsculas en la entrada de contraseña\nMejoras en GtkScale, GtkStatusIcon, GtkFileChooser\nMejora en el selector de archivos, impresión\nPara eliminar gran parte del IPC necesario entre la aplicación X11 y el servidor X11, GDK se reescribe (principalmente por Alexander Larsson) para usar \"ventanas del lado del cliente\", es decir, la ventana GdkWindow, que cada widget debe tener, pertenece ahora al cliente\nGtkSpinner\nGtkToolPalette\nGtkOffscreenWindow\nMejora en el selector de archivos, manejo del teclado, GDK\nLos datos de introspección ahora se incluyen en GTK\nLa mayoría de los dibujos de GDK se basan en Cairo\nMuchos datos internos ahora son privados y se pueden sellar en preparación para GTK 3\nVersión antigua, con servicio técnico:\nEl backend de impresión CUPS puede enviar trabajos de impresión como PDF\nGtkBuilder ha obtenido soporte para etiquetas de texto y botones de herramientas de menú y se agregaron muchas correcciones de anotación de introspección\nMigración de GTK + 2.x a GTK + 3\nEl primer borrador de la hoja de ruta para el desarrollo se publicó el 9 de abril de 2009[65]​\nCompletado principalmente Proyecto Ridley\nEl intento de consolidar varias bibliotecas externas a GTK +\nIncluyendo libgnome, libgnomeui, libgnomeprint22, libgnomeprintui22, libglade, libgnomecanvas, libegg, libeel, gtkglext, and libsexy[66]​\nTodo el renderizado se realiza usando Cairo\nGDK se convirtió X11 agnóstico\nXInput2, el tema API se basa en Hoja de estilos en cascada (CSS), lo que empeora el rendimiento alcanzable para 60 Hz fotogramas por segundos\nGtkLockButton\nGtkOverlay\nNuevo cuadro de diálogo para selector de fuente\nNuevos backends experimentales:\nWayland\nHTML5 (llamado \"Broadway\")\nUn nuevo selector de color\nSoporte agregado para dispositivos táctiles\nSoporte agregado para desplazamiento suave\nGtkScrolledWindow realizará desplazamiento cinético con dispositivos táctiles\nSe ha mejorado la compatibilidad con macOS\nEsta es la primera versión de GTK 3 que funciona bien en Windows\nEl backend de Wayland se actualiza a la versión actual de Wayland\nLos botones de giro han recibido un nuevo aspecto\nAccesibilidad: el soporte accesible con vista de árbol se reescribe\nMás soporte completo de temas CSS\nGtkSearchEntry\nGtkMenuButton\nGtkLevelBar\nBotones de giro vertical\nAnimaciones CSS, sombras borrosas\nSoporte para desvanecimiento y transiciones en temas.\nSoporte para el servidor broadwayd\nTematización mejorada\nMejor gestión de la geometría.\nMejoras táctiles\nSoporte con el administrador de ventanas para el protocolo de sincronización de trama\nGdkFrameClock agregado[71]​\nGtkHeaderBar\nGtkPlacesSidebar\nGtkStack\nGtkStackSwitcher\nGtkRevealer\nGtkSearchBar\nGtkListBox\nSoporte para Wayland 1.2\nmaximización\ncursores animados\nmonitores múltiples\najustes\nsuperficies personalizadas\nsincronización de trama\nAdicional:\ndecoraciones del lado del cliente\nsoporte de salida a escala en pantallas de alta resolución\nmodo de ajuste fino para desplazamiento\nRetirado:\nsoporte para el protocolo Motif DND\nsoporte para múltiples pantallas por pantalla\ngdk_window_get_display\ngtk_widget_push_composite_child\nElementos de menú desprendibles, además de muchas configuraciones GTK\nTEl moderno modelo de dibujo GTK\nSoporte para Wayland 1.5\nNuevo widget: GtkPopover (una alternativa a los menús y cuadros de diálogo)\nSoporte mejorado para gestos / fusión multitáctil[78]​[79]​\nEn desuso:[80]​\nGtkMisc\nGtkAlignment\nGtkArrow\nGdkColor\nRegiones de estilo\nsoporte para archivos .icon\ngdk_window_flush\ndibujar fuera de la pintura de inicio/fin\nLa mayoría de los widgets se convierten para usar gestos internamente\nWayland admite el modo clásico de GNOME Shell[81]​\nNuevos widgets:\nGtkGLArea\nGtkStackSidebar\nGtkModelButton\nGtkPopoverMenu\nDesplazamiento revisado (barra de desplazamiento oculta por defecto)[83]​\nExperimental Mir backend[84]​\nMás actualización de diseño de filechooser y mejor búsqueda de filechooser\nSoporte de Windows XP eliminado\nModelo de soporte para lista y cuadro de flujo\nDesplazamiento cinético del panel táctil\nGestos del panel táctil (Wayland)\nutilidad gtk-builder-tool\nVentanas solo de salida\nMover arrastrar y soltar hacia GDK\nNuevo widget: GtkShortcutsWindow (muestra métodos abreviados de teclado y gestos de una aplicación)\nWEl soporte para tabletas Wayland se fusionó,[89]​ el soporte para tabletas gráficas se considera completo[90]​\nGTK 3.22 será tan estable (y por lo tanto \"aburrido\") como GTK 2[91]​[92]​[93]​\nVersión estable actual:\n3.24 se lanzó principalmente para facilitar la migración de GTK + 3.x a GTK + 4\nGolpes de dependencia: requieren:\nlibepoxy 1.4\npango 1.41\nNuevas características del selector de fuente:\npermitir configurar características de fuente OpenType\nmostrar ejemplos de características de fuente OpenType\npermitir seleccionar variaciones de fuente OpenType\nNiveles de soporte de detalles para la selección\nNuevas características de Emoji:\nadmite una ventana emergente de finalización para Emoji\nsoltar el atajo Ctrl-Shift-e\nOtras API nuevas: gdk_window_move_to_rect\nWayland: usa memoria anónima compartida en FreeBSD\nControladores de eventos con respaldo de GTK 4:\nGtkEventControllerScroll\nGtkEventControllerMotion\nGtkEventControllerKey\nGtkGestureStylus\nEn desuso algunas API que se han ido en GTK 4:\ncadenas de enfoque en GtkContainer\nsensibilidad paso a paso en GtkRange\nEliminar cualquier API marcada como obsoleta\nantes (22-09-2016) vs. después\nDesarrollo pesado\nromper API y ABI[92]​[93]​\nUn nuevo renderizador de Vulkan aumenta el antiguo renderizador de Cairo[96]​\n3.89.2\n3.89.4\n3.89.5\n3.90\nGNU autotools fue reemplazado por Meson.\n3.91.1\n3.91.2\n3.92.1\nGdkScreen, GdkVisual eliminado\nGdkDeviceManager reemplazado por GdkSeat\nEl manejo del portapapeles se mueve de GTK a GDK\nGdkEvent se convierte en un GObject opaco\nel renderizador GL en GSK se ha completado sustancialmente, y ahora está a la par con el renderizador Vulkan\nse reduce el uso de GdkPixbuf en las API\ny el objeto GskTexture se mueve a GDK como GdkTexture, para tomar su lugar\nEl backend de Wayland ahora implementa el protocolo de decoración del lado del servidor KDE\nBroadway es portado a GSK.\nGdkWindow renombrado a GdkSurface\nNueva abstracción para contenido dibujable: GdkPaintable\nHay soporte para mostrar medios con:\nGtkVideo\nGtkMediaFile\nGtkMediaStream\nGtkMediaControls\nGtkWidget ahora puede usar un GtkLayoutManager para la asignación de tamaño\nlos administradores de diseño pueden usar opcionalmente hijos de diseño con propiedades de diseño\nGtkBinLayout, GtkBoxLayout, GtkGridLayout, GtkFixedLayout y GtkCustomLayout están actualmente disponibles\nAparecerán más implementaciones de administrador de diseño en el futuro\nEl manejo del enfoque se ha reescrito y la generación de eventos de cambio de enfoque se ha unificado con eventos cruzados\nLos eventos se han simplificado y solo se usan para la entrada:\nlos eventos de exposición han sido reemplazados por una señal GdkSurface::render\nlos eventos de configuración han sido reemplazados por una señal GdkSurface::size-changed\nlos eventos del mapa han sido reemplazados por una propiedad GdkSurface::mapped\ngdk_event_handler_set ha sido reemplazado por una señal GdkSurface::event\nlos eventos clave ya no contienen una cadena\nlos eventos en widgets no asignados se ignoran\nMejoras de rendimiento.\nRefactorización de arrastrar y soltar\nMoviendo GDK hacia Wayland\nRemoción\nGtkMenu, GtkToolbar y clases similares han sido reemplazadas por GMenu.\nAdiciones\nSelector de emoji\nLos widgets de texto ahora tienen pilas de deshacer\nUn nuevo gestor de diseño[104]​\nHerramientas de accesibilidad actualizadas\nEncabezados actualizado para utilizar estándar C tipos INSTED de GLib\nNuevos widgets\nCorrecciones y mejoras", "subsections": []}, {"name": "Véase también", "text": "Anjuta\nGlade\nVala", "subsections": []}, {"name": "Referencias", "text": "↑ a b Bassi, Emmanuele (6 de febrero de 2019), «Project rename to \"GTK\"» (en en), lista de correo gtk-devel-list, https://mail.gnome.org/archives/gtk-devel-list/2019-February/msg00000.html, consultado el 18 de junio de 2019. \n↑ Corbet, Jonathan (8 de febrero de 2019). «GTK+ renamed to GTK». Linux Weekly News (en inglés). Consultado el 18 de junio de 2019. \n↑ a b «A Brief (and Ancient) History of GIMP». GNU Image Manipulation Program (en inglés). 1998. Consultado el 18 de junio de 2019. \n↑ a b c Harlow, Eric. ([1999]). Desarrollo de aplicaciones Linux con GTK+ y GDK : guía avanzada. Prentice Hall. ISBN 84-8322-196-9. OCLC 433163271. Consultado el 6 de julio de 2020. \n↑ a b c «What is GTK, and how can I use it?». The GTK Project (en inglés). Consultado el 18 de junio de 2019. \n↑ The GNOME Proyect. «Index of /Public/gimp/gtk/v1.0» (en inglés). Archivado desde el original el 12 de agosto de 2014. Consultado el 4 de julio de 2020. \n↑ The GNOME Proyect. «GNOME Quick SWOT Analysis, april 2010» (en inglés). Consultado el 1 de julio de 2020. \n↑ de Icaza, Miguel (1 de febrero de 1999). «The GNOME Project». Linux Journal (en inglés).  Falta la |url= (ayuda); |fechaacceso= requiere |url= (ayuda)\n↑ The GNOME Proyect. «List Rules and FAQs» (en inglés). Consultado el 1 de julio de 2020. \n↑ The GNOME Proyect. «GUADEC2020» (en inglés). Consultado el 1 de julio de 2020. \n↑ a b Clasen, Mathias (10 de febrero de 2011), «GTK+ 3.0.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2011-February/msg00020.html, consultado el 6 de julio de 2020. \n↑ Kristian Høgsberg (3 de enero de 2011). «Multiple backends for GTK+» (en inglés). Consultado el 4 de julio de 2020. \n↑ alexl (18 de abril de 2011). «Broadway update 3» (en inglés). Consultado el 4 de julio de 2020. \n↑ Thorsten Leemhuis (28 de marzo de 2012). «GTK+ 3.4 mit Multitouch- und Windows-Unterstützung» (en alemán). Consultado el 4 de julio de 2020. \n↑ Thorsten Leemhuis (25 de septiembre de 2012). «Neue Versionen von GTK+, GLib und Clutter» (en alemán). Consultado el 4 de julio de 2020. \n↑ Oliver Diedrich (24 de septiembre de 2013). «Gtk+ 3.10 mit verbesserter Wayland-Unterstützung» (en alemán). Consultado el 4 de julio de 2020. \n↑ Oliver Diedrich (27 de marzo de 2014). «Angesehen: Gnome 3.12» (en alemán). Consultado el 4 de julio de 2020. \n↑ Oliver Diedrich (2 de octubre de 2014). «Immer mehr Spiele für Linux» (en alemán). Consultado el 4 de julio de 2020. \n↑ Keywan Tonekaboni (4 de agosto de 2013). «GUADEC: Wayland-Support für Gnome» (en alemán). Consultado el 4 de julio de 2020. \n↑ The GNOME Project (2015). «Bienvenido a GNOME 3.16» (en inglés). Consultado el 4 de julio de 2020. \n↑ Thorsten Leemhuis (23 de marzo de 2015). «Linux-Desktop: Neues Gnome zeigt Nachrichten oben» (en alemán). Consultado el 4 de julio de 2020. \n↑ Rainald Menge-Sonnentag (22 de marzo de 2016). «GUI-Toolkit GTK+ 3.20 verbessert das CSS-Theming» (en alemán). Consultado el 4 de julio de 2020. \n↑ Rainald Menge-Sonnentag (20 de octubre de 2016). «GUI-Toolkit GTK+ 3.22 bringt Flatpak-Portale» (en alemán). Consultado el 4 de julio de 2020. \n↑ a b Allan (1 de septiembre de 2016). «Versioning and long term stability promise in GTK+». GTK Development Blog (en inglés). Consultado el 1 de julio de 2020. \n↑ a b Clasen, Mathias (3 de septiembre de 2018), «gtk+ 3.24.0», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2018-September/msg00045.html, consultado el 6 de julio de 2020. \n↑ Clasen, Matthias (2018). «GTK+ 4 Status Update» (PDF). Fedora People (en inglés). Consultado el 6 de julio de 2020. \n↑ Alexander. «GTK+ for Windows Runtime Environment» (en inglés). Consultado el 4 de julio de 2020. \n↑ Tarnyko. «GTK+» (en inglés). Consultado el 4 de julio de 2020. \n↑ Tom Schoonjans. «GitHub - tschoonj/GTK-for-Windows-Runtime-Environment-Installer: GTK+ for Windows Runtime Environment Installer (fork from http://gtk-win.sourceforge.net)» (en inglés). Consultado el 4 de julio de 2020. \n↑ Frank (31 de enero de 2018). «Windows Subsystem for Linux: Installation des WSL und Konfiguration von Gnome unter Windows 10» (en alemán). Consultado el 4 de julio de 2020. \n↑ The GNOME Project. «Projects/GTK/OSX - GNOME Wiki!» (en inglés). Consultado el 4 de julio de 2020. \n↑ Bassi, Emmanuele (15 de agosto de 2017), «Build system change GTK's master branch» (en en), lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2017-August/msg00028.html, consultado el 1 de julio de 2020. \n↑ Wilmet, Sébastien (29 de marzo de 2019). «The GLib/GTK+ Development Platform». people.gnome.org (en inglés). Consultado el 1 de julio de 2020. \n↑ WxWidgets Compared To Other Toolkits «GTK+». \n↑ «Language Bindings». Archivado desde el original el 13 de julio de 2011. Consultado el 3 de diciembre de 2014. \n↑ Felipe Borges, Gabe Ron. «Gtk+». Fedora Developer (en inglés). Consultado el 6 de julio de 2020. \n↑ PyGObject Team. «Getting Started - PyGObject». PyGObject (en inglés). Consultado el 10 de julio de 2020. \n↑ Desarrolladores de GNOME (2019). «Please don’t theme our apps». stopthemingmy (en inglés). Consultado el 12 de septiembre de 2020. \n↑ Medina, Eduardo (27 de agosto de 2019). «El tema Yaru de Ubuntu se basará en Adwaita para evitar la fragmentación». MuyLinux. Consultado el 12 de septiembre de 2020. \n↑ Morten Welinder (23 de junio de 2014). «How Does One Create A Gtk+ Application?». blogs.gnome.org (en inglés). Consultado el 1 de julio de 2020. \n↑ MCLASEN (20 de noviembre de 2015). «A GTK+ UPDATE». blogs.gnome.org (en inglés). Consultado el 1 de julio de 2020. \n↑ GUADEC (22 de octubre de 2013). «Index of /2013/GTK to infinity and beyond». http://videos.guadec.org/ (en inglés). Consultado el 1 de julio de 2020. \n↑ Michael Larabel (12 de enero de 2014). «The Biggest Problem With GTK & What Qt Does Good». phoronix (en inglés). Consultado el 1 de julio de 2020. \n↑ BROTHER (22 de julio de 2013). «“The future of Razor and LXDE-Qt”». blog.lxde.org (en inglés). Consultado el 1 de julio de 2020. \n↑ PCMAN (26 de marzo de 2013). «PCManFM Qt 0.1.0 released». blog.lxde.org (en inglés). Consultado el 1 de julio de 2020. \n↑ Audacious Developers (28 de febrero de 2015). «Audacious 3.6 released». https://audacious-media-player.org/ (en inglés). Consultado el 1 de julio de 2020. \n↑ John Lindgren (6 de abril de 2014). «Ugly window decorations and how to fix them (GTK+ 3.12)». redmine.audacious-media-player.org (en inglés). Consultado el 1 de julio de 2020. \n↑ «We’re switching to Qt.». blog.wireshark.org (en inglés). octubre de 2013. Consultado el 1 de julio de 2020. \n↑ Amundson, Shawn T. (13 de abril de 2020), «ANNOUNCE: GTK+ 1.0.0 Released!», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/1998-April/msg00303.html, consultado el 6 de julio de 2020. \n↑ Amundson, Shawn T. (25 de febrero de 1999), «ANNOUNCE: GTK+ and GLib 1.2.0 Released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/1999-February/msg00756.html, consultado el 6 de julio de 2020. \n↑ Taylor, Owen (11 de marzo de 2002), «GTK+-2.0.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/2002-March/msg00136.html, consultado el 6 de julio de 2020. \n↑ Taylor, Owen (22 de diciembre de 2002), «GTK+-2.2.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/2002-December/msg00206.html, consultado el 6 de julio de 2020. \n↑ Taylor, Owen (16 de marzo de 2004), «GTK+-2.4.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/2004-March/msg00111.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (16 de diciembre de 2004), «GTK+-2.6.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/2004-December/msg00155.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (13 de agosto de 2005), «GTK+ 2.8.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/2005-August/msg00124.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (3 de julio de 2006), «GTK+ 2.10 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2006-July/msg00004.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (14 de septiembre de 2007), «GTK+ 2.12 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2007-September/msg00052.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (4 de septiembre de 2008), «GTK+ 2.14.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2008-September/msg00024.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (13 de marzo de 2009), «GTK+ 2.16.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2009-March/msg00101.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (23 de septiembre de 2009), «GTK+ 2.18.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2009-September/msg00054.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (23 de marzo de 2010), «GTK+ 2.20.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2010-March/msg00132.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (23 de septiembre de 2010), «GTK+ 2.22.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2010-September/msg00263.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (20 de enero de 2011), «GTK+ 2.24.0», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2011-January/msg00042.html, consultado el 6 de julio de 2020. \n↑ «Gtk+ 3.0 Theming API Hackfest». Silicon Island. Consultado el 3 de junio de 2017. \n↑ «Gtk+ 3 roadmap draft». Consultado el 3 de junio de 2017. \n↑ «Attic/ProjectRidley - GNOME Wiki!». wiki.gnome.org. \n↑ Clasen, Mathias (25 de septiembre de 2011), «GTK+ 3.2.0», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2011-September/msg00175.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (26 de marzo de 2012), «GTK+ 3.4.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2012-March/msg00082.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (24 de septiembre de 2012), «GTK+ 3.6.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2012-September/msg00045.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (25 de marzo de 2013), «GTK+ 3.8.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2013-March/msg00108.html, consultado el 6 de julio de 2020. \n↑ «Frame clock: GDK 3 Reference Manual». developer.gnome.org. \n↑ Clasen, Mathias (23 de septiembre de 2013), «GTK+ 3.10.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2013-September/msg00057.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (25 de marzo de 2014), «GTK+ 3.12 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2014-March/msg00060.html, consultado el 6 de julio de 2020. \n↑ «Client-side decorations in themes | Goings on». \n↑ Clasen, Mathias (22 de septiembre de 2014), «GTK+ 3.14.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2014-September/msg00007.html, consultado el 6 de julio de 2020. \n↑ Matthias Clasen (15 de mayo de 2014). «GtkInspector Author's blog entry». Consultado el 17 de mayo de 2014. \n↑ «GtkInspector in GNOME wiki». 15 de mayo de 2014. Consultado el 17 de mayo de 2014. \n↑ «Merging gestures into 3.14». 23 de mayo de 2014. Consultado el 23 de mayo de 2014. \n↑ «RFC: gestures». 4 de abril de 2014. Consultado el 23 de mayo de 2014. \n↑ «gtk+ 3.13.2». 27 de mayo de 2014. \n↑ «gtk+ 3.13.3». 24 de junio de 2014. \n↑ Clasen, Mathias (22 de marzo de 2015), «GTK+ 3.16.0 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-devel-list/2015-March/msg00062.html, consultado el 6 de julio de 2020. \n↑ online, heise. «Linux-Desktop: Neues Gnome zeigt Nachrichten oben». heise online. Consultado el 3 de junio de 2017. \n↑ «GTK+ 3.16.0 released». mail.gnome.org. Consultado el 3 de junio de 2017. \n↑ Nestor, Marius (24 de septiembre de 2015). «GTK+ 3.18.0 Officially Released as Part of the GNOME 3.18 Desktop Environment». Softpedia. Consultado el 25 de mayo de 2019. \n↑ Clasen, Mathias (21 de marzo de 2016), «GTK+ 3.20», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/2016-March/msg00026.html, consultado el 6 de julio de 2020. \n↑ «GTK+ 3.20 – Style Classes and Element Names». 20 de noviembre de 2015. \n↑ Clasen, Mathias (21 de septiembre de 2016), «GTK+ 3.22 released», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/gtk-list/2016-September/msg00006.html, consultado el 6 de julio de 2020. \n↑ «GTK+ Wayland tablet support is merged – Carlos Garnacho». \n↑ «hutterer input». www.x.org. \n↑ «GUADEC2013: Benjamin Otte talks about GTK+». GUADEC. \n↑ a b «Gtk 4.0 will not be stable until Gtk 4.6». 13 de junio de 2016. \n↑ a b «Gtk 5.0 will not be stable until Gtk 5.6». 14 de junio de 2016. \n↑ Clasen, Mathias (31 de marzo de 2017), «gtk+ 3.90.0», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2017-March/msg00243.html, consultado el 6 de julio de 2020. \n↑ «Projects/GTK/Roadmap - GNOME Wiki!». wiki.gnome.org. \n↑ «Commits · master · GNOME / gtk». GitLab. Archivado desde el original el 22 de junio de 2020. Consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (18 de octubre de 2017), «gtk+ 3.92.1», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2017-October/msg00117.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (23 de octubre de 2017). «GTK+ 3.92». GTK Development Blog. Consultado el 25 de mayo de 2019. \n↑ «GNOME 3.26 Released». 13 de septiembre de 2017. \n↑ Clasen, Mathias (26 de junio de 2018), «gtk+ 3.94.0», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2018-June/msg00073.html, consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (7 de mayo de 2019), «gtk 3.96», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2019-May/msg00032.html, consultado el 6 de julio de 2020. \n↑ «Introducing amtk». Archivado desde el original el 22 de junio de 2020. Consultado el 6 de julio de 2020. \n↑ Clasen, Mathias (6 de junio de 2020), «gtk 3.98.5», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2020-June/msg00024.html, consultado el 6 de julio de 2020. \n↑ Clasen, Matthias (13 de febrero de 2020). «GTK 3.98». GTK+ Development Blog (en inglés). Consultado el 18 de febrero de 2020. \n↑ Clasen, Mathias (31 de julio de 2020), «gtk 3.99.0», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2020-July/msg00096.html, consultado el 28 de agosto de 2020. \n↑ Clasen, Mathias (16 de diciembre de 2020), «gtk 4.0.0», lista de correo GNOME Mail Services, https://mail.gnome.org/archives/ftp-release-list/2020-December/msg00029.html, consultado el 25 de diciembre de 2020. ", "subsections": []}, {"name": "Enlaces externos", "text": "GTK.org (inglés)\nPango.org (inglés).\nGTK.ALKIA.ORG (inglés).\nRubyGTK, bindings de GTK para Ruby. (inglés).\ngtk-fortran, bindings de GTK para Fortran 2003. (inglés).\nPyGObject, bindings de GTK para Python.\nGTK#, bindings de GTK para Mono.\ngtk2-perl, bindings de GTK para perl.\nPHP-GTK, bindings de GTK para PHP.\nJava-Gnome, bindings de GTK/Gnome para Java.\ngtkmm, bindings de GTK para C++.\nRoadmap (inglés).\nVideo tutorial: Calculadora con GTK (Español", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/GUI", "title": "Interfaz gráfica de usuario", "summary": "La interfaz gráfica de usuario, conocida también como GUI (del inglés graphical user interface), es un programa informático que actúa de interfaz de usuario, utilizando un conjunto de imágenes y objetos gráficos para representar la información y acciones disponibles en la interfaz. Su principal uso consiste en proporcionar un entorno visual sencillo para permitir la comunicación con el sistema operativo de una máquina o computador.\nHabitualmente las acciones se realizan mediante manipulación directa, para facilitar la interacción del usuario con la computadora. Surge como evolución de las interfaces de línea de comandos que se usaban para operar los primeros sistemas operativos y es pieza fundamental en un entorno gráfico. Como ejemplos de interfaz gráfica de usuario, cabe citar los entornos de escritorio Windows, el de GNU/Linux o el de Mac OS X, Aqua.\nEn el contexto del proceso de interacción persona-computadora, la interfaz gráfica de usuario es el artefacto tecnológico de un sistema interactivo que posibilita, a través del uso y la representación del lenguaje visual, una interacción amigable con un sistema informático.", "sections": [{"name": "Diseño de la interfaz de usuario y de interacción", "text": "Diseñar la composición visual y el comportamiento temporal de una GUI es una parte importante de la programación de aplicaciones en el campo de la Interacción persona-ordenador. Su objetivo es mejorar la eficiencia y la facilidad de uso del diseño lógico subyacente de un programa almacenado, una disciplina de diseño llamada usabilidad. Varios métodos de diseño centrado en el usuario se utilizan para garantizar que el lenguaje visual introducido en el diseño se adapta bien a las tareas.\nLas características visibles de la interfaz gráfica de una aplicación a veces se llaman cromo o GUI.[1]​[2]​[3]​ Normalmente, los usuarios interactúan con la información mediante la manipulación visual de widgets que permitan interacciones adecuadas al tipo de datos que tienen. Los widgets de una interfaz bien diseñada se seleccionan para apoyar las acciones necesarias para alcanzar los objetivos de los usuarios. Un Modelo-Vista-Controlador permite estructuras flexibles en las que la interfaz es independiente e indirectamente vinculada a las funciones de la aplicación, de modo que la GUI puede personalizarse fácilmente. Esto permite a los usuarios seleccionar o diseñar otros skins a voluntad y facilita el trabajo del diseñador para cambiar la interfaz a medida que evolucionan las necesidades del usuario. Un buen diseño de la interfaz de usuario se relaciona más con los usuarios y menos con la arquitectura del sistema.\nLos widgets grandes, como las ventanas, normalmente proporcionan un marco o contenedor para el contenido principal de la presentación, como una página web, un mensaje de correo electrónico o un dibujo. Los más pequeños suelen actuar como una herramienta de entrada del usuario.\nSe puede diseñar una GUI para los requisitos de un mercado vertical como interfaces gráficas de usuario específicas de la aplicación. Algunos ejemplos incluyen cajeros automáticos (ATM), pantallas de puntos de venta (POS) en restaurantes,[4]​ sistemas de autopago utilizados en tiendas minoristas, para billetes de avión y facturación automática, quioscos de información en un espacio público, como una estación de tren o un museo, y monitores o pantallas de control en una aplicación industrial incrustada que utilizan un sistema operativo de tiempo real (RTOS).\nLos teléfonos móviles y los sistemas de videojuegos portátiles también utilizan el GUI de pantalla táctil específicas de aplicaciones. Los automóviles más novedosos utilizan el GUI en sus sistemas de navegación y centros multimedia, o combinaciones de centros multimedia de navegación.", "subsections": []}, {"name": "Historia", "text": "", "subsections": [{"name": "Precursores", "text": "Los investigadores del Stanford Research Institute liderados por Douglas Engelbart, desarrollaron una interfaz de hipervínculos en modo texto gobernada por un ratón, que también inventaron. Este concepto fue ampliado y trasladado al entorno gráfico por los investigadores del Xerox PARC en la ciudad estadounidense de Palo Alto. El entorno se denominó PARC User Interface y en él se definieron los conceptos de ventanas, casilla de verificación, botones de radio, menús y puntero del ratón. La interfaz fue implementada comercialmente en el computador Xerox Star 8010."}, {"name": "Xerox Alto", "text": "El Xerox Alto, desarrollado en el Xerox PARC en 1973, fue una de las primeras computadoras personales, así como el primero que utilizó la metáfora de escritorio y una interfaz gráfica de usuario."}, {"name": "Xerox Star 8010", "text": "La estación de trabajo Xerox Star, conocida oficialmente como el 8010 Star Information System (Sistema de Información Estrella 8010) fue introducida por Xerox Corporation en 1981. Fue el primer sistema comercial en incorporar varias tecnologías que han llegado a ser hoy en día corrientes en computadores personales, incluyendo la pantalla con bitmaps en lugar de solo texto, una interfaz gráfica de usuario basada en ventanas, iconos, carpetas, ratón, red Ethernet, servidores de archivos, servidores de impresoras y correo electrónico."}, {"name": "Apple Lisa, Macintosh, Apple II GS.", "text": "Tras una visita al Xerox PARC en 1979, el equipo de Apple encabezado por Jef Raskin se concentra en diseñar un entorno gráfico para su nueva generación de 16 bits, que se verá plasmado en el Apple Lisa en 1983. Ese sistema gráfico es portado al sucesor del Apple II, el Apple II GS. Un segundo equipo trabaja en el Apple Macintosh que verá la luz en 1984 con una versión mejorada del entorno gráfico del Lisa (\"pretendimos hacer una computadora tan simple de manejar como una tostadora\"). Desde ese momento el Mac reinará como paradigma de usabilidad de un entorno gráfico; pese a que por debajo el sistema operativo sufra cambios radicales, los usuarios no avanzados no son conscientes de ello y no sufren los problemas de otras plataformas."}, {"name": "Workbench", "text": "Workbench es el nombre dado por Commodore a la interfaz gráfica del AmigaOS, el sistema operativo del Commodore Amiga lanzado en 1985. A diferencia de los sistemas más populares (GEM, Mac OS, MS Windows...) es un verdadero entorno multitarea solo rivalizado por la interfaz X Window System de los diferentes sabores de Unix. La frase más repetida por un amiguero es: «para masacrar marcianos, formatear un disquete y enviar o recibir un Fax todo a la vez y sin colgarse, necesitas un 386 con disco duro, 16 MB de RAM y OS/2; un Amiga 500 con disquete y solo su memoria base (512 KB de RAM y 512 KB de ROM) es capaz de todo eso». Aunque muy popular por los espectaculares (para entonces) gráficos de la máquina y su gran plantel de videojuegos, será la negligencia de sus sucesivos propietarios la principal causa de que acabe restringido a solamente la plataforma Amiga."}, {"name": "GEOS", "text": "Para el Commodore 64 y su sucesor el Commodore 128 se desarrolló el entorno gráfico GEOS en 1986. Este entorno se portó al IBM PC, fue utilizado en varias PDA y Nokia lo usó como base de su actual sistema operativo."}, {"name": "GEM", "text": "GEM (Graphical Environment Manager) es un GUI diseñado por Digital Research en 1985 para ejecutarse sobre varios sistemas operativos de línea de comandos del IBM PC y compatibles: funciona tanto sobre IBM DOS /MS-DOS como sobre CP/M 86. Su máxima popularidad en el PC llega de la mano del Amstrad PC1512 y del Amstrad PC1640, los clónicos que rompieron en Europa la barrera del precio popularizando el PC, hasta ese momento relegado mayoritariamente a oficinas. Aunque se incorpora en su primera generación de portátiles y en el Sinclair PC200, será sustituido en la siguiente generación de PCs Amstrad por Microsoft Windows 2.xx. En el PC vivirá una segunda juventud al venir de serie con DR-DOS como TaskMax.\nPero será en los Atari ST y sucesores donde se convertirá en el entorno gráfico oficial de la plataforma, alcanzando gran popularidad, tanto por ser en principio una alternativa barata al MAC en autoedición, como por hacerse con el nicho de mercado de la música profesional."}, {"name": "Apple y Microsoft", "text": "En 1982, Apple había comenzado como una microempresa formada por dos empleados, Steve Jobs y Steve Wozniak, y había crecido hasta convertirse en una empresa de 300 millones de dólares. En 1983, ya se había convertido en una empresa de 1000 millones de dólares, el mismo valor que IBM.\nEn 1985, Microsoft saca al mercado Windows 1.0, entorno gráfico para computadoras PC IBM compatibles, con muchos parecidos al Mac OS. La respuesta de Apple a la introducción del sistema operativo Windows fue la interposición de una demanda de varios miles de millones de dólares contra Microsoft, por violación de copyright.\nEn 1987 IBM se vio obligada a entrar en el mercado de las computadoras personales con entorno gráfico con su modelo IBM Personal System/2 (PS/2), aliándose con Bill Gates (Microsoft), que había desarrollado el OS/2. La interfaz gráfica de este sistema operativo era muy similar a la de Apple. El OS/2 no se convirtió en el nuevo estándar del sector, debido fundamentalmente al conflicto de intereses entre IBM y Microsoft.\nLa aparición de computadoras IBM clónicas hizo que el sistema Windows se popularizara, lo que restó mercado a Apple. Esta se recuperó a finales de 1990 lanzando nuevos productos.\nUna señal inequívoca del éxito de Apple fue la aparición de productos similares: una pequeña compañía llamada Nutek Computers Inc., anunció que estaba desarrollando una computadora compatible con el Macintosh.\nEn 1991, John Sculley, director de Apple, reveló que la compañía estaba considerando competir contra Microsoft en el campo del software vendiendo su sistema operativo a terceros. Apple reveló que estaba manteniendo conversaciones con su antiguo rival, IBM, destinadas a compartir tecnologías. Decidieron crear una joint venture para desarrollar un sistema operativo avanzado que ambas utilizarían en sus nuevas máquinas y licenciarían a terceros. Este plan presentaba un desafío directo a Microsoft.\nMicrosoft consigue convertir a Windows en el sistema operativo más utilizado en el mundo, dejando a Apple en un segundo lugar."}]}, {"name": "Tipos de interfaces gráficas de usuario", "text": "", "subsections": [{"name": "Las GUI y ZUI", "text": "Los tipos de interfaces gráficas de usuarios (GUI) que se encuentran en juegos de computadora, y las GUI avanzados basados en realidad virtual, se usan con frecuencia en tareas de investigación. Muchos grupos de investigación en Norteamérica y Europa están trabajando actualmente en la interfaz de enfoque del usuario o ZUI (Zooming User Interface), que es un adelanto lógico de las GUI, mezclando 3D con 2D. Podría expresarse como «2 dimensiones y media en objetos vectoriales de una dimensión»."}, {"name": "Interfaz de usuario de pantalla táctil", "text": "Algunas GUI son diseñadas para cumplir con los rigurosos requisitos de los mercados verticales. Estos se conocen como las GUI de uso específico. Un ejemplo de un GUI de uso específico es la ahora familiar pantalla táctil o touchscreen (pantalla que al ser tocada efectúa los comandos del ratón en el software). Se encuentra actualmente implementado en muchos restaurantes y en muchas tiendas de autoservicio de todo el mundo. Fue iniciado por Gene Mosher en la computadora del ST de Atari en 1986, el uso que él específicó en las GUI de pantalla táctil ha encabezado una revolución mundial e innovadora en el uso de las computadoras a través de las industrias alimenticias y de bebidas, y en ventas al por menor.\nOtros ejemplos de GUI de uso específico, relacionados con la pantalla táctil son los cajeros automáticos, los kioscos de información y las pantallas de monitoreo y control en los usos industriales, que emplean un sistema operativo de tiempo real (RTOS). Los teléfonos móviles y los sistemas o consolas de juego también emplean las pantallas táctiles. Además la domótica no es posible sin una buena interfaz de usuario, o GUI."}, {"name": "Interfaz Natural de Usuario (NUI)", "text": "Las NUI naturales son aquellas en las que se interactúa con un sistema, aplicación, etcétera, sin utilizar dispositivos de entrada como ratón, teclado, lápiz óptico, etc. En lugar de estos se utilizan las manos o las yemas de los dedos."}, {"name": "Interfaz de Voz (VUI)", "text": "Se trata de programas capaces de identificar e interpretar el habla. El ejemplo más claro que tenemos es el reciente auge de las inteligencias artificiales, como Siri, que se controlan por medio de la voz."}, {"name": "Interfaz de texto (TUI)", "text": "Se utiliza principalmente en el ámbito de la programación de sistemas operativos y es la evolución de la interfaz de línea de comando primitiva que usaban los primeros programas de computadora."}, {"name": "Interfaz cerebro-ordenador", "text": "O también llamada tecnología BCI (Brain-Computer Interface). Es el tipo de interfaz más innovadora que existe hasta el momento, y aunque aún no cuenta con muchas aplicaciones cotidianas, se está utilizando para controlar prótesis biónicas y dar instrucciones sencillas a un software por medio de las ondas cerebrales."}]}, {"name": "Idioma", "text": "Es habitual poder cambiar el idioma de la interfaz de usuario.[5]​", "subsections": []}, {"name": "Interfaz gráfica de usuario tridimensional", "text": "Muchos entornos y juegos utilizan los métodos de los gráficos 3D para proyectar objetos en 3D de la interfaz gráfica de usuario en la pantalla. El uso de gráficos 3D se ha vuelto cada vez más común en los principales sistemas operativos (por ejemplo, Windows Aero, y Aqua (MacOS)) para crear interfaces atractivas, denominadas eye candy, o con fines funcionales que sólo son posibles utilizando las tres dimensiones. Por ejemplo, el cambio de usuario se representa girando un cubo con caras que representan el espacio de trabajo de cada usuario, y la gestión de ventanas se representa mediante un mecanismo de volteo al estilo de Rolodex en Windows Vista (véase Windows Flip 3D). En ambos casos, el sistema operativo transforma las ventanas sobre la marcha mientras sigue actualizando el contenido de las mismas.\nLa interfaz de usuario con zoom (Zooming user interface en inglés, ZUI) es una tecnología relacionada que promete ofrecer las ventajas de representación de los entornos 3D sin sus inconvenientes de usabilidad de problemas de orientación y objetos ocultos. En 2006, Hillcrest Labs presentó la primera ZUI para televisión.[6]​ Otras innovaciones incluyen el Proyecto Looking Glass de Sun, Metisse, que era similar al Proyecto Looking Glass,[7]​ BumpTop, en el que los usuarios pueden manipular documentos y ventanas con movimiento realista y física como si fueran documentos físicos, Croquet OS, que está construido para la colaboración, y compositing window managers como Enlightenment y Compiz.  La realidad aumentada y la realidad virtual también hacen uso de elementos de interfaz gráfica de usuario en 3D.[8]​", "subsections": []}, {"name": "Véase también", "text": "AJAX\nArquitectura de la información\nBiblioteca de enlace dinámico\nIngeniería de software\nInterfaz\nInterfaz de usuario\nInteracción persona-computadora\nInterfaz de línea de comandos (CLI)\nLey de Fitts\nLook and feel\nMetáfora de escritorio\nRich Internet Applications, en español: Aplicaciones ricas de internet.\nUsabilidad", "subsections": []}, {"name": "Referencias", "text": "↑ «chrome». www.catb.org. Consultado el 3 de abril de 2020. \n↑ Jakob Nielsen (29 de enero de 2012). «Browser and GUI Chrome». Nngroup. Archivado desde el original el 25 de agosto de 2012. Consultado el 7 de diciembre de 2021. \n↑ Martinez, Wendy L. (23 de febrero de 2011). «Graphical user interfaces: Graphical user interfaces». Wiley Interdisciplinary Reviews: Computational Statistics (en inglés) 3 (2): 119-133. doi:10.1002/wics.150. \n↑ The ViewTouch restaurant system by Giselle Bisson\n↑ http://www.howtogeek.com/howto/17528/change-the-user-interface-language-in-ubuntu/\n↑ Macworld.com 11 de noviembre de 2006. Dan Moren. CES Unveiled@NY '07: ¿Apuntar y hacer clic llega a los decodificadores? Archivado el 8 de noviembre de 2011 en Wayback Machine.\n↑ org/story/04/06/29/229243/metisse---new-looking-glass-alternative «Metisse - New Looking Glass Alternative». 29 de junio de 2004. Consultado el 2 de julio de 2020. \n↑ Purwar, Sourabh (4 de marzo de 2019). «Diseño de la experiencia del usuario para aplicaciones de realidad virtual (VR)». Medium (en inglés). Consultado el 6 de mayo de 2022. ", "subsections": []}, {"name": "Bibliografía", "text": "Royo, Javier. Diseño Digital. Ediciones Paidós Ibérica, 2018.\nShneiderman, Ben. Designing The user interface, Strategies for effective Human-computer interaction. Addison-wesley,1998", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una categoría multimedia sobre Interfaz gráfica de usuario.\nApple v. Microsoft (en la Wikipedia en inglés)\nArs Technica: A History of the GUI por Jeremy Reimer (en inglés).\nInterfaces Gráficas de Usuario (Historia).\nImágenes de casi todos los entornos gráficos de sistemas operativos \ncydiaimpactor.web.ap", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Generador_(inform%C3%A1tica)", "title": "Generador (informática)", "summary": "En programación, un generador es una rutina especial que se puede usar para controlar el comportamiento de un iterador en un bucle.\nUn generador es muy similar a una función que devuelve un vector, en el que un generador tiene los parámetros que se pueden llamar, y genera una secuencia de valores.\nLa manera más simple de conseguir una secuencia de datos es declarando un array o vector declarando manualmente cada valor. Esta práctica puede volverse tediosa y consumir mucho tiempo al desarrollador si el array o vector requiere que existan una gran cantidad de elementos dentro de él. En ese caso un generador resulta ser una manera más rápida de declarar el array o vector.\nOtra gran ventaja de los generadores radica en que consume una menor cantidad de recursos en memoria, por lo tanto, permite que quien lo llama comience a procesar los primeros valores inmediatamente. En resumen, un generador se asemeja a una función pero se comporta como un iterador.\nLos generadores pueden implementarse en construcciones de control de flujo más expresivas, como la continuación de objetos de primera clase o como co-funciones.\nLos generadores aparecen por primera vez en 1975 en el lenguaje CLU; y están disponibles en Python, C#, JavaScript, [Ruby] y en otros lenguajes. En CLU y C#, los generadores se llaman iteradores y en Ruby enumeradores.", "sections": [{"name": "Python", "text": "Un ejemplo de generador en Python:\ndef\ncountfrom\n(\nn\n):\nwhile\nTrue\n:\nyield\n+=\n1\n# Ejemplo: mostrar los enteros entre 10 y 20.\n# Hay que tener en cuenta que esta iteración normalmente termina,\n# aunque el countfrom() se escriba como un bucle infinito.\nfor\ni\nin\ncountfrom\n10\nif\n<=\n20\nprint\n)\nelse\nbreak\n# Otro generador, que produce los primeros números primos\n# a \"to\" si a> = 2, de lo contrario indefinidamente dependiendo de la necesidad.\nprimos\nto\n2\n# primer número primero, y único par\n=\n3\np\n[]\nor\n<\nsqr_n\nint\n**\n0.5\nnot\nany\n%\nf\n==\n0\n# funciona desde Python 2.5  con el paquete NumPy que introduce any()\n.\nappend\n# Sólo revisar impares\nraise\nStopIteration", "subsections": []}, {"name": "Ruby", "text": "Ruby soporta generadores (a partir de la versión 1.9) en la clase Enumerator.\n# Generador de un objeto enumerable\nchars\n \nEnumerator\nnew\n[\n'A'\n,\n'B'\n'C'\n'Z'\n]\n4\ntimes\n{\nputs\nnext\n}\n# Generatore de un bloque\ncount\ndo\n|\nyielder\n  \nloop\nyield\nend\n100", "subsections": []}, {"name": "Véase también", "text": "Iterador\nCorrutinas\n Portal:informática. Contenido relacionado con informática", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Genie_(lenguaje_de_programaci%C3%B3n)", "title": "Genie (lenguaje de programación)", "summary": "Genie es un lenguaje de programación de alto nivel, moderno, y de propósito general en desarrollo activo desde el año 2008.[1]​ Fue diseñado como un dialecto  alternativo más simple y limpio para el compilador Vala, preservando al mismo tiempo la misma funcionalidad del lenguaje Vala. La sintaxis de Genie se deriva de numerosos lenguajes modernos como Python, Boo, D y Delphi.\nAl igual que Vala, Genie usa el sistema de tipos GObject para crear clases e interfaces declaradas en el código fuente de Genie, sin imponer requisitos adicionales de tiempo de ejecución (es decir, a diferencia de Python, Java o Mono, este no requiere una máquina virtual).\nGenie permite el acceso a las bibliotecas de C, especialmente las basadas en GObject (como GTK+), sin necesidad de utilizar otro API. Durante la compilación, el código se traduce primero a código fuente y cabeceras de C, que se compilan entonces al código de máquina con cualquier compilador C disponible como GCC, lo cual permite el desarrollo de software multi-plataforma.\nAunque tanto Vala como Genie son desarrollados y promovidos por el proyecto Gnome, los programas desarrollados en Genie no dependen del entorno de escritorio Gnome, y usualmente requieren solo de GLib.", "sections": [{"name": "Diferencias con Vala", "text": "Genie usa el mismo compilador y bibliotecas que Vala; de hecho, los dos se pueden utilizar juntos.[2]​ Las diferencias son solo sintácticas.", "subsections": []}, {"name": "Sangría", "text": "Como un lenguaje que toma a Python como referencia, Genie utiliza espacios en blanco o tabuladores en lugar de llaves para delimitar bloques.", "subsections": []}, {"name": "Ejemplos de código", "text": "", "subsections": [{"name": "Un simple \"Hola Mundo\"", "text": "En este ejemplo se utiliza de forma explícita cuatro espacios para el sangrado.\n[\nindent\n=\n4\n]\ninit\nprint\n\"Hola, mundo!\"\nOtro ejemplo:\na\n:\nint\n0\nif\n(\n>\n)\n\"a es mayor que 0\"\nelse\n\"a no es mayor que 0\""}, {"name": "Objetos", "text": "Sin ninguna declaración explícita para el sangrado, por defecto se usa la tabulación.\nclass\nEjemplo\ndef\nrun\n()\nstdout\n.\nprintf\n\"Hola, mundo!\n\\n\n\"\nvar\nejemplo\nnew\nEjemplo\nrun"}]}, {"name": "Referencias", "text": "↑ Jamie McCracken (ed.). «Introducing Genie - the smart programming language» (en inglés). Consultado el 13 de junio de 2010. \n↑ Using Genie and Vala together (en inglés).", "subsections": []}, {"name": "Enlaces externos", "text": "Página principal de Genie (en inglés)\nPágina principal de Vala (en inglés)\nPágina de Barry Kauler sobre Genie (en inglés)\nPágina de Nicolas Joseph con muchos ejemplos de código\nDocumentación de la API\nCharla IRC sobre Genie en Gnome hispano, febrero de 2010\nCódigo de Genie para principiantes\nGenie Do", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Gesti%C3%B3n_de_memoria", "title": "Gestión de memoria", "summary": "La gestión de memoria o administración de memoria es el acto de gestionar la memoria de un dispositivo informático. El proceso de asignación de memoria a los programas que la solicitan.[1]​ \nLos sistemas de memoria virtual separan las direcciones de memoria utilizadas por un proceso de las direcciones físicas reales, permitiendo la separación de procesos e incrementando la cantidad efectiva de memoria de acceso aleatorio utilizando la paginación. La calidad de la gestión de la memoria es crucial para las prestaciones del sistema.\nEl recolector de basura es la asignación y liberación automática de los recursos de memoria para un programa. La implementación suele ser a nivel del lenguaje de programación en contraposición a la gestión manual de memoria, que asigna y libera los recursos de memoria de una computadora de forma explícita.\nLa administración de memoria se refiere a los distintos métodos y operaciones que se encargan de obtener la máxima utilidad de la memoria, organizando los procesos y programas que se ejecutan de manera tal que se aproveche de la mejor manera posible el espacio disponible.\nPara poder lograrlo, la operación principal que realiza es trasladar la información que deberá ser ejecutada por la unidad central de procesamiento o procesador, a la memoria principal. Actualmente esta administración se conoce como memoria virtual, porque no es la memoria física del procesador sino una memoria virtual que la representa. Entre algunas ventajas, esta memoria permite que el sistema cuente con una memoria más extensa teniendo la misma memoria real, por lo que esta se puede utilizar de manera más eficiente. Y por supuesto, que los programas que son utilizados no ocupen lugar innecesario.\nLas técnicas que existen para la carga de programas en la memoria son: partición fija, que es la división de la memoria libre en varias partes (de igual o distinto tamaño) y la partición dinámica, que son las particiones de la memoria en tamaños que pueden ser variables, según la cantidad de memoria que necesita cada proceso.\nEntre las principales operaciones que desarrolla la administración de memoria se encuentran la reubicación, que consiste en trasladar procesos activos dentro y fuera de la memoria principal para maximizar la utilización del procesador; la protección, mecanismos que protegen los procesos que se ejecutan de interferencias de otros procesos; uso compartido de códigos y datos, con lo que el mecanismo de protección permite que ciertos procesos de un mismo programa que comparten una tarea tengan memoria en común.", "sections": [{"name": "Requisitos", "text": "Los sistemas de gestión de memoria de sistemas operativos multitarea normalmente tratan con las siguientes tareas.", "subsections": [{"name": "Reasignación", "text": "En los sistemas con memoria virtual, los programas durante su ejecución pueden salir por un tiempo de la memoria y luego regresar, de modo que no pueden colocarse en el lugar que ocupaban previamente. Por ello debe ser posible que residan en diferentes partes de la memoria en diferentes momentos. Así, la gestión de memoria en el sistema operativo debe ser capaz de trasladar los programas en memoria y manejar referencias a la memoria y las direcciones en el código del programa para que siempre apunten a la ubicación correcta. La unidad de gestión de memoria virtual también debe hacer frente a la concurrencia."}, {"name": "Protección", "text": "Artículo principal:\nLos procesos no deberían poder referenciar la memoria de otros procesos sin permiso, para evitarlo existe la protección de memoria, que evita que código malicioso o erróneo de un programa interfiera con la operación de otros programas en ejecución."}, {"name": "Memoria compartida", "text": "Aunque la memoria utilizada por diferentes procesos suele estar protegida, algunos procesos puede que sí tengan que compartir información y, para ello, han de acceder la misma sección de memoria. La memoria compartida es una de las técnicas más rápidas para posibilitar la comunicación entre procesos."}, {"name": "Organización lógica", "text": "Los programas a menudo están organizados en módulos, algunos de los cuales pueden ser compartidos por diferentes programas, algunos son de solo-lectura y otros contienen datos que se pueden modificar. Se escriben y se compilan independientemente. La gestión de memoria es responsable de manejar esta organización lógica, que se contrapone al espacio de direcciones físicas lineales. Una forma de lograrlo es mediante la segmentación de memoria."}, {"name": "Organización física", "text": "La memoria suele dividirse en un almacenamiento primario de alta velocidad y uno secundario de menor velocidad. La gestión de memoria del sistema operativo se ocupa de trasladar la información entre estos dos niveles de memoria."}]}, {"name": "Gestión de memoria en DOS", "text": "Véase también:\nAdemás de la gestión estándar de memoria, la barrera de los 640 KB de MS-DOS y los sistemas compatibles dieron lugar al desarrollo de programas conocidos como gestores de memoria cuando las memorias principales de las PC comenzaron a ser mayores que 640 KB a finales de los años 1980. Estos desplazan porciones del sistema operativo fuera de su localización tradicional para incrementar la cantidad de memoria convencional o semiconvencional disponible para otras aplicaciones. El EMM386, es un ejemplo, fue parte de la instalación estándar de las últimas versiones de DOS, así como el QEMM. Estos permitieron el uso de memoria más allá de la barrera de los 640 KB, donde la memoria solía estar reservada a la memoria de acceso aleatorio, y memorias superiores.", "subsections": []}, {"name": "Notas y referencias", "text": "↑ La Asignación de memoria es llamada por algunos \"alocar\" (del inglés allocate que significa \"asignar\"), pero la palabra  tiene otro significado para el Diccionario de la lengua española de la Real Academia Española.", "subsections": []}, {"name": "Bibliografía", "text": "Ciriaco García de Celis (1994). «Capítulo VIII: La gestión de memoria del DOS». El universo digital del IBM PC, AT y PS/2 (4ª edición). Facultad de Ciencias de Valladolid: Grupo Universitario de Informática. \nWilson, P.R.; Johnstone, M.S.; Neely, M.; Boles, D. (1995). «Dynamic Storage Allocation: A Survey and Critical Review». Memory Management: International Workshop, Iwmm'95, Kinross, Uk, September 27–29, 1995: Proceedings (en inglés) (Springer). ISBN 978-3-540-60368-9. Consultado el 6 de enero de 2008. \nBerger, E.D.; Zorn, B.G.; McKinley, K.S. (2001). «Composing high-performance memory allocators». ACM SIGPLAN Notices (en inglés) 36 (5): 114-124. doi:10.1145/381694. \nBerger, E.D.; Zorn, B.G.; McKinley, K.S. (2002). «Reconsidering custom memory allocation». Proceedings of the 17th ACM SIGPLAN conference on Object-oriented programming, systems, languages, and applications (en inglés). ACM Press New York, NY, USA. pp. 1-12.  La referencia utiliza el parámetro obsoleto |coauthors= (ayuda)", "subsections": []}, {"name": "Véase también", "text": "Asignación de memoria\nConmutación de bancos de memoria\nMemoria virtual\nPaginación de memoria\nPuntero\nRecolector de basura\nTabla de paginación\nUnidad de gestión de memoria", "subsections": []}, {"name": "Enlaces externos", "text": "www.memorymanagement.org The Memory Management Reference.\nlinux-mm.org Linux Memory Management.\nwww.enderunix.org/docs/memory.pdf Archivado el 10 de mayo de 2012 en Wayback Machine. Memory Management For System Programmers", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Go_(lenguaje_de_programaci%C3%B3n)", "title": "Go (lenguaje de programación)", "summary": "[\n]\nGo es un lenguaje de programación concurrente y compilado con tipado estático inspirado en la sintaxis de C, pero con seguridad de memoria y recolección de basura. Ha sido desarrollado por Google[9]​ y sus diseñadores iniciales fueron Robert Griesemer, Rob Pike y Ken Thompson.[10]​ Actualmente está disponible en formato binario para los sistemas operativos Windows, GNU/Linux, FreeBSD  y Mac OS X, pudiendo también ser instalado en estos y en otros sistemas mediante el código fuente.[11]​[12]​ Go es un lenguaje de programación compilado, concurrente, imperativo, estructurado y orientado a objetos que de momento está disponible para diferentes tipos de sistemas Unix-like, incluidos Linux, FreeBSD, Mac OS X y Plan 9 (puesto que parte del compilador está basado en un trabajo previo sobre el sistema operativo Inferno). Las arquitecturas soportadas son i386, amd64 y ARM.", "sections": [{"name": "Nombrado", "text": "El día de la publicación del lenguaje Go, Francis McCabe, desarrollador del lenguaje de programación Go! (anteriormente llamado Go), solicitó que se le cambiase el nombre al lenguaje de Google para evitar confusiones con su lenguaje.[13]​ McCabe creó Go! en el año 2003; sin embargo, aún no ha registrado el nombre.[14]​ Go es un nuevo lenguaje de programación para sistemas lanzado por Google en noviembre de 2009. Aunque empezó a ser desarrollado en septiembre de 2007 por Robert Griesemer, Rob Pike y Ken Thompson.", "subsections": []}, {"name": "Características", "text": "Go es un proyecto de código abierto.[15]​\nGo usa una sintaxis similar a C.[16]​\nGo usa tipado estático.\nGo es un lenguaje compilado, al igual que C y C++.\nProvee un recolector de basura, reflexión y algunas otras capacidades de lenguajes de alto nivel.\nLos binarios de Go tienen la característica de compilación cruzada de manera nativa.\nGo admite el paradigma de programación orientada a objetos, pero a diferencia de otros lenguajes de programación no dispone de herencia de tipos y tampoco de palabras clave que denoten claramente que soporta este paradigma.\nEn Go, la definición de un tipo (\"clase\") se realiza por medio de declaraciones separadas (interfaces, types, structs, embedded values).\nGo permite el uso de delegación (a través de embedded values) y polimorfismo (por medio de interfaces).\nGo utiliza la concurrencia a través de las gorutinas.\nGo esta orientado a aprovechar sistemas con múltiples procesadores y procesamiento en red.[17]​\nGo admite la tipificación dinámica de datos también conocida como Duck typing.[18]​[19]​\nUn struct puede implementar una interfaz de forma automática.[20]​", "subsections": []}, {"name": "Excepciones", "text": "Go no utiliza excepciones.[21]​ Los creadores del lenguaje han dado varios motivos para que esto sea así. La principal es que añadir una capa de excepciones agrega una complejidad innecesaria al lenguaje y al entorno de ejecución. Por definición las excepciones deberían ser excepcionales, pero al final se acaban usando como controladores del flujo de la aplicación y dejan de tener la finalidad de excepcionalidad. Según los creadores, las excepciones tienen que ser realmente excepcionales y el uso que se le da mayoritariamente no justifica su existencia.\nAdemás, resulta en flujos con saltos no obvios. Por ejemplo, una excepción no controlada en una función, que se esperaba no pudiese lanzarla, lleva la ejecución hasta el primer catch que se encuentre. Eso puede dificultar la depuración.\nOtros lenguajes modernos como Rust también han prescindido de las excepciones por las mismas razones.", "subsections": []}, {"name": "Diferencias principales con C", "text": "Aunque su sintaxis es similar, Go difiere mucho de C. Véanse algunos ejemplos.", "subsections": [{"name": "Declaraciones al revés", "text": "En Go las declaraciones se realizan al revés desde la perspectiva de C (o C++ o Java). La idea principal en C es que se declara una variable como una expresión que denota su tipo. Según los creadores, aunque la idea detrás de la declaración de tipos en C es buena, los tipos y las expresiones gramaticales no se mezclan demasiado bien y el resultado puede ser confuso. Go sin embargo, separa la expresión y la sintaxis de tipo, lo cual simplifica las cosas."}, {"name": "Paréntesis", "text": "En C es necesario utilizar paréntesis al evaluar expresiones dentro de estructuras de control (por ejemplo, en estructuras if-then-else y for-next). En Go es considerado poco \"idiomático\" utilizar paréntesis en estructuras de control."}, {"name": "Punto y coma", "text": "En Go el uso del carácter punto y coma “;“ al final de una instrucción es opcional."}, {"name": "Aritmética de punteros", "text": "Go no tiene aritmética de punteros. Según los creadores, la razón es la seguridad. Sin aritmética de punteros es posible crear un lenguaje en el que no se puede obtener una dirección ilegal que sea usada de forma incorrecta. La falta de aritmética de punteros simplifica la implementación del recolector de basura. Además, optimizando el compilador y con el hardware actual, un bucle que utiliza los índices de un array puede ser tan eficaz como un bucle que utiliza aritmética de punteros."}, {"name": "++ y --", "text": "En Go, el uso de ++ y -- para incrementar y decrementar el valor de una variable es una sentencia y no una expresión. Además, solo puede utilizarse en su versión sufija pues según los autores, la versión prefija pierde todo su sentido en la ausencia de aritmética de punteros."}]}, {"name": "Programación orientada a objetos", "text": "Para algunos autores, la herencia o las clases no son conceptos esenciales para el paradigma de POO, sino más bien un medio de implementación. Existen desde hace tiempo lenguajes orientados a objetos que no admiten clases, sino que se basan en prototipos, como Javascript o Self. Según declaraciones de Alan Kay, creador de Smalltalk, lo esencial del paradigma es el paso de mensajes.[22]​\nGo tiene tipos y métodos, y permite un estilo de programación orientado a objetos que reemplaza el uso de clases por estructuras las cuales admiten construir jerarquías, es decir, no soporta el uso herencia y favorece en su lugar el patrón de composición. En Go, el concepto de “interfaz“ es similar al usado en Java: cualquier objeto (value) que cumpla el contrato especificado por una interfaz (sin necesidad de una declaración explícita) obtiene ese tipo. También existen formas de embeber estructuras dentro de otras estructuras para obtener algo análogo a las subclases. Los métodos de Go son más generales que los de C++ o Java, y se incluyen en las estructuras declarando funciones asociadas a estas. Pueden ser definidos para cualquier tipo de datos; no solo para los registros. Por su parte las interfaces de Go a diferencia de lenguajes como Java, son de tipo implícito, es decir que se considera que la interfaz ha sido implementada cuando una estructura implementa sus métodos aun cuando esto no se especifique.", "subsections": []}, {"name": "Aplicaciones", "text": "Algunas aplicaciones notables de código abierto escritas en Go son:[23]​\nCaddy, un servidor web HTTP/2 de código abierto con capacidad HTTPS automática\nCockroachDB, una base de datos SQL de código abierto, con capacidad de supervivencia, fuertemente consistente y escalable\nConsul, un software para el descubrimiento de servicios basado en DNS y que proporciona almacenamiento distribuido de valores clave, segmentación y configuración.\nDocker, un conjunto de herramientas para desplegar contenedores Linux\nEdgeX, una plataforma de código abierto independiente de los proveedores, alojada por la Fundación Linux, que proporciona un marco común para la informática de borde del IoT industrial[24]​.\nHugo, un generador de sitios estáticos\nGrafana, aplicación web de visualización y formato de datos métricos\nInfluxDB, una base de datos de código abierto específica para manejar datos de series temporales con requisitos de alta disponibilidad y alto rendimiento\nInterPlanetary File System, un protocolo hipermedia peer-to-peer con direcciones de contenido[25]​.\nJuju, una herramienta de orquestación de servicios de Canonical, empaquetadores de Ubuntu Linux\nSistema de gestión de contenedores Kubernetes\nGolang Pagoda framework[26]​\nlnd, una implementación de la red Bitcoin Lightning[27]​\nMattermost, un sistema de chat en equipo\nNATS Messaging, un sistema de mensajería de código abierto que se basa en los principios de rendimiento, escalabilidad y facilidad de uso.\nOpenShift, una plataforma de computación en la nube como servicio de Red Hat\nRclone, un programa de línea de comandos para gestionar archivos en el almacenamiento en la nube y otros servicios de alta latencia\nSnappy, un gestor de paquetes para Ubuntu Touch desarrollado por Canonical\nSyncthing, una aplicación cliente/servidor de sincronización de archivos de código abierto\nTerraform, una herramienta de aprovisionamiento de infraestructura de nube múltiple de código abierto de HashiCorp\nTiDB, una base de datos distribuida HTAP de código abierto compatible con el protocolo MySQL de PingCAP\nVitess, una base de datos de código abierto, distribuida y compatible con MySQL, de YouTube, que ahora está alojada en la Cloud Native Computing Foundation[28]​[29]​.\narctil, herramienta de evaluación de la seguridad web[30]​", "subsections": []}, {"name": "Ejemplos", "text": "El clásico programa Hola mundo en Go es similar a como se haría en C++. Con este típico ejemplo podemos apreciar que en cuanto a sintaxis son muy similares:\npackage\n \nmain\nimport\n\"fmt\"\nfunc\n()\n{\n    \nfmt\n.\nPrintln\n(\n\"Hola, mundo.\"\n)\n}\nLa notación de los comentarios es exactamente la misma que la de C++\n/* ...\n   ...\n   ... */\n// ...\nUn programa para una aplicación web.\n\"log\"\n\"net/http\"\nholaFunc\nw\nhttp\nResponseWriter\n,\nr\n*\nRequest\nFprintln\n\"Hola mundo!\"\nHandleFunc\n\"/\"\nlog\nFatal\nListenAndServe\n\":8080\"\nnil\n))", "subsections": []}, {"name": "Referencias", "text": "↑ «First-Class Functions in Go». Consultado el 14 de noviembre de 2018. «Go supports ... a functional programming style in a strongly typed language.» \n↑ «Is Go an object-oriented language?». Consultado el 13 de abril de 2019. «Although Go has types and methods and allows an object-oriented style of programming, there is no type hierarchy.» \n↑ «Go: code that grows with grace». Consultado el 24 de junio de 2018. «Go is Object Oriented, but not in the usual way.» \n↑ https://go.dev/doc/devel/release\n↑ «lang/go: go-1.4 – Go programming language». OpenBSD ports. 23 de diciembre de 2014. Consultado el 19 de enero de 2015. \n↑ «Go Porting Efforts». Go Language Resources. cat-v. 12 de enero de 2010. Consultado el 18 de enero de 2010. \n↑ «Text file LICENSE». The Go Programming Language. Consultado el 5 de octubre de 2012. \n↑ «Additional IP Rights Grant». The Go Programming Language. Consultado el 5 de octubre de 2012. \n↑ Kincaid, Jason (10 de noviembre de 2009). «Google's Go: A New Programming Language That's Python Meets C++». TechCrunch. Consultado el 18 de enero de 2010. \n↑ «Language Design FAQ». golang.org. 16 de enero de 2010. Consultado el 27 de febrero de 2010. \n↑ Guía de instalación (inglés)\n↑ Guía de instalación (español)\n↑ Francis McCabe (10 de noviembre de 2009). «I have already used the name for *MY* programming language» (en inglés). Consultado el 13 de noviembre de 2009. \n↑ Thomas Claburn (11 de noviembre de 2009).  InformationWeek, ed. «Google 'Go' Name Brings Accusations Of 'Evil'» (en inglés). Archivado desde el original el 22 de julio de 2010. Consultado el 13 de noviembre de 2009. \n↑ «The Go Programming Language». golang.org. Consultado el 4 de diciembre de 2020. \n↑ Metz, Cade (5 de mayo de 2011). «Google Go boldly goes where no code has gone before». The Register. \n↑ «Documentation - The Go Programming Language». golang.org. Consultado el 4 de diciembre de 2020. \n↑ Ryer, Mat (3 de junio de 2016). «Duck typing in Go». Medium (en inglés). Consultado el 4 de diciembre de 2020. \n↑ «Is Go Duck-Typed?». Bionic | FullStory. 4 de marzo de 2020. Consultado el 4 de diciembre de 2020. \n↑  Go by Example: Structs \n↑ «Error handling and Go - The Go Blog». blog.golang.org. Consultado el 4 de diciembre de 2020. \n↑ Alan Kay (10 de octubre de 1998). «prototypes vs classes was: Re: Sun's HotSpot». Lista de distribución de Squeak (en inglés). squeakfoundation.org. Consultado el 21 de noviembre de 2015. \n↑ avelino/awesome-go: A curated list of awesome Go frameworks, libraries and software, consultado el 10 de enero de 2018 .\n↑ «EdgeX Foundry Project». GitHub (en inglés). Consultado el 6 de febrero de 2021. \n↑ «ipfs/go-ipfs». GitHub (en inglés). Consultado el 1 de junio de 2018. \n↑ «Golang Pagoda framework». Qualified.One. 29 de noviembre de 2022. \n↑ «lightningnetwork/lnd», GitHub, consultado el 29 de abril de 2020 .\n↑ «CNCF to host Vitess». Cloud Native Computing Foundation. 5 de febrero de 2018. \n↑ «Cloud Native Computing Foundation Announces Vitess Graduation». Cloud Native Computing Foundation. 5 de noviembre de 2019. \n↑ «arctil». arctil.com. ", "subsections": []}, {"name": "Enlaces externos", "text": "Sitio web oficial (en inglés)\nGo en Español.\nExamples of the most important features of this languages. (en inglés", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Gr%C3%A1ficas_tortuga", "title": "Gráficas tortuga", "summary": "Gráfica tortuga es un término usado en computación gráfica como método para programar gráficos vectoriales usando un cursor (la «tortuga») relativo a unas coordenadas cartesianas. Las gráficas tortuga son un elemento clave en el Lenguaje de programación Logo.", "sections": [{"name": "Resumen", "text": "La tortuga tiene tres atributos:\nUna posición\nUna orientación\nUna pluma, teniendo atributos como color, ancho y un indicador de pluma  arriba y abajo.\nLa tortuga se mueve con comandos relativos a su posición, como «avanza 10 » y «gira a la izquierda 90 ». Los valores «10» o «90» representan magnitudes diferentes, las cuales se verifican en la práctica. En general las diferentes versiones de LOGO no acompañan el número con la magnitud, como pixeles, espacios o grados sexagesimales. La pluma que lleva la tortuga también se puede controlar, estableciéndola, dándole color o un ancho. Un estudiante puede entender (y predecir y razonar) el movimiento de la tortuga imaginándose qué haría él mismo si fuera una tortuga. Seymour Papert llama a esto razonamiento de sincronicidad corporal.\nDesde estos bloques de construcción uno puede construir formas más complejas como cuadrados, triángulos, círculos y otras figuras compositivas. Combinadas con control de flujo, procedimientos y recursión. La idea de las gráficas tortuga también es útil en los sistema-L para generar fractales.\nLa geometría tortuga también se usa a veces en entornos gráficos como alternativa a los sistemas de dirección de coordenadas estrictos.", "subsections": []}, {"name": "Historia", "text": "Las gráficas tortuga fueron añadidas al lenguaje de programación Logo por Seymour Papert a finales de la década de 1960 para apoyar la versión de Papert del robot tortuga, un simple robot controlado desde el puesto de trabajo del usuario diseñado para llevar a cabo funciones de dibujo asignadas mediante una pequeña pluma retráctil en su interior o adjuntada al cuerpo del robot. La geometría tortuga trabaja diferente de la que geometría cartesiana (direcciones x,y), estando basada en vectores (dirección relativa a una distancia desde el punto inicial) en vez de sistemas de dirección de coordenadas como el PostScript. De forma práctica, el uso de geometría tortuga en lugar de otros modelos tradicionales mimetiza el movimiento lógico real del robot tortuga. La tortuga suele ser representada como un triángulo o como un icono de una tortuga (aunque pueda representarse con cualquier icono).\nLa hija de Papert, Artemis, ha usado gráficas tortuga para explorar la relación entre arte y algoritmos.\nLos gráficos tortuga son soportados por la mayoría de plataformas. KTurtle es una aplicación de programación disponible en la mayoría de distribuciones Linux que no usa el lenguaje Logo, y Vectoria es una app disponible para iPhone.[1]​", "subsections": []}, {"name": "Extensión a las tres dimensiones", "text": "Las ideas tras los gráficos tortuga se pueden extender hasta incluir el espacio tridimensional. Esto se consigue usando uno o varios modelos de coordenadas diferentes. Si la tortuga opera en coordenadas cilíndricas, tiene entonces una localización y un grado en su plano, y su plano puede ser rotado sobre el eje vertical. Esto se suele representar con la tortuga teniendo dos ángulos rotacionales diferentes, uno para el plano y otro que determina el ángulo del plano. Normalmente cambiar el ángulo del plano no mueve a la tortuga.\nTambién se usan otros modelos de coordenadas.", "subsections": []}, {"name": "Gráfica tortuga programada en Python", "text": "Con el módulo Turtle del lenguaje Python se pueden dibujar figuras intrincadas utilizando programas que repiten movimientos simples.[2]​\nfrom\nturtle\nimport\n*\ncolor\n(\n'red'\n,\n'yellow'\n)\nbegin_fill\n()\nwhile\nTrue\n:\nforward\n200\nleft\n170\nif\nabs\npos\n())\n<\n1\nbreak\nend_fill\ndone", "subsections": []}, {"name": "Véase también", "text": "Tortuga (robot)\nLenguaje de programación Logo\nMSWLogo\nPython Módulo Turtle\nPythonTurtle - Standalone application\nKTurtle\nCheloniidae Turtle Graphics\nStarLogo\nLos ordenadores de One Laptop per Child contienen una actividad Turtle Art para jugar con las gráficas tortuga\nSistema-L", "subsections": []}, {"name": "Referencias", "text": "↑ Vectoria Company Website\n↑ «Gráficos con Turtle». https://docs.python.org/. Consultado el 25 de abril de 2021. ", "subsections": []}, {"name": "Bibliografía", "text": "Abelson and diSessa. Turtle geometry: the computer as a medium for exploring mathematics. Cambridge, MA: MIT Press, 1981.", "subsections": []}, {"name": "Enlaces externos", "text": "\"Web Turtle\", gráficas tortuga en una página web, por Bill Kendrick, autor de Tux Paint\nArte creado con gráficas tortuga por Artemis Papert\n\"3D Flying Pipe-laying Turtle\" por Tom Verhoeff de The Wolfram Demonstrations Project (retrieved on 2009-01-31)\n\"Gráficas tortuga\", escritas en MGrammar, por Jason Hogg\nTurtle Art website mantenido por Brian Silverman y Artemis Papert\nTurtle Art activity incluido en Sugar plataforma de aprendizaje\nJS Turtle Graphics una implementación simple de Javascript de gráficas tortuga, por John Villar\nJSTurtlegraphics V0.2 a simple browser-based implementation aimed at children (using the more common command names)\nTurtleWax gráficas tortuga en JavaScript, por Dave Balmer\nParaiso del Logo el paraíso del logo\nVersiones versiones de logo para descarga", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Groovy_(lenguaje_de_programaci%C3%B3n)", "title": "Groovy (lenguaje de programación)", "summary": "Groovy es un lenguaje de programación orientado a objetos implementado sobre la plataforma Java. Tiene características similares a Python, Ruby, Perl y Smalltalk. La especificación JSR 241 se encarga de su estandarización para una futura inclusión como componente oficial de la plataforma Java. \nGroovy usa una sintaxis muy parecida a Java, comparte el mismo modelo de objetos, de hilos y de seguridad. Desde Groovy se puede acceder directamente a todas las API existentes en Java. El bytecode generado en el proceso de compilación es totalmente compatible con el generado por el lenguaje Java para la Java Virtual Machine (JVM), por tanto puede usarse directamente en cualquier aplicación Java. Todo lo anterior unido a que la mayor parte de código escrito en Java es totalmente válido en Groovy hacen que este lenguaje sea de muy fácil adopción para programadores Java; la curva de aprendizaje se reduce mucho en comparación con otros lenguajes que generan bytecode para la JVM, tales como Jython  o JRuby. Groovy puede usarse también de manera dinámica como un lenguaje de scripting. \nGroovy 1.0 apareció el 2 de enero de 2007. Después de varias versiones beta y otras tantas candidatas a release, el 7 de diciembre de 2007 apareció la versión Groovy 1.1 que finalmente fue renombrada a Groovy 1.5 con el fin de notar la gran cantidad de cambios que ha sufrido con respecto a la versión 1.0. En diciembre de 2009 se publicó la versión 1.7.", "sections": [{"name": "Referencias", "text": "Koenig, Dierk; Andrew Glover; Paul King; Guillaume Laforge; Jon Skeet (2006). Groovy in Action. Manning. ISBN 1-932394-84-2. \nKenneth, Barclay; John Savage. Groovy Programming: An Introduction for Java Developers. ISBN 978-0-12-372507-3. Archivado desde el original el 12 de enero de 2010. Consultado el 16 de diciembre de 2007. \nBosanac, Dejan. Scripting in Java: Languages, Frameworks, and Patterns. ISBN 0-321-32193-6. Archivado desde el original el 14 de noviembre de 2011. Consultado el 18 de noviembre de 2018. ", "subsections": []}, {"name": "Enlaces externos", "text": "Sitio oficial\nTutorial de introducción a Groovy\nJSR 241\nGroovy and Apache Derby database - tutorial\nOpen Directory: Java: Extensions: Groov", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Guido_van_Rossum", "title": "Guido van Rossum", "summary": " \n \n \n \n \nPythonABC \nGuido van Rossum (Haarlem, Países Bajos, 31 de enero de 1956) es un informático,[1]​ conocido por ser el autor del lenguaje de programación Python. Nació y creció en los Países Bajos.\nEs la primera persona en obtener el título BDFL (Benevolent Dictator for Life), cuyo título es otorgado a personajes importantes en el mundo del código abierto, teniendo asignada la tarea de fijar las directrices sobre la evolución de Python, así como la de tomar decisiones finales sobre el lenguaje que todos los desarrolladores acatan. Van Rossum tiene fama de ser bastante conservador, realizando pocos cambios al lenguaje entre versiones sucesivas, intentando mantener siempre la compatibilidad con versiones anteriores. El 12 de julio de 2018, con un mensaje enviado a la lista de python-committers, anunció su retiro de los procesos de decisión.[2]​\nEn el año 2001 recibió el FSF Award for the Advancement of Free Software como reconocimiento por su trabajo.[3]​ En diciembre de 2005 fue contratado como desarrollador por la empresa estadounidense Google. Después de siete años en Google, a principios de diciembre de 2012, anuncia su retirada de la empresa norteamericana para incorporarse en enero de 2013 a la plantilla de la compañía Dropbox.[4]​ Desde noviembre del 2020 es parte de la División de Desarrolladores de la empresa Microsoft.", "sections": [{"name": "Biografía", "text": "Van Rossum nació y creció en los Países Bajos, donde obtuvo su titulación universitaria en matemáticas y computación por la Universidad de Ámsterdam en 1982. A lo largo de su vida ha trabajado tanto en la industria, ya mencionado en la introducción, como en diversos centros de investigación como el instituto holandés Centrum Wiskunde & Informática (CWI), el estadounidense Instituto Nacional de Estándares y Tecnología o la Corporación para las Iniciativas Investigadoras Nacionales en Reston, Virginia.", "subsections": []}, {"name": "Trabajo", "text": "Aunque durante su estancia en el CWI contribuyó a desarrollar rutinas para BSD Unix y también trabajó en el desarrollo del lenguaje de programación ABC, su trabajo más destacado es el lenguaje de programación Python.", "subsections": [{"name": "Python", "text": "Van Rossum escribió en 1996:\n«Hace seis años, en diciembre de 1989, estaba buscando un proyecto de programación como hobby que me mantuviera ocupado durante las semanas de Navidad. Mi oficina estaría cerrada y no tendría más que mi ordenador de casa a mano. Decidí escribir un intérprete para el nuevo lenguaje de scripting que había estado ideando recientemente: un descendiente de ABC que gustaría a los hackers de Unix/c. Elegí el nombre de Python para el proyecto, encontrándome en un estado de ánimo ligeramente irreverente (y siendo un gran fan de Monty Python's Flying Circus)».[5]​\nEn el año 2000 agregó:\n«El predecesor de Python, ABC, estaba inspirado en SETL - Lambert Meertens se pasó un año trabajando en el grupo de SETL en la Universidad de Nueva York antes de que surgiera el diseño final de ABC».[6]​"}, {"name": "Programación para todos", "text": "En el año 1999 Van Rossum realizó una propuesta a DARPA llamada Computer Programming for Everybody, en la que describió qué y cómo debería ser Python:\nPython debería ser fácil, intuitivo y tan potente como sus principales competidores.\nEl proyecto sería de código abierto para que cualquiera pudiera colaborar.\nEl código escrito en Python sería tan comprensible como cualquier texto en inglés.\nPython debería ser apto para las actividades diarias permitiendo la construcción de prototipos en poco tiempo.\nPython es al día de hoy uno de los lenguajes de programación más populares. En 2011 se proclamó el tercer lenguaje más popular de la forja GitHub y según la encuesta[7]​ se encuentra entre los 10 lenguajes de programación más demandados en las ofertas de trabajo."}, {"name": "Mondrian (software de Google)", "text": "Durante su estancia en Google, Van Rossum desarrolló Mondrian, un sistema de revisión de código que sería internamente utilizado en la compañía. Se trata de una aplicación web cuyo código está mayormente escrito en Python. El nombre del software es en honor a Piet Mondrian, un pintor holandés."}, {"name": "Dropbox", "text": "El 7 de diciembre de 2012 Van Rossum empezó a trabajar en Dropbox[8]​\nDespués de seis años y medio, se hace pública (29/10/2019) su partida de Dropbox para jubilarse."}, {"name": "Microsoft", "text": "Casi un año después de estar retirado, Guido decide volver el 12/11/2020 para trabajar en la división de Desarrollo de la compañía Microsoft."}, {"name": "Premios y reconocimientos", "text": "En 2001 Van Rossum recibió el FSF Award for the Advancement of Free Software por parte de la Free Software Foundation (FSF). El premio le fue entregado en 2002 en la conferencia FOSDEM llevada a cabo en Bruselas, Bélgica.\nEn mayo de 2003 le fue otorgado el premio NLUUG.\nLa Association for Computing Machinery reconoció en 2006 a Van Rossum como un Ingeniero Sobresaliente."}]}, {"name": "Véase también", "text": "Python", "subsections": []}, {"name": "Notas y referencias", "text": "↑ https://www.python.org/~guido/Resume.html\n↑ van Rossum, Guido (12 de julio de 2018). «python-committers Transfer of power». python-committers (en inglés). Consultado el 13 de julio de 2018. \n↑ 2001 Free Software Awards Consultado 14 de agosto de 2010.\n↑ 2012 El creador de Python, Guido Van Rossum, deja Google y ficha por Dropbox.\n↑ Foreword for \"Programming Python\" (1st ed.)\n↑ [Python-Dev] SETL (was: Lukewarm about range literals)\n↑ Programming Language Popularity\n↑ «Dropbox Tech Blog » Blog Archive » Welcome Guido!». Tech.dropbox.com. 7 de diciembre de 2012. Consultado el 6 de septiembre de 2013. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una categoría multimedia sobre Guido van Rossum.\nGuido van Rossum", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Haskell", "title": "Haskell", "summary": "Haskell (pronunciado /hæskəl/)[1]​ es un lenguaje de programación estandarizado multi-propósito, funcionalmente puro, con evaluación no estricta y memorizada, y fuerte tipificación estática. Su nombre se debe al lógico estadounidense Haskell Curry, debido a su aporte al cálculo lambda, el cual tiene gran influencia en el lenguaje. En Haskell, \"una función es un ciudadano de primera clase\" del lenguaje de programación. Como lenguaje de programación funcional, el constructor de controles primario es la función. El lenguaje tiene sus orígenes en las observaciones de Haskell Curry y sus descendientes intelectuales.\nEn los años 1980 se constituyó un comité cuyo objetivo era crear un lenguaje funcional que reuniera las características de los múltiples lenguajes funcionales de la época, el más notable Miranda, y resolviera la confusión creada por la proliferación de los mismos.\nEl lenguaje evoluciona rápidamente y (ver más abajo) como los representantes actuales del estándar de facto. El último estándar oficial es: Haskell 2010, cuyas diferencias respecto al anterior estándar Haskell 98 son:\nNuevas características del lenguaje:\nInterfaz de funciones foráneas (FFI), que permite usar código C en un programa Haskell y código Haskell en un programa C. Un ejemplo explicativo se puede encontrar aquí\nNombres jerárquicos para los módulos, por ejemplo Data.Bool.\nGuardianes con patrones.\nCaracterísticas eliminadas del lenguaje:\nSintaxis de patrones (n+k). Con lo cual, la siguiente definición de la función factorial no es válida en Haskell 2010 y posteriores: fact (n+1) = (n+1) * fact n.\nLas características más interesantes de Haskell incluyen el soporte para tipos de datos y funciones recursivas, listas, tuplas, guardas y encaje de patrones. La combinación de las mismas pueden resultar en algunas funciones casi triviales cuya versión en lenguajes imperativos pueden llegar a resultar extremadamente tediosas de programar. Haskell es, desde 2002, uno de los lenguajes funcionales sobre los que más se ha investigado. Se han desarrollado muchas variantes:\nVersiones paralelas del MIT y Glasgow, ambas denominadas Parallel Haskell.\nMás versiones paralelas y distribuidas de Haskell llamadas Distributed Haskell (anteriormente Goffin) y Eden.\nUna versión con ejecución especulativa: Eager Haskell.\nVarias versiones orientadas a objetos: Haskell++, O'Haskell y Mondrian.\nUna versión educativa llamada Gofer desarrollada por Mark Jones que fue suplantada por Hugs (ver abajo).\nPara información más detallada, referirse al sitio oficial o a los enlaces al final de este artículo.", "sections": [{"name": "Historia", "text": "A partir de la publicación de Miranda, en 1985, los lenguajes funcionales proliferaron. En 1987, existían compitiendo entre ellos más de una docena de lenguajes de programación puros funcionales no estrictos. Durante la conferencia sobre Lenguajes de Programación Funcional y Arquitecturas de Ordenador (FPCA '87) en Portland, Oregón, se mantuvo un encuentro durante el cual se alcanzó un fuerte consenso entre sus participantes para formar un comité que definiese un estándar abierto para tales lenguajes. Esto se hizo con el propósito expreso de consolidar los lenguajes existentes en uno único que sirviera como base para la investigación futura en diseño de lenguajes.[2]​ La primera versión de Haskell (\"Haskell 1.0\") se definió en 1990.[3]​ Los esfuerzos del comité resultaron en una serie de definiciones del lenguaje, que culminaron a finales de 1997 en Haskell 98, que se intentó fuera una versión del lenguaje mínima, estable y portable, junto con una biblioteca estándar asociada para la enseñanza, y como base de futuras extensiones. El comité expresamente aprobó la creación de extensiones y variantes de Haskell 98 mediante la adición e incorporación de características experimentales.\nEn enero de 1999, el estándar del lenguaje Haskell 98 se publicó en \"The Haskell 98 Report\". En enero de 2003, se publicó una versión revisada en \"Haskell 98 Language and Libraries: The Revised Report\".[4]​ El lenguaje continúa evolucionando rápidamente, con las implementaciones de Hugs y de GHC (véase más adelante), que representan el actual estándar de facto. A principios del 2006 comenzó el proceso de definición de un sucesor del estándar de Haskell 98, llamado informalmente Haskell′ (\"Haskell Prime\").[5]​ Este proceso intenta producir una revisión menor de Haskell 98.[6]​ En 2010 se lanza Haskell 2010.", "subsections": []}, {"name": "Tipos simples predefinidos", "text": "En Haskell, y en lo siguiente, \"o :: t\" quiere decir que la expresión \"o\" es tiene tipo \"t\", y \"t -> s\" es un tipo, específicamente una función, que consume algo de tipo \"t\" y produce algo de tipo \"s\". El operador (->) asocia a la derecha, ya que \"t -> s -> r\" quiere decir \"t -> (s -> r)\".", "subsections": [{"name": "El tipo Bool", "text": "Los valores con este tipo representan expresiones lógicas cuyo resultado puede ser True o False.\nFunciones y operadores\n(&&) :: Bool -> Bool -> Bool. Conjunción lógica.\n(||) :: Bool -> Bool -> Bool. Disyunción lógica.\nnot :: Bool -> Bool. Negación lógica.\notherwise :: Bool. Función constante que devuelve el valor True."}, {"name": "El tipo Int", "text": "Los valores de este tipo son números enteros de precisión limitada que cubren al menos el intervalo [-2^29, 2^29 - 1] ([minBound, maxBound])."}, {"name": "El tipo Integer", "text": "Los valores de este tipo son números enteros de precisión ilimitada que tienen las mismas funciones y operadores del tipo Int."}, {"name": "El tipo Float", "text": "Los valores de este tipo son números reales. ( 2010, 23.4, 5.7 )\nFunciones y operadores\n(+), (-), (*), (/), (^) :: Float -> Float -> Float. Suma, resta, producto, división real y potencia de exponente entero.\nabs, signum, negate :: Int -> Int. Valor absoluto, signo y negación.\n(**) :: Float -> Float. Potencia de exponente real"}, {"name": "El tipo Double", "text": "Los valores de este tipo son números reales, de mayor rango y con aproximaciones más precisas que los de tipo Float."}, {"name": "El tipo Char", "text": "Los valores de este tipo son caracteres que se encuentran en una masa de alta complejidad de en una suma de caracteres dados con su alta definición.\nAntes de utilizar esta función en hugs debemos utilizar IMPORT CHAR antes de nuestro algoritmo."}, {"name": "Tuplas", "text": "Los elementos que forman una tupla pueden ser del mismo o de distintos tipos. Es un conjunto de componentes relacionados.\nPor ejemplo: ('a', True,3)"}, {"name": "Listas", "text": "Los valores de este tipo son una colección de elementos del mismo tipo. Existen dos constructores para listas:\n[Elementos_separados_por_comas], por ejemplo: [1,2,3,4]\n(primer_elemento:resto_de_la_lista), por ejemplo: (1:(2:(3:(4:[]))))"}]}, {"name": "Implementaciones", "text": "Todas las siguientes implementaciones cumplen en su totalidad, o casi en su totalidad, con los estándares de Haskell 98 y son distribuidas bajo licencias Open Source. No se conocen implementaciones comerciales del lenguaje.\nHugs ([1]) es un intérprete. Ofrece una compilación rápida de los programas y un tiempo razonable de ejecución. También viene con una biblioteca gráfica muy simple, lo que lo hace adecuado para quienes lo están aprendiendo. Sin embargo no es una implementación a despreciar, es una de las más livianas y compatibles.\nGHC ([2]): \"Glasgow Haskell Compiler\" compila a código nativo en una variedad de arquitecturas y puede también compilar a C. Es, probablemente, uno de los compiladores más populares e incluso tiene unas cuantas bibliotecas (por ejemplo OpenGL) que, aunque muy útiles, sólo funcionan bajo GHC.\nnhc98 ([3]) es otro compilador con un mejor tiempo de ejecución que Hugs. Esta implementación se enfocó a minimizar la utilización de la memoria convirtiéndola en una buena opción para arquitecturas lentas o antiguas.\nHBC ([4]) es otro compilador a código nativo de Haskell. Si bien no ha sido actualizado en el último tiempo sigue siendo bastante útil.\nHelium ([5]) es un nuevo dialecto de Haskell. Se centró en ser muy fácil de aprender; por ello, no incluye soporte para todo el estándar de Haskell, haciendo que no sea totalmente compatible.", "subsections": []}, {"name": "Entornos de desarrollo", "text": "Existen varios IDEs (Integrated Development Environment, o en español, entornos de desarrollo integrado) y/o plugins que se pueden utilizar para desarrollar aplicaciones en Haskell. La mayoría son open source, pero también existen con licencia comercial.", "subsections": [{"name": "Open Source", "text": "IntelliJ plugin for Haskell\nEclipseFP plugin for Eclipse IDE\nColorer plugin for Eclipse IDE\nLeksah\nKDevelop\nVim\nEmacs\nAtom"}, {"name": "Comerciales", "text": "Haskell for Mac\nSublime-Haskell"}]}, {"name": "Web Frameworks", "text": "La comunidad de desarrollo web en Haskell ha tenido recientemente un gran impulso en la actividad, lo que resulta en una gran cantidad de opciones de bibliotecas para utilizar.[7]​ A continuación se presenta la lista de framework activos en Haskell para desarrollo web. ", "subsections": [{"name": "Happstack", "text": "Está diseñado para que los desarrolladores puedan prototipar rápidamente, implementar sin dolor, escalar masivamente, operar confiablemente y cambiar fácilmente. Soporta entornos GNU/Linux, macOS, FreeBSD y Windows.\nSe considera un framework web completo, el principal componente es happstack-server: un servidor HTTP integrado, combinadores de enrutamiento y fileserving. Además, una serie de paquetes que solían ser acoplados a Happstack ahora han sido desacoplados de él, pero siguen promocionados y documentados para su uso con Happstack:\nSafecopy: soporte de serialización y migración de tipos de datos\nAcid-state: un sistema de almacenamiento NoSQL ACID con soporte nativo para tipos Haskell"}, {"name": "Snap", "text": "Es un framework de desarrollo web basado en una arquitectura snaplet.\nTiene una completa documentación y cuenta con una suite de pruebas con un alto nivel de cobertura de código, pero es un software de etapa inicial con interfaces en constante evolución"}, {"name": "Yesod", "text": "Está diseñado para aplicaciones web RESTful, de tipo seguro y con alto rendimiento.\nAprovechando la cuasi-cotización para las tareas más fáciles, se provee aplicaciones web concisas con altos niveles de seguridad. Las plantillas de Hamlet se comprueban en tiempo de compilación para ver si son correctas y el controlador utiliza URL seguras para asegurarse de que sólo está generando URL válidas. Sigue los principios del Modelo-Vista-Controlador de forma holgada."}, {"name": "Miku", "text": "Una biblioteca sencilla para el rápido prototipado web en Haskell, inspirada en Ruby's Rack y Sinatra."}, {"name": "Lemmachine", "text": "Es un RESTful web framework. La arquitectura principal es una copia de Webmachine basada en Erlang, que es actualmente la mejor referencia de documentación. Se destaca por su dinámico Webmachine escrito de forma tipada dependiente en Agda."}, {"name": "Mohws", "text": "Es un servidor web con un sistema de módulos y soporte para CGI. Basado en el Servidor Web Haskell original de Simon Marlow."}, {"name": "Salvia", "text": "Es un servidor web y un framework de aplicaciones web que puede ser utilizado para escribir sitios web dinámicos en Haskell. Desde el código de protocolo de nivel inferior hasta el código de aplicación de alto nivel, todo está escrito como un controlador de Salvia. Este enfoque hace que el servidor sea extremadamente extensible."}, {"name": "Scotty", "text": "Es un framework web inspirado en Sinatra de Ruby, usando WAI y Warp. Es una manera sencilla de escribir aplicaciones web RESTful y declarativas. Tiene buena documentación para todas las funciones relevantes."}, {"name": "Servant", "text": "Es un framework ligero principalmente para APIs REST. Permite especificar las especificaciones de una API como alias de tipo y luego trabajar con estos alias de tipo para crear servidores, documentación, código de cliente en Haskell y Javascript. Está basado en WAI."}, {"name": "MFlow", "text": "Es un servidor de aplicaciones web. MFlow es una abreviatura de \"Flujo de mensajes\". Se trata de un framework basado en la continuación, en lugar de otros frameworks basados en la continuación como Ocsigen (Ocaml), Coccoon (javascript) o Seaside (Smalltalk), se basa en una mónada de retroceso que mantiene la sincronización del estado de ejecución con la navegación del usuario. Desde la discontinuación de WASH, MFlow es el único marco de estilo de continuación escrito en Haskell hasta la fecha.\nUtiliza las bibliotecas web Haskell estándares y/o técnicas: WAI, Warp, Blaze HTML, HSP. Su núcleo es el servidor y la renderización independiente. Una clase de formlets extendidos se utilizan para crear componentes autónomos, llamados widgets. Tienen formato, AJAX y código de servidor. Se pueden componer para crear la interfaz de usuario."}, {"name": "Spock", "text": "Es un framework orientado al rápido desarrollo web: Ofrece todo lo necesario para iniciar rápidamente el hacking web con Haskell: enrutamiento, middleware, JSON, blaze, sesiones, cookies, ayudante de base de datos, protección csrf, estado global."}, {"name": "Wheb", "text": "Es un framework WAI para crear aplicaciones web robustas, de alta concurrencia, simples y efectivas. Su objetivo principal es ampliar la funcionalidad de la base de la biblioteca WAI y proporcionar un punto de entrada fácil en los servidores web de Haskell. Facilita la creación de plugins. Los plugins pueden agregar rutas, middleware, configuraciones e incluso manejar la limpieza de recursos en el apagado del servidor. Las rutas denominadas permiten a los plugins generar dinámicamente sus rutas en tiempo de ejecución basadas en la configuración"}, {"name": "WebAPI", "text": "WebApi es una biblioteca ligera basada en WAI que permite definir peticiones y respuestas para los puntos finales como tipos a través de un contrato. El contrato se considera la única fuente de verdad, con lo que WebApi permite crear servicios Web / API REST, generar un cliente Haskell para los servicios existentes de la API, generar un servidor simulador para simular las solicitudes y respuestas."}, {"name": "DAML", "text": "Es un framework de contrato inteligente basado en el Glasgow Haskell Compiler."}]}, {"name": "Comunidad", "text": "", "subsections": [{"name": "The Haskell Symposium", "text": "\"The Haskell Symposium\" es un simposio anual organizado por la International Conference on Functional Programming (ICFP). El simposio está patrocinado por la Association for Computing Machinery (ACM), bajo los auspicios del ACM Special Interest Group on programming languages (SIGPLAN).\nEl propósito del evento es discutir la experiencia de los programadores con Haskell, y el futuro desarrollo del lenguaje. El alcance del simposio incluye todos los aspectos del diseño, la semántica, la teoría, la aplicación, la ejecución, y la enseñanza de Haskell.\nAntes de 2008, el evento era conocido como \"The Haskell Workshop\". El cambio de nombre refleja el aumento constante de la influencia del evento en la comunidad en general, así como un creciente número de presentaciones de alta calidad que hacen el proceso de aceptación muy competitivo."}, {"name": "The Summer of Haskell", "text": "\"The Summer of Haskell\" es un evento organizado por haskell.org para llegar a los estudiantes y animarles a contribuir a la comunidad Haskell con la ayuda de mentores experimentados. Este programa está abierto a estudiantes universitarios, mayores de 18 años, en la mayoría de los países."}]}, {"name": "Ejemplos", "text": "Función recursiva para calcular el factorial de un número natural:\n   \n--Función recursiva que calcula el factorial de un número natural\nfactorial\n \n::\nInteger\n->\nn\n      \n|\n<\n0\n  \n=\nerror\n\"no existe el factorial para enteros negativos\"\n==\n1\notherwise\n*\n(\n-\n)\nOtra versión de la función para calcular el factorial de un natural usando la función product del módulo Data.List:\n--Función para calcular el factorial de un entero usando la función product del módulo Data.List\nproduct\n[\n..\n]\nFunción sumatorio de los elementos de una lista de enteros\n--Sumar elementos de una lista\nsumar\nInt\n[]\nx\n:\nxs\n+\nFunción para calcular las raíces de una ecuación de segundo grado a partir de sus coeficientes\n--Función para calcular las raíces de una ecuación de segundo grado a partir de sus coeficientes\nraíces\nFloat\n,\na\nb\nc\n    \ndisc\n>=\n((\nraizDisc\n/\ndenom\n                   \n\"La ecuación tiene raíces complejas\"\nwhere\n         \n4\nsqrt\n2\nFunción que aproxima el número e\n--Función para calcular el valor de e (2.71828182845905)\neuler\nDouble\n0.0\n1.0\nFunción para calcular el máximo común divisor de dos números enteros mediante el algoritmo de Euclides\nmcd\ny\nmod\nFunción que realiza la criba de Eratóstenes (de una lista dada deja solo los números primos)\neratostenes\nnot\nnull\n&&\n^\n>\nlast\n                      \n<-\n`\n/=\nFunción que determina si un número natural es palíndromo (en base 10)\nisPalindrome\nBool\nFalse\nlet\ns\nshow\nin\nreverse\nFunción que realiza la potencia de un número con recursividad dividiendo el expediente entre 2\npotencia\ne\nif\nthen\npotencia\n))\nelse\np\ndiv\nFunción que evalúa de manera perezosa la lista de números primos utilizando una cláusula where y listas intencionales\nnumerosPrimos\n3\n],\nes_primo\n        \neven\nm\n5\nImplementación del algoritmo Quicksort\nqsort\nOrd\n=>\nqsort\n<=\n++", "subsections": []}, {"name": "Véase también", "text": "Example of most Haskell features\nQuickCheck", "subsections": []}, {"name": "Notas y referencias", "text": "↑ Chevalier, Tim (28 de enero de 2008), «anybody can tell me the pronuncation of \"haskell\"?», lista de correo Haskell-cafe, http://www.haskell.org/pipermail/haskell-cafe/2008-January/038756.html, consultado el 12 de marzo de 2011. \n↑ «Preface». Haskell 98 Language and Libraries: The Revised Report. diciembre de 2002. \n↑ «The History of Haskell». Archivado desde el original el 29 de abril de 2009. \n↑ Simon Peyton Jones (diciembre de 2002). «Haskell 98 Language and Libraries: The Revised Report». \n↑ «Future development of Haskell». \n↑ «Welcome to Haskell'». The Haskell' Wiki. Archivado desde el original el 23 de abril de 2009. Consultado el 5 de mayo de 2007. \n↑ «Web - HaskellWiki». wiki.haskell.org (en inglés). Consultado el 26 de junio de 2017. ", "subsections": []}, {"name": "Bibliografía", "text": "Ruiz, Blas; Gutiérrez, Francisco; Guerrero, Pablo; y Gallardo, José. Razonando con Haskell. Un curso sobre programación funcional. Thomson.", "subsections": []}, {"name": "Enlaces externos", "text": "Español:\nExample of most Haskell features\nIntroducción a Haskell Archivado el 5 de abril de 2010 en Wayback Machine.\nLenguaje de Programación Funcional Haskell Haskell Básico\nUna Introducción Agradable a Haskell Versión en español del libro \"A Gentle Introduction to Haskell\".\n¡Aprende Haskell por el bien de todos! Traducción de la obra \"Learn you a Haskell for great good\".\nHaskell Básico Curso de Haskell\nInglés:\nExample of most Haskell features\nHaskell Página oficial de Haskell\nHaskell in examples Examples of how to use Haskell\nTry Haskell Prueba Haskell en línea\nA Gentle Introduction to Haskell 98 (pdf format) Una simple introducción a Haskell 98\nThe Evolution of a Haskell Programmer Una forma cómica de ver los distintos estilos de programación en Haskell\nOnline Bibliography of Haskell Research Bibliografía de investigaciones en Haskell\nLearn You a Haskell for Great Good\nImplementaciones:\nHugs Haskell User's Gofer System\nGHC The Glasgow Haskell Compiler\nHelium, Heliu", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Herencia_(inform%C3%A1tica)", "title": "Herencia (informática)", "summary": "Busca fuentes: «Herencia (informática)» – noticias · libros · académico · imágenes\nEn programación orientada a objetos, la herencia es, después de la agregación o composición, el mecanismo más utilizado para alcanzar algunos de los objetivos más preciados en el desarrollo de software como lo son la reutilización y la extensibilidad. A través de ella, los diseñadores pueden crear nuevas clases partiendo de una clase o de una jerarquía de clases preexistente (ya comprobadas y verificadas) evitando con ello el rediseño, la modificación y verificación de la parte ya implementada. La herencia facilita la creación de objetos a partir de otros ya existentes e implica que una subclase obtiene todo el comportamiento (métodos) y finalmente los atributos (variables) de su superclase.\nEs la relación entre una clase general y otra clase más específica.\nPor ejemplo: Si declaramos una clase párrafo derivada de una clase texto, todos los métodos y variables asociadas con la clase texto, son automáticamente heredados por la subclase párrafo.\nLa herencia es uno de los mecanismos de los lenguajes de programación orientada a objetos basados en clases, por medio del cual una clase se deriva de otra de manera que extiende su funcionalidad. La clase de la que se hereda se suele denominar clase base, clase padre, superclase, clase ancestro (el vocabulario que se utiliza suele depender en gran medida del lenguaje de programación).\nEn los lenguajes que cuentan con un sistema de tipos fuerte y estrictamente restrictivo con el tipo de datos de las variables, la herencia suele ser un requisito fundamental para poder emplear el Polimorfismo, al igual que un mecanismo que permita decidir en tiempo de ejecución qué método debe invocarse en respuesta a la recepción de un mensaje, conocido como enlace tardío o enlace dinámico.", "sections": [{"name": "Ejemplo en Java", "text": "import\n \njavax.*\n;\njavax.swing.JOptionPane\npublic\nclass\nMamifero\n{\n    \nprivate\nint\npatas\nString\nnombre\nvoid\nimprimirPatas\n(){\n      \nJOptionPane\n.\nshowMessageDialog\n(\nnull\n,\n\" Tiene \"\n+\n\" patas\\n\"\n\"Mamifero\"\nINFORMATION_MESSAGE\n);\n}\nMamifero\n){\nthis\nnombre\n=\npatas\n  \nPerro\nextends\nMamifero\nPerro\nsuper\n4\nGato\nGato\nCrearPerro\nstatic\nmain\n[]\nargs\n)\nPerro\nperrito\nnew\n\"Pantaleon\"\nimprimirPatas\n();\n   \n/*Está en la clase mamífero*/\nSe declaran las clases mamíferos, gato y perro, haciendo que gato y perro sean unos mamíferos (derivados de esta clase), y se ve cómo a través de ellos se nombra al animal pero así también se accede a patas dándole el valor por defecto para esa especie.\nEs importante destacar tres cosas. La primera, es que la herencia no es un mecanismo esencial en el paradigma de programación orientada a objetos; en la mayoría de los lenguajes orientados a objetos basados en prototipos las clases no existen, en consecuencia tampoco existe la herencia y el polimorfismo se logra por otros medios. La segunda, es que el medio preferido para lograr los objetivos de extensibilidad y reutilización es la agregación o composición. La tercera, es que en lenguajes con un sistema de tipos débiles, el polimorfismo se puede lograr sin utilizar la herencia.\nPor otra parte y aunque la herencia no es un concepto indispensable en el paradigma de programación orientada a objetos, es mucho más que un mecanismo de los lenguajes basados en clases, porque implica una forma de razonar sobre cómo diseñar ciertas partes de un programa. Es decir, no solo es un mecanismo que permite implementar un diseño, sino que establece un marco conceptual que permite razonar sobre cómo crear ese diseño.", "subsections": []}, {"name": "Clase Abstracta", "text": "La herencia permite que existan clases que nunca serán instanciadas directamente. En el ejemplo anterior, una clase \"perro\" heredaría los atributos y métodos de la clase \"mamífero\", así como también \"gato\", \"delfín\" o cualquier otra subclase; pero, en ejecución, no habrá ningún objeto \"mamífero\" que no pertenezca a alguna de las subclases. En ese caso, a una clase así se la conocería como Clase Abstracta. La ausencia de instancias específicas es su única particularidad, para todo lo demás es como cualquier otra clase.", "subsections": []}, {"name": "Herencia y ocultación de información", "text": "En ciertos lenguajes, el diseñador puede definir qué variables de instancia y métodos de los objetos de una clase son visibles. En C++ y java esto se consigue con las especificaciones private, protected y public. Solo las variables y métodos definidos como públicos en un objeto serán visibles por todos los objetos. En otros lenguajes como Smalltalk, todas las variables de instancia son privadas y todos los métodos son públicos.\nDependiendo del lenguaje que se utilice, el diseñador también puede controlar qué miembros de las superclases son visibles en las subclases. En el caso de java y C++ los especificadores de acceso (private, protected, public) de los miembros de la superclase afectan también a la herencia:", "subsections": []}, {"name": "Redefinición de métodos", "text": "En la clase derivada se puede redefinir algún método existente en la clase base, con el objeto de proveer una implementación diferente. Para redefinir un método en la subclase, basta con declararlo nuevamente con la misma signatura (nombre y parámetros).\nSi se invoca un cierto método de un objeto que no está definido en su propia clase, se dispara la búsqueda hacia arriba en la jerarquía a la que dicha clase pertenece. Sin embargo, si existieran dos métodos con la misma signatura, uno en la clase y otro en una superclase, se ejecutaría el de la clase, no el de la superclase.\nCuando se redefine un método en una clase es posible acceder explícitamente al método original de su superclase, mediante una sintaxis específica que depende del lenguaje de programación empleado (en muchos lenguajes se trata de la palabra clave super).", "subsections": []}, {"name": "Ventajas", "text": "Ayuda a los programadores a ahorrar código y tiempo, ya que la clase padre ha sido implementada y verificada con anterioridad, restando solo referenciar desde la clase derivada a la clase base (que suele ser extends, inherits, subclass u otras palabras clave similares, dependiendo del lenguaje).\nLos objetos pueden ser construidos a partir de otros similares. Para ello es necesario que exista una clase base (que incluso puede formar parte de una jerarquía de clases más amplia).\nLa clase derivada hereda el comportamiento y los atributos de la clase base, y es común que se le añada su propio comportamiento o que modifique lo heredado.\nToda clase pueden servir como clase base para crear otras.", "subsections": []}, {"name": "Desventajas", "text": "Si la jerarquía de clases es demasiado compleja, el programador puede tener problemas para comprender el funcionamiento de un programa. Además puede volverse más complejo detectar y resolver errores de programación, por ejemplo al modificar una clase padre que afecta el funcionamiento de las subclases.\nOtro problema es que las subclases se deben definir en código, por lo que los usuarios del programa no puede definir subclases nuevas. Otros patrones de diseño permiten que los usuarios puedan definir variantes de una entidad en tiempo de ejecución.\n==Estereotipos de herencia=", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Herencia_m%C3%BAltiple", "title": "Herencia múltiple", "summary": "Herencia múltiple hace referencia a la característica de los lenguajes de programación orientada a objetos en la que una clase puede heredar comportamientos y características de más de una superclase. Esto contrasta con la herencia simple, donde una clase solo puede heredar de una superclase.\nAlgunos lenguajes que soportan herencia múltiple en su mayor parte son: C++, Centura SQL Windows, CLOS, Eiffel, Object REXX, Perl y Python.\nLa herencia múltiple permite a una clase tomar funcionalidades de otras clases, como permitir a una clase llamada MusicoEstudiante heredar de una clase llamada Persona, una clase llamada Músico, y una clase llamada Trabajador. Esto puede ser abreviado como MusicoEstudiante : Persona, Músico, Trabajador.", "sections": [{"name": "Ambigüedades", "text": "En la herencia múltiple aparecen ambigüedades, como en el ejemplo de encima: si la clase Músico heredaba de Persona y Trabajador, y la clase Trabajador heredaba de Persona. Existirían las siguientes reglas::\nMusicoEstudiante : Persona, Músico, Trabajador\nMúsico : Persona, Trabajador\nTrabajador: Persona\nSi un compilador está mirando la clase MusicoEstudiante necesita saber si debe juntar las características iguales o si deben estar separadas. Por ejemplo, tendría sentido unir las características \"Edad\" de Persona para MusicoEstudiante. La edad de una persona no cambia si le consideras una Persona, un Trabajador o un Músico. Sin embargo, tendría sentido separar la característica \"Nombre\" de Persona y Músico si los músicos usan un nombre artístico diferente de su nombre real. Las opciones de juntar y separar son válidas según el contexto, y solo el programador sabe qué opción es correcta para la clase que está diseñando.\nCada lenguaje de programación trata estos problemas de herencia repetida de diferente forma:\nC++ requiere que el programador establezca de qué clase padre vendrá la característica a usar. Por ejemplo con \"Trabajador::Persona.Edad\". C++ no soporta herencia repetida explícita porque no habría forma de indicar qué superclase usar.\nCLOS permite al programador control total del método de combinación, y si no es suficiente, el protocolo de metaobjetos ofrece al programador formas de modificar la herencia, envío de métodos, instanciación de clases, y otros mecanismos internos sin afectar a la estabilidad del sistema.\nEiffel permite al programador explicitar si junta o separa características que son heredadas de superclases. Eiffel juntará características automáticamente si tienen el mismo nombre e implementación. El programador tiene la opción de renombrar las características para separarlas. Eiffel también permite explicitar herencia repetida como A: B, B.\nLogtalk soporta tanto interfaces como multi-herencia de implementación, permitiendo declarar alias de métodos que ofrecen renombrar y acceder a métodos que quedarían ocultados por el mecanismo de resolución de conflictos convencional.\nPerl usa la lista de clases para heredar de una lista ordenada. El compilador usa el primer método que encuentra mediante búsqueda en profundidad por la lista de superclases.\nJava, Nemerle, Delphi, C# y Objective-C no permiten herencia múltiple; esto hace que no haya ambigüedad. Sin embargo, permiten a las clases implementar múltiples interfaces.", "subsections": []}, {"name": "Debate", "text": "Hay debate sobre si la herencia múltiple puede ser implementada de forma simple y sin ambigüedad. Con frecuencia es criticada por su aumentada complejidad y su ambigüedad, así como los problemas de versiones y mantenimiento que puede causar (a menudo resumido como el problema del diamante).[1]​\nLos detractores también señalan que hay problemas de implementación de la herencia múltiple como no ser capaces de explicitar herencia de múltiple clases y el orden de las semánticas de clase que cambian con la herencia. Hay lenguajes que solucionan todos los problemas técnicos de la herencia múltiple, pero el debate principal sigue sobre si implementar y usar herencia múltiple es más fácil que usar herencia simple y patrones de diseño de software.", "subsections": []}, {"name": "Véase también", "text": "Mixin", "subsections": []}, {"name": "Referencias", "text": "↑ (en inglés) Traits: Composable Units of Behavior", "subsections": []}, {"name": "Enlaces externos", "text": "Tutorial sobre el uso de herencia en Eiffel (en inglés", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Historia_de_Python", "title": "Historia de Python", "summary": "Artículo principal:\nPython es uno de los lenguajes de programación dinámicos más populares que existen entre los que se encuentran Java, JavaScript, Go y C#. Aunque es considerado a menudo como un lenguaje \"scripting\", es realmente un lenguaje de propósito general. En la actualidad, Python es usado para todo, desde simples \"scripts\", hasta grandes servidores web que proveen servicio ininterrumpido 24×7. Es utilizado para la programación de interfaces gráficas y bases de datos, programación web tanto en el cliente como en el servidor (véase Django o Flask) y \"testing\" de aplicaciones. Además tiene una amplia aceptación por científicos que hacen aplicaciones para las supercomputadores más rápidas del mundo y por los niños que recién están comenzando a programar.\nLa historia del lenguaje de programación Python se remonta hacia finales de los 80s y principio de los 90s,[1]​ su implementación comenzó en diciembre de 1989[2]​ cuando en Navidad Guido van Rossum que trabajaba en el (CWI) (un centro de investigación holandés de carácter oficial que, entre otras cosas, actualmente alberga la oficina central del W3C) decidió empezar el proyecto como un pasatiempo dándole continuidad al lenguaje de programación ABC del que había formado parte del equipo de desarrollo en el CWI,[3]​ dicho lenguaje se enfocaba en ser fácil de usar y aprender manteniendo potencia en su desempeño pero el hardware disponible en la época de su creación hacía difícil su uso y el proyecto no trascendió como se esperaba. Van Rossum es por tanto el autor principal de Python y continúa ejerciendo un rol central decidiendo la dirección del lenguaje, en la comunidad de Python se le conoce como Benevolente Dictador Vitalicio (en inglés: Benevolent Dictator for Life, BDFL). El nombre \"Python\" viene dado por la afición de Van Rossum al grupo Monty Python.\nEl lenguaje de programación Python fue originalmente desarrollado para el sistema operativo Amoeba.", "sections": [{"name": "Principales influencias de otros lenguajes", "text": "El núcleo de la sintaxis de Python y grandes aspectos de su filosofía fueron heredados directamente del lenguaje de programación ABC. Por ejemplo el siguiente código muestra una función para obtener el conjunto de todas las palabras en un documento en ABC[4]​ y en Python:\ndef\nwords\n(\ndocument\n):\ncollection\n=\nset\n()\nfor\nline\nin\n:\nword\n.\nsplit\n():\nif\nnot\nadd\n)\nreturn\nEn ABC no existe propiamente el tipo de dato conjunto, sino algo como multiconjuntos, es decir, si se inserta un elemento dos veces, aparecerá dos veces en esa colección, pero en Python el if puede ser eliminado porque la operación add sobre los conjuntos en Python no hace nada si el elemento ya está en el conjunto. Se puede observar perfectamente las similitudes entre ambos códigos, la sangría, el ciclo for, el operador in, pero también sus diferencias, como por ejemplo en ABC no se utilizan paréntesis y en Python sí, además las palabras claves en ABC son escritas en mayúsculas así como los nombres de los procedimientos o funciones; ABC hace distinción entre procedimiento y función, otra diferencia con Python.\nLas principales ideas de ABC que influyeron o se incluyeron en Python fueron según el propio Guido:[5]​\nLa sangría para agrupar el código\nEl carácter : para indicar que comienza un bloque indentado (después de pruebas con usuarios)\nEl diseño simple de las instrucciones: if, while, for,...\nTuplas, listas, diccionarios (fuertemente modificados en Python)\nTipos de datos inmutables\nNo imponer límites, como tamaño de un array, etc...\nEl \"prompt\" >>>\nOtras ideas que influyeron en la concepción de Python fue tener un lenguaje que pudiera ser tan potente como C pero también expresivo para ejecutar \"scripts\" como sh.[6]​ De hecho la sintaxis de Python copia muchísimo de C. Por ejemplo, las palabras claves (if, else, while, for, etc.) son las mismas que en C, los identificadores tienen las mismas reglas para nombrarlos que C, y la mayoría de los operadores estándar tienen el mismo significado que en C. Una de las mayores diferencias es que Python en lugar de usar llaves para agrupar código usa sangría, la otra gran diferencia es que Python usa tipado dinámico.\nLos generadores e iteradores fueron inspirados por Icon, y fusionados con las ideas de la programación funcional en un modelo unificado. Modula-3 fue la base del modelo de excepciones y del sistema de módulos.[1]​[3]​ Perl contribuyó en las expresiones regulares, usadas para la manipulación de \"string\".[7]​ Las adiciones a biblioteca estándar de Python standard library y algunas opciones sintácticas fueron influenciadas por Java algunos ejemplos son: el paquete de logging,[8]​ introducido en la versión 2.3,[9]​ el paquete threading para aplicaciones multihilos,[10]​ el parser SAX, introducido en la versión 2.0, y la sintaxis del decorador que usa @,[11]​ incluida en la versión 2.4[12]​", "subsections": []}, {"name": "Cronología de Python", "text": "Fechas de publicación:[13]​[14]​\nComienzo de la implementación - December, 1989\nPublicación interna en CWI - 1990\nPython 0.9.0 - 20 de febrero de 1991\t(publicado en alt.sources)[15]​\nPython 0.9.1 - febrero de 1991\nPython 0.9.2 - otoño de 1991\nPython 0.9.4 - 24 de diciembre de 1991\nPython 0.9.5 - 2 de enero de 1992 (solo para Macintosh)\nPython 0.9.6 - 6 de abril de 1992\nPython 0.9.7 beta - 1992\nPython 0.9.8 - 9 de enero de 1993\nPython 0.9.9 - 29 de julio de 1993\nPython 1.0 - enero de 1994\nPython 1.5 - 31 de diciembre de 1997\nPython 1.6 - 5 de septiembre de 2000\nPython 2.0 - 16 de octubre de 2000\nPython 2.1 - 17 de abril de 2001\nPython 2.2 - 21 de diciembre de 2001\nPython 2.3 - 29 de julio de 2003\nPython 2.4 - 30 de noviembre de 2004\nPython 2.5 - 19 de septiembre de 2006\nPython 2.6 - 1 de octubre de 2008\nPython 2.7 - 3 de julio de 2010\nPython 3.0 - 3 de diciembre de 2008\nPython 3.1 - 27 de junio de 2009\nPython 3.2 - 20 de febrero de 2011\nPython 3.3 - 29 de septiembre de 2012\nPython 3.4 - 16 de marzo de 2014\nPython 3.5 - 8 de febrero de 2015\nPython 3.6 - 23 de diciembre de 2016\nPython 3.7 - 12 de junio de 2018\nPython 3.8 - 14 de octubre de 2019\nPython 3.9 - 5 de octubre de 2020", "subsections": []}, {"name": "Primera publicación", "text": "El 20 de febrero de 1991, van Rossum publicó el código por primera vez en alt.sources, con el número de versión 0.9.0.[15]​ En esta etapa del desarrollo ya estaban presentes clases con herencia, manejo de excepciones, funciones y los tipos modulares, como: str, list, dict, entre otros. Además en este lanzamiento inicial aparecía un sistema de módulos adoptado de Modula-3; Van Rossum describe el módulo como “una de las mayores unidades de programación de Python”.[1]​ El modelo de excepciones en Python es parecido al de Modula-3, con la adición de una cláusula else.[3]​ En el año 1994 se formó comp.lang.python, el foro de discusión principal de Python, marcando un hito en el crecimiento del grupo de usuarios de este lenguaje.", "subsections": []}, {"name": "Versión 1.0", "text": "Python llega a la versión 1.0 en enero de 1994. Las características más importantes incluidas en esta publicación fueron las herramientas de la programación funcional lambda, reduce, filter y map. Van Rossum ha comentado que \"Python adquiere lambda, reduce(), filter() y map(), cortesía de un hacker de Lisp que las extrañaba y envió parches que funcionaban\".[16]​\nLa última versión liberada proveniente de CWI fue Python 1.2. En 1995, van Rossum continuó su trabajo en Python en la Corporation for National Research Initiatives (CNRI) en Reston, Virginia, donde lanzó varias versiones del software.\nPara la versión 1.4, Python adquirió varias características nuevas. Es notable entre estas los argumentos por nombre inspirados por Modula-3 (que también son similares a los de Common Lisp) y soporte \"built-in\" para los números complejos.\nDurante su estancia en CNRI, Van Rossum lanzó la iniciativa Computer Programming for Everybody (CP4E), con el fin de hacer la programación más accesible a más gente, con un nivel de 'alfabetización' básico en lenguajes de programación, similar a las habilidades básicas en inglés y matemáticas necesarias por muchos empleadores. Python tuvo un papel crucial en este proceso: debido a su orientación hacia una sintaxis limpia, ya era idóneo, y las metas de CP4E presentaban similitudes con su predecesor, ABC. El proyecto fue patrocinado por DARPA.[17]​ El proyecto CP4E está inactivo, y mientras tanto Python intenta ser fácil de aprender y no muy arcano en su sintaxis y semántica, pero alcanzar a los no-programadores ya no es una preocupación activa.[18]​", "subsections": [{"name": "BeOpen", "text": "En el año 2000, el equipo principal de desarrolladores de Python se cambió a BeOpen.com para formar el equipo BeOpen PythonLabs. CNRI pidió que la versión 1.6 fuera publicada hasta el punto de desarrollo en que el equipo abandonó CNRI. Consecuentemente su agenda de lanzamiento para la versión 1.6 y la versión 2.0 tenían una significativa cantidad de solapamiento.[19]​ Python 2.0 fue el primer y único lanzamiento de BeOpen.com. Después que Python 2.0 fuera publicado por BeOpen.com, Guido van Rossum y los otros desarrolladores de PythonLabs se unieron a Digital Creations.\nLa publicación de Python 1.6 incluía una nueva licencia de CNRI que era substancialmente más larga que la licencia de CWI que había sido usada en las publicaciones anteriores.\nLa nueva licencia incluía una cláusula estipulando que la licencia estaba gobernada por las leyes del estado de Virginia.  La Free Software Foundation (FSF) argumento la cláusula era incompatible con GNU GPL.  Entonces BeOpen, CNRI, y FSF acordaron cambiar Python hacia una licencia de software libre que lo haría compatible con GPL.  Python 1.6.1 es básicamente el mismo que Python 1.6, con unos arreglos de bugs, y con la nueva licencia compatible con GPL.[20]​"}]}, {"name": "Versión 2.0", "text": "Python 2.0 tomó una importante característica del lenguaje de programación funcional Haskell: generación de listas. La sintaxis de Python para esta construcción es muy similar a la de Haskell, salvo por la preferencia de los caracteres de puntuación en Haskell, y la preferencia de Python por palabras claves. Python 2.0 introdujo además un sistema de recolección de basura capaz de recolectar referencias cíclicas.\nPython 2.1 fue un trabajo derivado de Python 1.6.1, así como también de Python 2.0. Su licencia fue renombrada a: Python Software Foundation License. Todo el código, documentación y especificaciones añadidas, desde la fecha del lanzamiento de la versión alfa de Python 2.1, pertenece a Python Software Foundation (PSF), una organización sin ánimo de lucro fundada en el año 2001, tomando como modelo la Apache Software Foundation.[20]​ Este lanzamiento incluyó un cambio en el lenguaje para soportar ámbitos anidados (más conocido en programación como \"nested scopes\") como lo soportan otros lenguajes de \"static scoping\" (del cual Scheme es el originador).[21]​ (Esta características fue deshabilitada por defecto, y no requerida, hasta Python 2.2.)\nUna gran innovación en Python 2.2 fue la unificación de los tipos en Python (tipos escritos en C), y clases (tipos escritos en Python) dentro de una jerarquía. Esa unificación logró un modelo orientado a objetos de Python puro y consistente.[22]​ También fueron agregados los generadores que fueron inspirados por el lenguaje Icon.[23]​", "subsections": []}, {"name": "Versión 3.0", "text": "Python 3.0 (también conocido como \"Python 3000\" o \"Py3K\") fue diseñado para rectificar ciertas fallas fundamentales en el diseño del lenguaje (los cambios requeridos no podían ser implementados mientras se mantuviera compatibilidad hacia atrás con la serie 2.x).  El principio que guía Python 3 es: \"reducir la duplicación de características eliminando viejas formas de hacer las cosas (reduce feature duplication by removing old ways of doing things)\".", "subsections": [{"name": "Filosofía", "text": "Python 3.0 fue desarrollado con la misma filosofía que en las versiones anteriores. Sin embargo, como Python ha acumulado nuevas y redundantes formas de programar la misma tarea, Python 3.0 ha hecho énfasis en eliminar constructores duplicados y módulos, en consecuencia con \"Debe haber un— y preferiblemente solo un —modo obvio de hacerlo\".\nA pesar de esto, Python 3.0 se mantiene como un lenguaje de programación multiparadigma. Los programadores todavía tienen opciones entre orientación a objetos, programación estructurada, programación funcional y otros paradigmas, pero dentro de estas amplias opciones, los detalles intentan ser más obvios en Python 3.0 que como eran en Python 2.x."}, {"name": "Cronología y compatibilidad", "text": "Python 3.0 fue liberado el 3 de diciembre de 2008.[24]​\nLas series Python 2.x y Python 3.x estaban planeadas para coexistir por varias publicaciones lanzándolas en paralelo, con la serie 2.x existente mayormente por compatibilidad y con algunas nuevas características siendo importadas hacia atrás de la serie 3.x.\nPython 2.6 fue liberado para coincidir con Python 3.0, e incluye algunas características de esa publicación, así como un modo de \"alertas (warnings)\" que resalta el uso de características que han sido eliminadas en Python 3.0.[25]​\nSimilarmente, Python 2.7 coincide e incluye características de Python 3.1,[26]​ que fue publicado el 26 de junio de 2009.\nPython 2.7 fue la última publicación en la serie 2.x;[27]​ las publicaciones en paralelo terminaron con Python 3.2.\nPython 3.0 rompe la compatibilidad hacia atrás. El código de Python 2.x no necesariamente debe \"correr\" en Python 3.0 sin modificarlo. Hay cambios básicos tales como el cambio de print en una función (por lo tanto cualquier uso como print \"Hello Python\" provocará un error en Python 3.x), y el cambio a Unicode para todos los textos \"strings\". El tipado dinámico de Python combinado con los planes para cambiar la semántica de ciertos métodos de los diccionarios, por ejemplo, hacen que convertir perfectamente de Python 2.x a Python 3.0 sea muy difícil de manera automática. Sin embargo, una herramiento llamada \"2to3\" puede hacer la mayoría del trabajo de \"traducción\", señalando áreas que son confusas para ella usando comentarios o alertas. Incluso en la etapa \"alpha\", 2to3 se mostraba claramente satisfactoria para ejecutar las traducciones del código.[28]​ Para proyectos que requerían compatibilidad de ambas versiones 2.x y 3.x, el equipo de Python recomendó guardar el código fuente de las versiones 2.x, y generar versiones a Python 3.x usando 2to3. Se desaconsejó esta forma de conversión a Python 3.x si el código realmente necesitase ejecutarse en Python 2.x."}, {"name": "Características", "text": "Algunos de los mayores cambios anunciados para Python 3.0 fueron:\nCambiar la instrucción print de modo que sea una función \"built-in\", no una instrucción. Esto ha hecho que sea más fácil cambiar un módulo para usar una función print diferente, así como hacer la sintaxis más regular.  En Python 2.6 y 2.7 esta característica puede ser habilitada usando from __future__ import print_function.[29]​\nMoviendo reduce (pero no map o filter) fuera del espacio de nombres \"built-in\" dentro de \"functools\".[30]​\nAdicionar soporte para anotación opcional en funciones que pueda ser usar para la declaración informal de tipos u otros propósitos.[31]​\nUnificar los tipos str/unicode, representando texto, e introduciendo un tipo immutable bytes; y un más correspondiente tipo mutable bytearray, ambos de los cuales representan \"arrays\" de bytes;[32]​\nEliminar compatibilidad hacia atrás, incluidas clases \"old-style\", excepciones \"string\", e implícitos \"imports\" relativos.\nLas subsecuentes publicaciones de la serie Python 3.x han incluido sustanciales nuevas características; todas al corriente del desarrollo que el lenguaje ha tenido en la serie 3.x."}]}, {"name": "Véase también", "text": "Python\nDjango\nFlask", "subsections": []}, {"name": "Referencias", "text": "↑ a b c «The Making of Python». Artima Developer. Consultado el 22 de marzo de 2007. \n↑ «A Brief Timeline of Python». Guido Van Rossum. Consultado el 5 de enero de 2015. \n↑ a b c «Why was Python created in the first place?». Python FAQ. Consultado el 5 de enero de 2015. \n↑ «The ABC Programming Language». Consultado el 5 de enero de 2015. \n↑ «The History of Python». Consultado el 5 de enero de 2015. \n↑ «Interview with Guido Van Rossum». julio de 1998. Archivado desde el original el 1 de mayo de 2007. Consultado el 29 2007. \n↑ https://docs.python.org/library/re.html\n↑ «PEP 282 - A Logging System». Python.org. Consultado el 24 de noviembre de 2008. \n↑ «8 PEP 282: The logging Package». Python.org. Archivado desde el original el 20 de diciembre de 2008. Consultado el 24 de noviembre de 2008. \n↑ https://docs.python.org/library/threading.html\n↑ «PEP 318 - Decorators for Functions and Methods». Python.org. Consultado el 24 de noviembre de 2008. \n↑ «5 PEP 318: Decorators for Functions and Methods». Python.org. Archivado desde el original el 10 de diciembre de 2008. Consultado el 24 de noviembre de 2008. \n↑ «Copia archivada». Archivado desde el original el 22 de diciembre de 2015. Consultado el 6 de enero de 2015. \n↑ http://python-history.blogspot.com/2009/01/brief-timeline-of-python.html\n↑ a b van Rossum, Guido (20 de enero de 2009). «A Brief Timeline of Python». The History of Python (en inglés). Consultado el 14 de febrero de 2021. \n↑ Guido Van Rossum. «The fate of reduce() in Python 3000». Artima Developer. Consultado el 22 de marzo de 2007. \n↑ Computer Programming for Everybody\n↑ «Computer Programming for Everybody». Python Software Foundation. Archivado desde el original el 29 de marzo de 2007. Consultado el 22 de marzo de 2007. \n↑ What's New in Python 2.0\n↑ a b «History of the software». Python Library Reference. Archivado desde el original el 29 de marzo de 2007. Consultado el 22 de marzo de 2007. \n↑ PEP 227 -- Statically Nested Scopes\n↑ PEPs 252 and 253: Type and Class Changes\n↑ PEP 255: Simple Generators\n↑ Python 3.0 release\n↑ Neal Norwitz; Barry Warsaw (29 de junio de 2006). «PEP 361 -- Python 2.6 and 3.0 Release Schedule». Consultado el 7 de octubre de 2012. \n↑ A.M. Kuchling (3 de julio de 2010). «What’s New in Python 2.7». Consultado el 7 de octubre de 2012. «Much as Python 2.6 incorporated features from Python 3.0, version 2.7 incorporates some of the new features in Python 3.1. The 2.x series continues to provide tools for migrating to the 3.x series.» \n↑ Barry Warsaw (9 de noviembre de 2011). «PEP 404 -- Python 2.8 Un-release Schedule». Consultado el 7 de octubre de 2012. \n↑ Sam Ruby, 2to3, September 1, 2007\n↑ PEP 3105\n↑ Thread on Artima programmer blog\n↑ PEP 3197\n↑ PEP 3137: Immutable Bytes and Mutable Buffer", "subsections": []}, {"name": "Enlaces externos", "text": "Guido Van Rossum blog on Python's Histor", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Holand%C3%A9s", "title": "Holandés", "summary": "El término holandés puede referirse a:\nEl natural de Holanda, o lo perteneciente o relativo a esta región de los Países Bajos.\nEl dialecto holandés hablado allí.\nAdemás, es muy frecuente usarlo para referirse a: \nEl natural de Países Bajos (Nederland), o lo perteneciente o relativo a este Estado europeo.\nEl idioma neerlandés, la lengua oficial de dicho Estado.\nEl pueblo neerlandés, la población nativa del mismo.", "sections": []}
{"url": "https://es.wikipedia.org/wiki/Huevo_de_pascua_(virtual)", "title": "Huevo de pascua (virtual)", "summary": "Un huevo de Pascua o huevo pascual[1]​ (en inglés Easter egg) es un mensaje o capacidad oculta contenido en películas, series de televisión, discos compactos, DVD, Blu-ray, programas informáticos o videojuegos.\nEntre los programadores, parece haber una motivación en dejar una marca personal, casi un toque artístico sobre un producto intelectual, el cual es por naturaleza estándar y funcional.\nActualmente, los huevos de Pascua tratan de entretener, buscar nuevos trabajos potenciales, pagar tributo a los ejecutivos o divertir a los programadores.[2]​", "sections": [{"name": "Origen", "text": "El origen del término se encuentra en el videojuego de Atari Adventure de 1979, que contenía el primer huevo de Pascua virtual que se conoce, introducido por el programador Warren Robinett.[3]​\nEn aquel tiempo Atari no incluía los nombres de los programadores en los créditos del juego, por temor a que los competidores trataran de robarles sus empleados. Robinett estaba en desacuerdo con su supervisor sobre esta falta de reconocimiento y programó el mensaje «Creado por Warren Robinett» (Created by Warren Robinett) para que apareciera cuando el jugador movía su avatar sobre un pixel específico, llamado punto gris, durante una cierta parte del juego y entrando en una habitación secreta mediante una elaborada secuencia de pasos. Robinett lo pensó como una maniobra de autopromoción.\nAtari vendió un millón de unidades del juego a 25 USD cada uno. Robinett se enfadó con Atari porque tenía un salario de 22 000 USD al año, ningún bonus y no se le hacía llegar el correo de los jugadores.\nCuando Robinett abandonó Atari, no informó a la compañía del reconocimiento que había incluido en el juego. Poco después el punto gris y su mensaje fue descubierto por Adam Clayton, un jugador de 15 años de Salt Lake City, que mandó una carta a Atari el 4 de agosto de 1980.[4]​ La dirección de Atari inicialmente quiso retirar el mensaje y lanzar el juego otra vez, pero resultaba demasiado costoso. En su lugar, Steve Wright, director de desarrollo de software de la división de consumo de Atari, sugirió que se mantuviera el mensaje y que se potenciara su inclusión en juegos futuros. Los llamó huevos de Pascua porque no estaban documentados y los encontraban los jugadores.\n[5]​\n[6]​\nEn la película Ready Player One de Steven Spielberg el protagonista debe jugar el juego Adventure de Atari y descubrir su huevo de Pascua.\nMientras lo está jugando, Parzival dice:\n[2]​", "subsections": []}, {"name": "En videojuegos", "text": "El primer juego de aventuras en texto Colossal Cave Adventure (1976), del que Adventure derivó, incluyó varias palabras secretas. Una de ellas era \"xyzzy\", un comando que permitía al jugador moverse entre dos puntos del juego.[7]​\nEn 2004 se encontró un huevo de Pascua que mostraba el apellido del programador Bradley Reid-Selth en el videojuego Video Whizball (1978), un juego para el sistema Fairchild Channel F.[8]​\nSegún la investigación de Ed Fries, el primer huevo de Pascua conocido en un juego arcade de monedas estaba en Starship 1 (1977), programado por Ron Milner. Pulsando los controles en un orden determinado, el jugador obtenía en la pantalla el mensaje «¡Hola, Ron!» y diez partidas gratis.\nHabía que introducir una moneda mientras se mantenían pulsados los botones «phasor» y «start». Entonces, se soltaban esos botones y rápidamente se movía la palanca «slow».\nFries lo describe como el primer juego arcade conocido que se ajusta a la definición de huevo de Pascua. La existencia de este huevo de Pascua no se publicó hasta 2017, lo que llevó a Fries a sugerir que los más de cien juegos arcade que preceden a Starship 1 podrían contener huevos de Pascua no descubiertos.[9]​[10]​\nDesde Adventure hay una larga historia de desarrolladores de videojuegos colocando huevos de Pascua en sus juegos.[11]​\n: 19 \nLa mayoría de los huevos de Pascua son intencionados, un intento de comunicarse con el jugador o una forma de tomarse la revancha por desaires de la dirección de la empresa. Los huevos de Pascua en los videojuegos han tomado una variedad de formas, desde las pantallas puramente ornamentales hasta las mejoras estéticas que cambian algún elemento del juego durante la partida. El huevo de Pascua incluido en Age of Empires (1997) es un ejemplo de lo último: los proyectiles de la catapulta se cambian de piedras a vacas.[11]​\n: 19 \nLos huevos de Pascua más elaborados incluyen niveles secretos y habitaciones de desarrolladores, que son áreas secretas del juego totalmente funcionales.\nLas habitaciones de desarrolladores frecuentemente incluyen bromas internas de los seguidores o del equipo de desarrollo y difieren de las habitaciones de depuración en que están destinadas a que el jugador las encuentre.\nAlgunos juegos llegan a incluir minijuegos ocultos como huevos de Pascua. En el juego Day of the Tentacle (1993) de LucasArts, se puede jugar el juego original Maniac Mansion (1987) en su versión completa usando un ordenador personal virtual en la habitación de un personaje.[12]​[13]​\nOtros huevos de Pascua se originaron no intencionadamente. El código Konami se originó en el juego Gradius (1985) de Konami para Nintendo Entertainment System. El programador Kazuhisa Hashimoto creó un parte de código para ayudarle a depurar el juego dándole salud y fuerzas adicionales a su avatar para avanzar en el juego rápidamente. Esas partes de código normalmente se retiran del juego antes de su lanzamiento. En el caso de Gradius, Hashimoto se olvidó de retirarlo y el código fue descubierto por los jugadores. Su popularidad inspiró a Konami a reutilizar el código y mantenerlo como huevo de Pascua en sus juegos futuros.[8]​[12]​[14]​\nHay problemas técnicos que crean huevos de Pascua no intencionados. Jon Burton, fundador de Traveller's Tales, anunció que muchos de los huevos de Pascua aparentes en sus juegos para Mega Drive surgieron como resultado de trucos de programación para atajar algunas dificultades para conseguir la estricta certificación de Sega para sus juegos. La captura de excepciones durante la ejecución podía mantener usable el juego y pasar la certificación.\nPor ejemplo, golpear el cartucho de Sonic 3D Blast (1996) mientras se introducía en la consola llevaría el juego hasta la pantalla secreta de selección de nivel, que según Burton explicó era la forma de manejar cualquier error de procesador sin identificar que lo llevaría al bloqueo, como cuando temporalmente se perdía la comunicación entre el cartucho y el microprocesador.[15]​", "subsections": []}, {"name": "Computación", "text": "", "subsections": [{"name": "Software", "text": "En software los huevos de Pascua son respuestas secretas que se producen como resultado a una serie de comandos no documentados. Los resultados varían entre un mensaje o imagen hasta una página de créditos a programadores o un video oculto dentro de un programa.\nMuchos ordenadores personales tienen huevos de Pascua ocultos en la memoria de solo lectura, que incluyen listas de desarrolladores, exhortos políticos, trozos de música o imágenes del equipo de desarrollo.\nDEC\nEn el sistema operativo TOPS-10 (1967) para el ordenador DEC PDP-10 el comando make se usa para llamar al editor de texto TECO y crear un fichero. Si el argumento para el nombre de fichero era love, el comando completo quedaba como make love (haz el amor). Esto producía una pausa y la respuesta not war? (¿no la guerra?) antes de crear el fichero.[16]​\nAlgunas versiones del sistema operativo DEC OpenVMS tienen códigos de estado de salida ocultos, incluyendo una referencia al sketch Dirty Hungarian Phrasebook de Monty Python : \"exit %xb70\" devuelve el mensaje \"%SYSTEM-W-FISH, my hovercraft is full of eels\" (%Sistema-con-pescado, mi hovercraft está lleno de anguilas), mientras que \"exit %x34b4\" devuelve una referencia a un antiguo meme: \"%SYSTEM-F-GAMEOVER, All your base are belong to us\" (%Sistema-F-juego-finalizado, Toda tu base nos pertenece).[17]​\nMicrosoft\nLa versión de Microsoft Office de 1997 incluía un simulador de vuelo dentro de Microsoft Excel y un juego de máquina de bolas (pinball) en Microsoft Word.[18]​[19]​\nLos sistemas operativos Microsoft Windows anteriores a XP tienen el huevo de Pascua de volcán. En el salvapantallas de texto si se introduce «volcano» se muestran todos los nombres de volcanes en los Estados Unidos. Microsoft retiró este huevo de Pascua en XP, pero añadió otros.\nMicrosoft Excel 95 contenía un juego de acción oculto similar a Doom (1993) llamado The Hall of Tortured Souls.[20]​\nDesde 2002 Microsoft no permite código oculto o no documentado como parte de su iniciativa de computación de confianza (trustworthy computing).[21]​\nLinux\nDentro del sistema operativo Linux Debian la herramienta apt-get tiene un huevo de Pascua que dibuja una vaca con caracteres ASCII cuando se introduce en el terminal apt-get moo[22]​\nEn un terminal Linux la orden apt-get help produce un texto de ayuda que al final contiene la frase Este APT tiene poderes de Super Vaca.[23]​\nEn el editor de texto vim la orden :help 42 produce el texto «What is the meaning of life, the universe and everything?  42. Douglas Adams, the only person who knew what this question really was about is now dead, unfortunately. So now you might wonder what the meaning of death is... » («¿Cuál es el sentido de la vida, el universo y todo? 42. Douglas Adams, la única persona que sabía de qué iba esta pregunta, ahora está muerta, desafortunadamente. Así que ahora te podrías preguntar cuál es el sentido de la muerte...»).\nApple\nEn los comienzos de Apple Steve Jobs pedía a sus ingenieros que firmaran su trabajo como artistas. Cada programa incluido en el Macintosh tenía el menú «Acerca de» que mostraba claramente los créditos. Esto hizo que los usuarios conocieran a gente como Andy Hertzfeld, Bill Atkinson, Bruce Horn, Steve Capps o Susan Kare.\nJobs hizo firmar en el molde de la carcasa a todos los que participaron en el proyecto Macintosh, de modo que cuando se abre uno de los Macintosh originales se pueden ver todas esas firmas.\nEn el PowerMacintosh con System 7.5, si se escribe «secret about box» en el editor SimpleText, y se arrastra al escritorio, aparece una ventana que contiene una bandera con una iguana y el texto «iguana iguana powersurgius». La bandera ondea según la posición del cursor y al rato aparece una foto del equipo de desarrollo con los nombres de todos en una caja inferior.\nSteve Jobs, tras su retorno a la compañía, prohibió los huevos de Pascua como una forma de evitar que otras compañías robaran a Apple los ingenieros con talento. En un tiempo en el que la empresa se hundía rápidamente dijo que no tenía sentido facilitar las cosas a la competencia.\n[24]​\nTras la muerte de Jobs el primer huevo de Pascua apareció en 2012 tras una actualización de la Mac App Store para OS X Mountain Lion, en la que las aplicaciones descargadas tenían temporalmente como fecha de descarga la de 24 de enero de 1984, la fecha de lanzamiento del Macintosh.[24]​\nGoogle\nDan Sandler, cuando trabajaba en el software Android, dijo que los huevos de Pascua ayudaban a establecer el software como una forma de arte, siguiendo los pasos de pintores, músicos y artesanos que introducían pequeñas bromas y referencias dentro de su trabajo desde hace siglos.\nPara la versión Android P crearon una app secreta de dibujo en la que los trazos desaparecen al poco tiempo y la obra no se puede guardar.\nEn la división de Google Maps lanzaron el huevo de Pascua el 10 de marzo de 2018, «Día Internacional de Mario» (Mar10), en el que cambiaron el punto azul de posición por el coche de Mario Kart.\nLos huevos de Pascua están incorporados en la cultura de Google y tienen un grupo de correo interno sobre huevos de Pascua (llamado Poultry). Crearon herramientas de software para incorporar fácilmente huevos de Pascua a los resultados de búsqueda.[2]​\nEl buscador de Google a veces da huevos de Pascua como respuesta a ciertas preguntas. Por ejemplo, Google Maps una vez respondió a la petición de indicaciones para ir de Japón a China diciendo que usara un jet-ski para atravesar el Océano Pacífico.\nEn Google Earth la combinación de teclas \nCtrl\n+\nAlt\n+\nA\npone al usuario en un simulador de vuelo que le permite volar sobre la superficie de la Tierra.[25]​\nWordPress\nEn el contrato de términos de servicio de WordPress hay un párrafo de renuncia de garantías que dice:\nEl enlace abre una fotografía de un bistec de carne y un tributo al restaurante de barbacoa Memphys Minnie de San Francisco.\nEste huevo de Pascua se ha copiado a muchas empresas que utilizan las plantillas de WordPress y no han adaptado el contrato de términos de servicio.[2]​"}, {"name": "Hardware", "text": "Los huevos de Pascua también pueden encontrarse en hardware o firmware de algunos aparatos como la BIOS ROM de algunos ordenadores personales.\nEl 13 de noviembre algunas AMI BIOS en lugar de arrancar se ponen a tocar en bucle la melodía de feliz cumpleaños hasta que se aprieta una tecla.[26]​\nLos primeros Apple Macintosh tenían fotografías del equipo de desarrollo en la ROM. Estos huevos de Pascua fueron muy publicitados en la prensa de entonces.[27]​[28]​[29]​\nEn el Radio Shack Color Computer 3 si se presionan a la vez las teclas \nCtrl\n+\nAlt\n+\nReset\n muestra la foto de tres desarrolladores que está almacenada en la ROM.[30]​\nAlgunos osciloscopios contienen huevos de Pascua. El osciloscopio HP 54600B, contiene un clon del juego Tetris (1984),[31]​\nEl osciloscopio HP 54622D contiene un juego similar a Asteroids (1979) llamado Rocks.[32]​\nEl osciloscopio Tektronix 1755A Vector and Waveform Monitor muestra un pez nadando cuando en el menú de configuración se selecciona «Remote>Software version».[33]​\nLa calculadora Hewlett-Packard HP-45 (lanzada en 1973) contiene un cronómetro no documentado al que se accede mediante una secuencia de teclas.[34]​\nEl ordenador Commodore Amiga 1000 tiene dentro de la carcasa las firmas de los componentes de los equipos de diseño y desarrollo. Se incluye la firma de Jay Miner y la huella de su perro Mitchy.[35]​\nLos ordenadores Commodore Amiga el sistema operativo Amiga OS contiene mensajes ocultos.[36]​\n[37]​\nMuchos diseñadores de circuitos integrados (chips) incluyen elementos gráficos llamados «chip art», que incluyen imágenes, frases, iniciales de desarrolladores, logos y más. Este arte, como el resto del chip, se reproduce en cada copia por litografía y grabado. Solo se hace visible cuando se abre el chip y se examina con un microscopio.[38]​\nA mediados de la década de 1980 en un laboratorio de Kombinat Mikroelektronik Erfurt del Ministerio de Interior de la antigua República Democrática Alemana (RDA) se descubrió un mensaje dentro de un microprocesador DEC cuando estaban analizando el chip. Estaba escrito en el nivel de metalización, que sirve para conectar los distintos componentes individuales en un circuito integrado. Como ese nivel no está arriba, el texto solo se podía encontrar cuando se retiraba capa a capa para entender la tecnología de fabricación mediante ingeniería inversa.\nLa foto original del texto está en algunos archivos de la Stasi (BStU, Ast. Erfurt, Abt. XVIII, Bd. 13, Bl. 70).[39]​\nEl microchip CVAX de la CPU MicroVAX contenía grabada la frase en alfabeto cirílico:\nLos ingenieros de DEC intentaron copiar el eslogan de las tarjetas Hallmark que decía:\ny lo cambiaron a:\nEn 1983, una fuente de inteligencia comunicó a DEC que un ordenador VAX-11/780 que estaba operando en un complejo de misiles soviéticos SS-20 tenía escrita esa frase sobre la carcasa.[38]​\nSabiendo que algunos CVAX terminarían en la Unión Soviética, a pesar de la prohibición sobre su venta, DEC decidió incluir la frase para que los soviéticos supieran que estaban pensando en ellos cuando trataran de copiar el microprocesador con técnicas de ingeniería inversa.[40]​[38]​\nLa traducción al ruso es bastante mala y probablemente fue hecha palabra a palabra usando un diccionario.[41]​"}]}, {"name": "Tesla", "text": "Artículo principal:\nTesla es una «empresa de software que fabrica ordenadores sobre ruedas». Desde sus inicios ha incluido huevos de Pascua y se han descubierto entre otros:\nModo Romance: La pantalla muestra una hoguera, la calefacción se enciende y suenan canciones románticas.[43]​\nModo Santa Claus: El icono del coche se transforma en trineo, caen copos de nieve y el intermitente suena como una campanilla.\nModo de Prueba de Emisiones: Suenan flatulencias en el punto determinado y a discreción.[44]​\nRegreso al Futuro: Con la batería cargada para una autonomía de 121 km (o 121 millas), se abre la APP del teléfono y se toca en el icono de la batería, aparecen múltiples referencias a la película de 1985 Back to the Future.[45]​\nMonty Python: Cambiando el nombre del coche a Patsy, Rabbit of Caerbannog, Mr. Creosote, Biggus Dickus o Unladen Swallow activará el pie de Cupido.[46]​\nGuía del autoestopista galáctico: Si se intenta cambiar el nombre del coche a «42» este cambiará a «Life, the Universe, and Everything» (La vida, el universo y todo).\nSpinal Tap: El volumen de sonido sube hasta 11 como guiño a la película This is Spinal Tap (1984) dirigida por Rob Reiner. En la película falso documental un músico muestra su amplificador Marshall en el que todos los diales llegan hasta 11.[47]​\nAhoy-Hoy: Si se aprieta el icono de teléfono durante tres segundos el texto cambia a Ahoy-Hoy, que fue la frase propuesta por el inventor del teléfono, Alexander Graham Bell, para responder un teléfono.\n1984: Los discos duros usados para el modo Centinela se pueden formatear en FAT32 o EXT4. Cuando el formato es EXT4 las grabaciones tendrán como propietario y grupo el «1984». Es un homenaje a la novela de ficción distópica 1984 escrita por George Orwell entre 1947 y 1948 y publicada el 8 de junio de 1949. La novela popularizó los conceptos del omnipresente y vigilante Gran Hermano.\nMarte: Tras la activación la pantalla muestra la superficie de Marte en lugar de la de la Tierra.\nHecho en la Tierra: Los Tesla Roadster llevan escrito en un circuito impreso «Hecho en la Tierra por humanos» («Made on Earth by humans»).93 9495 El circuito impreso PCB lleva los fusibles de 150A en la línea de entrada de corriente. El número de pieza es ASSY 09-000226-01 REV.[48]​\nS3XY: En el sitio web de Tesla y en sus presentaciones el orden en que se muestran los modelos no es el cronológico y según Elon Musk está hecho a propósito para que sus letras formen el acrónimo «S3XY» que visualmente se parece a «SEXY».\nSuperbottle: Un sofisticado depósito para el sistema de refrigeración del Tesla Model 3 lleva impreso en relieve la palabra «SUPERBOTTLE» (Superbotella). También lleva impresa una caricatura de una botella con capa al estilo de los superhéroes. La caricatura tiene brazos y piernas musculados y lleva la T del logo de Tesla en el pecho.[49]​\nOctovalve: El depósito del sistema de refrigeración del Tesla Model Y tiene impresa en relieve una caricatura de un pulpo con el símbolo estrellado de un copo de nieve (octovalve).[50]​[51]​[52]​[53]​", "subsections": []}, {"name": "Véase también", "text": "Entrada ficticia\nBomba lógica", "subsections": []}, {"name": "Referencias", "text": "↑ «diccionario de la lengua española». \n↑ a b c d Pogue, David (8 de agosto de 2019). «The Secret History of 'Easter Eggs'». The New York Times. Consultado el 10 de mayo de 2020. \n↑ Robinett, Warren: Adventure as a Video Game. Adventure for the Atari 2600. In: Katie Salen a. Eric Zimmerman (eds.): The Game Design Reader. A Rules of the Play Anthology. MIT Press 2006, p. 690–713 (here p. 713) ISBN 0-262-19536-4\n↑ \nWayback Machine, ed. (4 de agosto de 1980). «Letter to Atari». 2600 Connections. Archivado desde el original el 13 de octubre de 2016. Consultado el 10 de mayo de 2020. \n↑ \nBaker, Chris (13 de marzo de 2015). «How One Man Invented the Console Adventure Game». WIRED. Consultado el 10 de mayo de 2020. \n↑ \nSalen, Katie; Zimmerman, Eric (2005).  MIT Press, ed. The Game Design Reader: A Rules of Play Anthology. Cambridge, Massachusetts. pp. 690-713. ISBN 0262195364. OCLC 58919795. \n↑ \nJerz, Dennis G. (2007). «Somewhere Nearby is Colossal Cave: Examining Will Crowther's Original \"Adventure\" in Code and in Kentucky».  En The Alliance of Digital Humanities Organizations, ed. Digital Humanities Quarterly 1 (2). Consultado el 10 de mayo de 2020. \n↑ a b \nWolf, Mark J.P. (2012).  Greenwood, ed. Encyclopedia of Video Games: The Culture, Technology, and Art of Gaming. Santa Barbara, California. p. 177. ISBN 9780313379369. \n↑ \nMachkovech, Sam (22 de marzo de 2017). «The arcade world's first Easter egg discovered after fraught journey». Ars Technica (en inglés estadounidense). Consultado el 10 de mayo de 2020. \n↑ \nFries, Ed (24 de marzo de 2017). «The Hunt For The First Arcade Game Easter Egg». Kotaku. Consultado el 10 de mayo de 2020. \n↑ a b \nConsalvo, Mia (2007).  MIT Press, ed. Cheating: Gaining Advantage in Videogames. Cambridge, Massachusetts. ISBN 9780262033657. \n↑ a b \nBjörk, Staffan; Holopainen, Jussi (2005).  Charles River Media, ed. Patterns In Game Design (1 edición). Hingham, Massachusetts. p. 235. ISBN 9781584503545. Consultado el 25 de enero de 2013. \n↑ \nMeckler Publishing, ed. (1 de febrero de 1994). «Optical Information Systems Update/library & Information Center Applications». CD-ROM World (en inglés) 9 (1–5). Consultado el 4 de noviembre de 2017. «The best Easter egg of all is the entire Maniac Mansion game, which appears on a computer in Doctor Fred's mansion. Users can play the original game in its entirety.» \n↑ \nGarmon, Jay (5 de marzo de 2007). «Geek Trivia: The cheat goes on». TechRepublic (en inglés). Consultado el 10 de mayo de 2020. \n↑ \nOrland, Kyle (4 de octubre de 2017). «How hitting a game cartridge unlocks gaming's weirdest Easter egg». Ars Technica (en inglés estadounidense). Consultado el 4 de octubre de 2017. \n↑ \nMontfort, Nick; Bogost, Ian (2009).  MIT Press, ed. Racing the Beam: The Atari Video Computer System. Cambridge, Massachusetts. p. 59. ISBN 9780262012577. Consultado el 10 de mayo de 2020. \n↑ \n«OpenVMS Undocumented Features». PARSEC Group (en inglés). Consultado el 6 de abril de 2016. \n↑ \nAnonymous (19 de julio de 1999). «Excel Easter Egg - Excel 97 Flight to Credits». The Easter Egg Archive (en inglés). Consultado el 10 de mayo de 2020. \n↑ \nArima, Kevin (20 de julio de 2009). «Word (Microsoft) Easter Egg - Pinball in Word 97». The Easter Egg Archive (en inglés). Consultado el 10 de mayo de 2020. \n↑ \nGaskell, John (19 de julio de 1999). «Excel Easter Egg - Excel 95 Hall of Tortured Souls». The Easter Egg Archive (en inglés). Consultado el 10 de mayo de 2020. \n↑ \nLarry Osterman (21 de octubre de 2005). «Why no Easter Eggs?».  En MSDN Blogs, ed. Larry Osterman's WebLog. Consultado el 10 de mayo de 2020. \n↑ \nGrant, Rickford with; Bull, Phil (2010).  No Starch, ed. Ubuntu for Non-Geeks: A Pain-Free, Get-Things-Done Guide (4 edición). San Francisco. p. 168. ISBN 9781593272579. Consultado el 10 de mayo de 2020. \n↑ \nkcbhiw (24 de julio de 2001). «Apt-Get and Super Cow Powers». The Easter Egg Archive (en inglés). Consultado el 10 de mayo de 2020. \n↑ a b \nDiaz, Jesus (26 de julio de 2012). «The Easter Eggs Are Back in OS X—And This One Is Insanely Great». Gizmodo. Consultado el 4 de noviembre de 2017. \n↑ \nFirth, Niall (29 de octubre de 2010). «How do I get to China? Jet ski! Google Maps joke gives users unorthodox instructions for crossing the Pacific». Daily Mail. Consultado el 10 de mayo de 2020. \n↑ \n«Happy Birthday Description». F-Secure Labs (en inglés). Consultado el 3 de julio de 2012. \n↑ \nKendig, Brain (1994). «Macintosh/Newton Easter Egg List». Consultado el 10 de mayo de 2020. \n↑ \nhudson (21 de agosto de 2012). «Ghosts in the ROM». NYC Resistor. Archivado desde el original el 17 de febrero de 2015. Consultado el 10 de mayo de 2020. \n↑ \nTirosh, Udi (22 de agosto de 2012). «Photographs Of Apple Team Found In 25 Years Old Macintosh SE». DIY Photography. Archivado desde el original el 26 de febrero de 2013. Consultado el 4 de noviembre de 2017. \n↑ \nFARNA Systems, ed. (1 de mayo de 1998). The World of 68' Micros, The - Vol. 5 Number 6 5 (6). p. 5. Consultado el 10 de mayo de 2020. \n↑ \nkcbhiw (24 de julio de 2001). «HP 54600B Oscilloscope Easter Egg - Tetris Within Oscilloscope». The Easter Egg Archive (en inglés). Consultado el 10 de mayo de 2020. \n↑ \nTonyK (24 de abril de 2002). «HP 54622D Easter Egg - HP Asteroids». The Easter Egg Archive (en inglés). Consultado el 10 de mayo de 2020. \n↑ \nPavel (8 de abril de 2000). «Tektronix 1751 Digital Video Osciloscope / Vectorscope Easter Egg - Fishes Swimming on Screen». The Easter Egg Archive (en inglés). Consultado el 10 de mayo de 2020. \n↑ Paul E. Miller (de junio de 1976). «How To Use The HP-45 Calculator As a Stopwatch Or Elapsed-time Indicator». Popular Electronics. \n↑ \nCorrigan, Patricia (2007).  Reedy Press, ed. Bringing Science to Life: A Guide from the Saint Louis Science. St. Louis, Missouri. p. 69. ISBN 9781933370163. \n↑ \nPetersen, Julie K. (2002).  CRC Press, ed. The Telecommunications Illustrated Dictionary (2nd edición). Boca Raton, Florida. p. 293. ISBN 9780849311734. Consultado el 24 de enero de 2013. \n↑ \nHyman, Michael (1995).  Programmers Press, ed. PC Roadkill (en inglés). Foster City, California. p. c. ISBN 9781568843483. Consultado el 24 de enero de 2013. \n↑ a b c \nBob Supnik (24 de febrero de 2008). «CVAX». Computer Simulation and History. Archivado desde el original el 17 de enero de 2015. Consultado el 23 de mayo de 2019. \n↑ Barkleit, Gerhard (2000).  Technischen Universität Dresden, ed. «Mikroelektronik in der DDR» (en alemán). Dresden. Consultado el 11 de mayo de 2020. \n↑ \n«Steal The Best». Molecular Expressions: The Silicon Zoo. 7 de julio de 1999. Consultado el 10 de mayo de 2020. \n↑ stackexchange (ed.). «Was there Cyrillic text visible on Intel 386 chips after decapping?». skeptics (en inglés). Consultado el 11 de mayo de 2020. \n↑ Nuno Cristovao (1 de diciembre de 2020). «Tesla Back to the Future Easter Egg» (en inglés). p. notateslaapp.com. Consultado el 17 de marzo de 2022. \n↑ P, Syp (1 de abril de 2019). «All 20 Tesla Easter Eggs Discovered so Far, and How to Find Them». Drive Tribe (en inglés). Archivado desde el original el 6 de abril de 2020. Consultado el 20 de marzo de 2020. \n↑ Lekach, Sasha (8 de febrero de 2019). «Tesla's fart mode is a real gem». mashable (en inglés). Consultado el 16 de abril de 2020. \n↑ \nLambert, Fred (12 de febrero de 2019). «Tesla hides extensive ‘Back to the Future’ Easter egg in latest software». Electrek. Consultado el 15 de abril de 2020. \n↑ \nLambert, Fred (6 de octubre de 2019). «Tesla owner finds Monty Python Easter egg in V10 software update». Electrek. Consultado el 15 de abril de 2020. \n↑ Ayre, James (30 de septiembre de 2015). «“These Go To 11” — Tesla, Spinal Tap, Christopher Guest, & Jamie Lee Curtis». ev obsession (en inglés). Consultado el 20 de marzo de 2020. \n↑ \nBrown, Mike (7 de febrero de 2018). «Elon Musk Jokes About Confused Aliens Finding His Tesla in Space». Inverse. Consultado el 15 de abril de 2020. \n↑ \nTracy, David (18 de diciembre de 2018). «The Tesla Model 3 'Superbottle' Easter Egg Is a Fascinating Packaging Solution». Jalopnik. Consultado el 15 de abril de 2020. \n↑ «Optimal source electric vehicle heat pump with extreme temperature heating capability and efficient thermal preconditioning» (en inglés). 7 de septiembre de 2018. Consultado el 12 de abril de 2020. \n↑ Lambert, Fred (23 de marzo de 2020). «Elon Musk: Tesla Model Y heat pump is some of the best engineering I’ve seen in a while».  En Electrek, ed. ElecTrek (en inglés). \n↑ Page, Trevor (17 de marzo de 2020). «Model Y's secret trick». Tesla Owners Online (en inglés). Archivado desde el original el 31 de marzo de 2022. Consultado el 12 de abril de 2020. \n↑ Third Row Tesla Podcast, ed. (15 de abril de 2020). «Third Row Tesla - Episode 14 - Tesla Manufacturing with Sandy Munro and Elon Musk!» (en inglés). Archivado desde el original el 19 de abril de 2020. Consultado el 17 de abril de 2020. ", "subsections": []}, {"name": "Enlaces externos", "text": "Sitio recopilatorio de huevos de Pascua virtuales (en inglés)\nEsta obra contiene una traducción  derivada de «Easter egg (media)» de Wikipedia en inglés, publicada por sus editores bajo la Licencia de documentación libre de GNU y la Licencia Creative Commons Atribución-CompartirIgual 4.0 Internacional", "subsections": []}]}
