{"url": "https://es.wikipedia.org/wiki/Codigo_fuente", "title": "Código fuente", "summary": "Busca fuentes: «Código fuente» – noticias · libros · académico · imágenes\nEl código fuente de un programa informático (o software) es un conjunto de líneas de texto con los pasos que debe seguir la computadora para ejecutar un cargador.[1]​\nEl código fuente de un programa está escrito por un programador en algún lenguaje de programación legible por humanos, normalmente en forma de texto plano.[2]​ Sin embargo, el programa escrito en un lenguaje legible por humanos no es directamente ejecutable por la computadora en su primer estado, sino que debe ser traducido a otro lenguaje o código binario; así será más fácil para la máquina interpretarlo  (lenguaje máquina o código objeto que sí pueda ser ejecutado por el hardware de la computadora). Para esta traducción se usan los llamados compiladores, ensambladores, intérpretes y otros sistemas de traducción.\nEl término código fuente también se usa para hacer referencia al código fuente de otros elementos del software, como, por ejemplo, el código fuente de una página web, que está escrito en lenguaje de marcado HTML o en Javascript, u otros lenguajes de programación web, y que es posteriormente ejecutado por el navegador web para visualizar dicha página cuando es visitada.\nEl área de la informática que se dedica a la creación de programas, y por tanto a la creación de su código fuente, es la ingeniería de software.", "sections": [{"name": "Licencias", "text": "Un aspecto interesante a tener en cuenta cuando se habla del código fuente de un programa informático es si su licencia permite que dicho código fuente esté disponible para que cualquiera pueda estudiarlo, modificarlo o reutilizarlo. Cuando se cumple este aspecto se dice que el programa es de código abierto y son, en general, software libre, en contraposición al software privativo sobre el cual no se tiene ninguno de estos permisos.", "subsections": []}, {"name": "Véase también", "text": "Software de código abierto\nLenguaje de programación", "subsections": []}, {"name": "Referencias", "text": "↑ «¿Qué es código fuente? - Tecnología Fácil». tecnologia-facil.com. Consultado el 9 de abril de 2021. \n↑ «El código fuente: ¿qué es y cómo se escribe?». IONOS Digitalguide. Consultado el 28 de febrero de 2022. ", "subsections": []}, {"name": "Enlaces externos", "text": "Source Code Definition by The Linux Information Project (LINFO).\n«Obligatory accreditation system for IT security products (2008-09-22), may start from may of 2009, reported by Yomiuri on 24 de abril, 2009.». MetaFilter.com. Consultado el 24 de abril de 2009. \nSame program written in multiple language", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Coloreado_de_sintaxis", "title": "Resaltado de sintaxis", "summary": "Busca fuentes: «Resaltado de sintaxis» – noticias · libros · académico · imágenes\nEl resaltado de sintaxis, a veces llamado coloreado de sintaxis, es una capacidad de algunas aplicaciones para tratamiento de textos (como los editores de texto), para diferenciar elementos de texto (especialmente el llamado código fuente) mediante diversos colores o estilos tipográficos, dependiendo de las categorías sintácticas de sus términos, conforme a las reglas de algún lenguaje formal concreto.\nEste resaltado se utiliza a modo de notación secundaria, habitualmente para mejorar la legibilidad del código fuente de programas o de textos escritos en algún lenguaje de marcado, permitiendo aumentar la productividad de los programadores. Los estilos aplicados por defecto dependen de cada programa informático, alguno de los cuales permiten configurar los estilos e incluso reconocer diversos lenguajes.\nLa interpretación del texto no varía en absoluto al resaltar sus elementos. Los cambios en la representación del texto cumplen una función visual identificativa y no semántica, sólo se usan para transmitir información al lector humano. Por tanto, en el caso del código fuente de un programa, los intérpretes y los compiladores lo ignoran. No forman parte ni del lenguaje formal en sí, ni del texto, por lo que tampoco se guardan en el fichero, sino que se analiza cada vez que se carga.", "sections": [{"name": "Ejemplo", "text": "Abajo se muestra una porción de código en lenguaje C:\n/* Hello World */\n#include\n \n<stdlib.h>\n<stdio.h>\nint\nmain\n()\n{\n    \nprintf\n(\n\"Hello World\n\\n\n\"\n);\nreturn\n0\n;\n}\nA veces, estos editores pueden resaltar las llaves, paréntesis y corchetes de forma que al posicionar el cursor sobre uno de ellos, se destacan los dos elementos, tanto el de apertura, como el de cierre —incluso con etiquetas HTML. Esto es de gran ayuda al escribir programas con gran número de anidamientos hechos con estos elementos.", "subsections": []}, {"name": "Programas con resaltado de sintaxis", "text": "Scintilla\nNotepad++\nNotepad2\nSciTE\nGeany\nVim\nEmacs\ngedit\nEl visor de código fuente de la mayoría de los navegadores web.", "subsections": []}, {"name": "Véase también", "text": "Editor de páginas web\nEditor de texto\nWYSIWYG\nWYSIWY", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Colt_Python", "title": "Colt Python", "summary": " \nEl Colt Python es un revólver calibre .357 que era fabricado por la empresa Colt Manufacturing Company de Hartford, Connecticut. A veces es mencionado como \"Magnum de combate\".[1]​ Fue introducido al mercado en 1955, el mismo año que el revólver Modelo 29 calibre 11 mm de Smith & Wesson. El ya descontinuado Colt Python iba dirigido al segmento del mercado de revólveres de lujo. Algunos coleccionistas de armas de fuego y escritores como Jeff Cooper, Ian V. Hogg, Chuck Hawks, Leroy Thompson, y Renée Smeets han descrito al Python como uno de los mejores revólveres jamás fabricados.[2]​[3]​[4]​[5]​[6]​[7]​[1]​", "sections": [{"name": "Descripción", "text": "El Colt Python es un revólver de doble acción calibrado para el potente cartucho .357 Magnum y que emplea el gran armazón \"I\" de Colt. Los Python son reconocidos por su precisión, disparador de recorrido suave y tambor que se cierra sólidamente.[2]​", "subsections": []}, {"name": "Historia", "text": "El Colt Python fue introducido por primera vez en 1955 como modelo de lujo de la línea Colt y originalmente iba a ser un revólver Target que dispararía el cartucho .38 Special con armazón grande.[3]​ Por lo tanto, tiene un alza y un punto de mira de precisión ajustables, un gatillo suave, construcción sólida y más piezas metálicas. Los Python tienen una apariencia característica debido al resalte que abarca toda la parte inferior del cañón, la banda ventilada de este y sus mecanismos de puntería ajustables.[3]​ Originalmente Colt fabricaba los Python con resaltes huecos, pero los dejó macizos para que funcionen como un contrapeso estabilizador del cañón. Cuando el revólver está amartillado, en el momento de presionar el gatillo, el tambor se mantiene fijo durante la duración del impacto del martillo. Otros revólveres tienen cierta soltura, incluso cuando están amartillados. El espacio entre el tambor y el cono de fuerza es muy estrecho, ayudando a incrementar la precisión y la velocidad.[2]​ El cañón de cada revólver Python fue revisado en la fábrica con un láser, siendo el primer revólver producido en serie en emplear este método.[3]​", "subsections": [{"name": "Cese de producción", "text": "En octubre de 1999, Colt Manufacturing Co. anunció el cese de producción de los revólveres Python. En una carta de disculpa dirigida a los distribuidores en 2000, la empresa indicaba como principales motivos del cese de la serie Python, así como de otros modelos, las cambiantes condiciones del mercado y los costos de los procesos judiciales.[8]​ La Colt Custom Gun Shop continuó haciendo un número limitado de Pythons bajo pedido hasta 2005, cuando incluso esta producción limitada cesó.[2]​"}]}, {"name": "Modelos y variantes", "text": "El Python estaba originalmente disponible en dos acabados: Pavonado y Níquel Brillante. El modelo Níquel Brillante fue descontinuado tras la introducción del modelo Ultimate Stainless con acabados satinado y pulido espejo más durables.[2]​ Los acabados de acero inoxidable y Pavonado fueron ofrecidos por Colt hasta el 2003 en el modelo Python Elite.\nLos Python estaban disponibles con cañones de 6,4 cm (2,5 pulgadas), 7,6 cm (3 pulgadas), 10 cm (4 pulgadas), 15 cm (6 pulgadas) y 20 cm (8 pulgadas).[2]​ El modelo de 15 cm fue el más popular en general y el modelo de 20 cm estaba destinado a la caza. Se puede coleccionar un revólver con cañón de 7,6 cm, aunque no es raro.[3]​\nEn 1980 se fabricó el modelo Python Hunter, con cañón de 20 cm y mira telescópica Leupold 2X instalada de fábrica.[9]​ El Python Hunter fue el primer paquete de revólver de cacería listo para emplear hecho por un importante productor de armas.[9]​ La mira telescópica fue montada sobre el cañón usando soportes Redfield y el revólver iba dentro de un maletín Haliburton.[9]​ Fue descontinuado en 1990 y se ofreció brevemente como un modelo Custom Shop después.[9]​ Un modelo de Python Target se hizo durante varios años solamente en calibre .38 Special, con acabados pavonado y níquel.\nLa Colt fabricó en pequeñas cantidades dos variantes del Python. El primero fue el Colt Boa de 1985, un revólver calibre.357 Magnum de producción limitada, hecho para la Horton Lew Distributing Company de Massachusetts. Tenía un cañón de Python acoplado a un armazón de Trooper Mk V. Se fabricaron 600 revólveres con cañones de 15 cm (6 pulgadas) y 600 revólveres con cañones de 10 cm (4 pulgadas), de los cuales 100 iban en pareja. Aunque visualmente se parece a un Python, es sustancialmente diferente en lo que a sus mecanismos respecta. El segundo fue el Colt Grizzly de acero inoxidable de 1994, otro revólver calibre.357 Magnum de producción limitada. Tenía un cañón de Python acoplado a un armazón de Colt King Cobra. Se fabicaron 500 revólveres de este modelo con cañones Magna-Ported de 15 cm (6 pulgadas) y tambores lisos sin estrías. El cañón con banda ventilada lleva grabada una huella de oso. Similar al Grizzly fue el Colt Kodiak, que era un Colt Anaconda con un cañón Magna-Ported y un tambor liso. Se fabricaron unos 2000 revólveres Kodiak.\nSegún R.L. Wilson, el historiador de la Colt, los revólveres Colt Python han sido coleccionados por Elvis Presley y varios reyes en el sentido tradicional: \"Su Majestad (SM) Hussein I de Jordania encargó un número limitado de revólveres Python, con cañones de 10 cm (4 pulgadas) y 15 cm (6 pulgadas), como regalos para sus amigos selectos. La caja de transporte y el cañón fueron grabados con el escudo de Su Majestad. El Python para el Rey Juan Carlos de España llevaba su nombre bañado en oro sobre la placa lateral. Entre otros destinatarios célebres figural: el Rey Khalid y el Príncipe Fahed (Arabia Saudita), el Rey Hassan (Marruecos), el jeque Zyed (Emiratos Árabes Unidos), el presidente Anwar Sadat (Egipto) y el presidente Hafez Assad (Siria).\"[4]​", "subsections": []}, {"name": "Uso", "text": "El Python inmediatamente hizo incursiones en el mercado policial cuando fue introducido, siendo popular entre los policías uniformados el modelo con cañón de 15 cm (6 pulgadas) y considerado como óptimo el modelo con cañón de 10 cm (4 pulgadas) para los policías de civil.[3]​ Sin embargo, desde entonces ha caído en desuso (junto a todos los demás revólveres) debido a que las cambiantes necesidades de las agencias policiales favorecieron la adopción de pistolas semiautomáticas. Cuando las agencias policiales se dieron cuenta de que las pistolas semiautomáticas de 9 mm disparaban un cartucho con características similares al .38 Special y tenían mayor capacidad de munición, empezaron a reemplazar sus revólveres por pistolas semiautomáticas y sus respectivas municiones.[10]​[11]​ Los revólveres Colt Python continúan siendo populares en el mercado de armas de segunda mano, a pesar de alcanzar altos precios.\nLa Patrulla del Estado de Colorado utilizó revólveres Python pavonados con cañones de 10 cm (4 pulgadas) hasta que los reemplazaron con pistolas semiautomáticas S&W calibre 10 mm.[12]​ La Patrulla del Estado de Georgia y la Patrulla de Carretera de Florida suministraron revólveres Python a sus oficiales.[12]​", "subsections": []}, {"name": "Críticas", "text": "El historiador oficial de la Colt, R.L. Wilson, describió al Colt Python como \"el Rolls-Royce de los revólveres Colt\"[4]​ y el historiador de las armas de fuego Ian V. Hogg lo llamaba \"el mejor revólver del mundo\".[7]​ Sin embargo, al revólver no le faltan detractores. La contraparte a la precisión del Colt Python es su tendencia a quedarse \"atrasado\" tras disparar continuamente.[13]​ Esto es cuando el tambor no queda exactamente alineado con el cono de fuerza de la recámara, por lo cual el tirador puede ser rociado con pólvora quemada cuando dispara el revólver o este no disparará al apretar el gatillo.[13]​ Cuando esto ocurre, el fijador del tambor necesita ser reajustado.[13]​\nMartin Dougherty indica que el peso del Python es una desventaja, ya que es bastante pesado para un revólver, oscilando entre 1,08 kg (2,4 libras) y 1,17 kg (2,6 libras), apenas un poco más ligero que el M29 calibre.44 Magnum (el revólver de \"Harry el Sucio\").[1]​", "subsections": []}, {"name": "Apariciones en televisión y videojuegos", "text": "Busca fuentes: «Colt Python» – noticias · libros · académico · imágenes\nEste revólver aparece cómo una de las armas más potentes del primer juego de la saga Resident Evil. Una variante del mismo aparece en el juego Call of Duty: Black Ops, como arma secundaria en donde puede ser equipado con una mira ACOG o cambiar el cañón por uno más corto. Aparece también en otros juegos destacados como Grand Theft Auto: Vice City, Grand Theft Auto: Vice City Stories y la saga Half-Life, siendo en cada uno de ellos un revólver muy potente, generalmente capaz de matar con un solo disparo. También aparece en la serie The Walking Dead, en la cual es el arma emblema y principal de Rick Grimes. En el videojuego de Naughty Dog: The Last of Us, es una de las armas principales en la supervivencia de los protagonistas, Joel y Ellie; otro juego también en el que aparece es en Dead Frontier como un arma no muy potente pero muy eficaz para los principiantes, Otra aparición de esta arma es en el juego de supervivencia de mundo abierto Rust (videojuego) como una pistola de alta eficacia.\nHay una película francesa de 1975 llamada Police Python 357 protagonizada por Yves Montand que porta un revólver de 6\" de esta marca y que es el protagonista secundario de la trama.", "subsections": []}, {"name": "Véase también", "text": "Colt Anaconda\nColt Diamondback", "subsections": []}, {"name": "Notas", "text": "↑ a b c Dougherty, Martin Small Arms: From the Civil War to the Present Day, New York City: Fall River Press, 2005, page 48. ISBN 978-0-7607-6329-2\n↑ a b c d e f The Colt Python.357 Magnum Revolver by Chuck Hawks at www.chuckhawks.com accessed Apr 27, 2009\n↑ a b c d e f Thompson, Leroy; Rene Smeets (1 de octubre de 1993). Great Combat Handguns: A Guide to Using, Collecting and Training With Handguns. London: Arms & Armour Publication. pp. 256. ISBN 9781854091680. \n↑ a b c Wilson, R.L., The Colt Heritage, New York City: Simon & Schuster, 1987, P. 272.\n↑ Wilson, R.L., Colt: An American Legend, New York City: Abbeville Press, 1985, P 272.\n↑ Cooper, Jeff, \"Cooper on Handguns,\" Los Angeles, Petersen Publishing Co., 1974, P. 189.\n↑ a b Hogg, Ian V. (1994)Military Small Arms: 300 Years of Soldiers' Firearms, Salamander Publishing\n↑ Update from Colt's Manufacturing Company, Inc. Archivado el 20 de febrero de 2007 en Wayback Machine.\n↑ a b c d Metcalf, Dick (1994). «Top 10 Hunt Guns». HandGunning (PJS Publications) 8 (5): 52-58. \n↑ Bailey, William G (1995). The Encyclopedia of Police Science. Taylor & Francis. p. 309 |página= y |páginas= redundantes (ayuda). ISBN 0815313314. \n↑ New York City Police to Replace Revolvers With Semiautomatics The New York Times, By CRAIG WOLFF, Saturday, August 21, 1993, Accessed April 27, 2009.\n↑ a b Ayoob, Massad(2003)The Colt Python, The Accurate Rifle Magazine, November 2003\n↑ a b c C&S Python.357MAG By Rich Grassi, Originally Published in Combat Handguns May 2005, accessed at Cylinder and Slide April 27, 2009", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una categoría multimedia sobre Colt Python.\nRevólver Colt Python (en inglés)\nManual de Instrucciones y Seguridad Oficial (.pdf en inglés)\nNúmeros de serie de los revólveres Colt Pytho", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Comentario_(inform%C3%A1tica)", "title": "Comentario (informática)", "summary": "rojo\nverde\nazul\nEn la programación de computadoras, un comentario es una construcción del lenguaje de programación[1]​ destinada a incrustar anotaciones legibles al programador en el código fuente de un Programa informático.[2]​ Estas anotaciones son potencialmente significativas para los programadores, pero usualmente ignorados por los compiladores e intérpretes.[3]​[4]​ Los comentarios son añadidos usualmente con el propósito de hacer el código fuente más fácil de entender con vistas a su mantenimiento o reutilización. La sintaxis y reglas para los comentarios varían y usualmente son definidas en la especificación del lenguaje de programación.\nSe ha de tener en cuenta que los comentarios necesitan mantenimiento igual que el código y, por tanto, que un comentario preciso y conciso es más fácil de mantener que uno largo, repetitivo y complicado.\nLos comentarios tienen una amplia gama de posibles usos: desde la mejora del código fuente con descripciones básicas hasta la generación de documentación externa. También se utilizan para la integración con sistemas de control de versiones y otros tipos de herramientas de programación externas.\nLa flexibilidad proporcionada por los comentarios da pie a un amplio abanico de formas de uso distintas y a la inclusión de información inútil dentro del código fuente. Para evitar este inconveniente, muchos programadores y analistas de software adoptan alguna de las \"filosofías\" o metodologías para la correcta utilización de los comentarios.", "sections": [{"name": "Información general", "text": "Los comentarios adoptan por norma general un formato o bien de \"bloque\" (también denominado de \"prólogo\") o bien de \"fin de línea\" (también denominado \"inline\").[5]​\nUn comentario de bloque delimita una zona del código fuente en la cual es permitido expandirse a varias líneas de texto. Esta región se reconoce por un delimitador de inicio y un delimitador de final del comentario. Algunos lenguajes de programación admiten que los comentarios se aniden recursivamente (e.g., MATLAB), pero otros lenguajes no lo admiten (e.g., Java).[6]​[7]​[8]​\nUn comentario de fin de línea comienza con un delimitador y continúa hasta el final de la línea de texto (es decir, no es necesario un segundo delimitador). En otros casos, el comentario de fin de línea comienza en una cierta columna dentro del código fuente no siendo necesario un delimitador.[8]​\nLos delimitadores son una secuencia conocida de caracteres y suelen ser distintos para los comentarios de bloque que para los de fin de línea. Por ejemplo, el lenguaje C++ usa, para los comentarios de bloque, los delimitadores /* y */ mientras que los comentarios de fin de línea utiliza el delimitador //. Otros lenguajes solamente admiten un tipo de comentario. Por ejemplo, ADA solamente dispone de comentarios de fin de línea mediante el delimitador --.[8]​", "subsections": []}, {"name": "Usos", "text": "La mejor manera de dar uso a los comentarios es objeto de controversia con posiciones a menudo enfrentadas.[9]​[10]​ Hay una gran variedad de formas de escribir comentarios y muchos comentaristas que ofrecen, en ocasiones, consejos contradictorios.[10]​", "subsections": [{"name": "Planificación / Revisión", "text": "Los comentarios se pueden utilizar como una forma de pseudocódigo para describir la intención antes de escribir el código real. En este caso se debe explicar la lógica detrás del código en lugar del código en sí mismo.\n/* itera hacia atrás por todos los elementos retornados por el servidor (estos deben ser procesados cronológicamente)*/\nfor\n \n(\ni\n=\nnumElementsReturned\n-\n1\n);\n>=\n0\n;\n--\n){\n    \n/* procesa los datos de cada elemento */\nupdatePattern\n,\nreturnedElements\n[\n]);\n}\nSi se deja este tipo de comentario luego de escribir el código, se simplifica el proceso de revisión al permitir la comparación directa del código con los resultados previstos. Una falacia lógica común es que el código fácil de entender hace lo que tiene que hacer."}, {"name": "Descripción de código", "text": "Los comentarios pueden ser utilizados para resumir el código o para explicar la intención del programador. Según esta escuela de pensamiento, re-explicar el código en lenguaje natural se considera superfluo y la necesidad de volver a explicar el código puede ser un signo de que es demasiado complejo y debe ser reescrito.\nLos comentarios también pueden ser utilizados para explicar por qué un bloque de código no se ajusta a las convenciones o las buenas prácticas. Esto está especialmente relacionado con proyectos de escaso tiempo de desarrollo, o en la corrección de errores. Por ejemplo:\n' Se asigna una segunda variable debido a que se producen errores \n' en el servidor cuando se reutilizan los datos del formulario. No se encontró documentación\n' sobre el comportamiento extraño del servidor, así que simplemente se codificó para resolverlo.\nvtx\nserver\n.\nmappath\n\"local settings\"\n)"}, {"name": "Descripción algorítmica", "text": "A veces, el código fuente contiene una solución nueva o digna de mencionarse a un problema específico. En tales casos, los comentarios pueden contener una explicación de la metodología. Estas explicaciones pueden incluir diagramas y pruebas matemáticas formales. Esto puede ser la explicación del código, en lugar de una clarificación de sus intenciones, pero otros encargados del mantenimiento del código pueden encontrar como fundamental esta explicación. Esto puede ser especialmente cierto en el caso de problemas de dominios de alta especialización; así como en optimizaciones, construcciones o llamadas a funciones de uso no cotidiano.[13]​\nPor ejemplo, un programador puede agregar un comentario para explicar por qué se eligió un Ordenamiento por inserción en lugar de quicksort, pues el primero es, en teoría, más lento que el segundo. Esto podría escribirse de la siguiente manera:\nlist\n[\nf\nb\n),\nc\nd\na\n...\n]\n// Se requiere un ordenamiento estable, mientras el desempeño realmente no importa.\ninsertion_sort"}, {"name": "Inclusión de recursos", "text": "Logotipos, diagramas y diagramas de flujo consistentes en construcciones de arte ASCII pueden ser insertados en el código fuente en forma de comentario.[14]​ Además, puede incrustarse como comentarios avisos de derechos de autor, fecha de creación, versión del producto, contacto con el propietario y/o creador, etc..\nEl fragmento de código que sigue es un simple diagrama ASCII que representa el flujo de proceso para un script de administración de sistemas contenido en un Fichero Windows Script que se ejecuta en Windows Script Host A pesar de que la sección que marca el código aparece como un comentario, el diagrama de hecho aparece en una sección XML CDATA sección, que técnicamente se considera distinta de los comentarios, pero que puede servir para propósitos similares.[15]​\n<!-- begin: wsf_resource_nodes -->\n<resource\nid=\n\"ProcessDiagram000\"\n>\n<![CDATA[\n HostApp (Main_process)\n    |\n    V\nscript.wsf (app_cmd) --> ClientApp (async_run, batch_process)\n                |\n                V\n         mru.ini (mru_history)   \n]]>\n</resource>\nAun cuando este diagrama fácilmente podría haber sido incluido como un comentario, el ejemplo ilustra un caso en que el programador puede optar por no utilizar los comentarios, como una forma de incluir recursos en el código fuente.[15]​"}, {"name": "Depuración", "text": "Una práctica común entre programadores es comentar un fragmento de código, es decir, agregar delimitadores de modo que un bloque de código se convierta en un comentario, y por tanto no se ejecutará en el programa final. Esto podría hacerse para excluir algunas piezas del código del programa o, de manera más común, para encontrar la causa de un error. Comentando sistemáticamente y ejecutando partes del programa, la causa del error puede ser determinada, permitiendo su corrección. A continuación un ejemplo de cómo comentar código con el propósito de excluirlo:\nif\nopt\nequals\n\"e\"\n))\n   \nopt_enabled\ntrue\n/*\n  if (opt.equals (\"d\"))\n   opt_debug = true;\n // */\n//*\n\"v\"\nopt_verbose\n// */\nEl fragmento de código de arriba sugiere que el programador optó por desactivar la opción de depuración por alguna razón. Este estilo específico de comentario es más adecuado para la depuración. Un carácter de barra simple delante del delimitador de apertura es el que permite habilitar o deshabilitar el comentarios de bloque completo.\nMuchos EIDs permiten agregar o remover rápidamente este tipo de comentarios con opciones del menú singulares o atajos del teclado. El programador solamente debe marcar la parte de texto que desea comentar o descomentar y elegir la opción apropiada. Esto es particularmente útil con fragmentos grandes de código."}, {"name": "Generación de documentación", "text": "Artículo principal:\nLas herramientas de programación en ocasiones incorporan documentación y metadatos en los comentarios.[16]​ Estas pueden incluir las posiciones de inserción para la inclusión automática de archivos de cabecera, comandos para configurar el modo de resaltado de sintaxis[17]​ o el número de revisión del archivo.[18]​ Estos comentarios de control funcional son también conocidos comúnmente como anotaciones. Mantener la documentación dentro de comentarios en el código fuente es considerado como una forma de simplificar el proceso de documentación, así como un aumento en las posibilidades de que la documentación se mantendrá al día con los cambios en el código.[19]​ Habitualmente este tipos de comentarios requiere utilizar una sintaxis básica para que puedan ser interpretados por el generador de documentación a diferencia de los comentarios anteriores donde no necesariamente se debe de utilizar una sintaxis predefinida.\nEjemplos de generadores de documentación son el programa javadoc, diseñado para ser utilizado con el lenguaje de programación Java, Ddoc para el lenguaje de  programación D y doxygen, para ser usado con C/C++, Java IDL y PHPDoc para PHP.\nC#, F# e implementan una característica similar llamada comentarios XML, que son leídos por IntelliSense para los ensamblados compilados del entorno.NET.[20]​"}]}, {"name": "Estilos", "text": "Hay muchas alternativas cuando se considera como los comentarios deben aparecer en el código fuente. Para grandes proyectos, los estilos de los comentarios se agregan apenas comienzan el proyecto. Normalmente los programadores prefieren estilos que son consistentes, no obstructivos, fáciles de modificar, y difíciles de romper.\nLos siguientes fragmentos de código en C son solo un ejemplo de como los comentarios pueden variar de estilo, mientras todos contienen la misma información básica:\n/* \n     Este es el cuerpo del comentario.\n     Variante 1\n*/\n/***********************************\\\n* *\n* Este es el cuerpo del comentario. *\n* Variante 2. *\n\\************************************/\nFactores tales como la preferencia personal, la flexibilidad de las herramientas de programación, y otras consideraciones tienden a influir en las variantes de estilo utilizado en el código fuente.", "subsections": [{"name": "Etiquetas", "text": "Algunas etiquetas se utilizan en los comentarios para ayudar en la indexación de los problemas comunes. Tales etiquetas son comúnmente resaltado de sintaxis y permite búsquedas con herramientas de programación común, como la utilidad grep de UNIX. Ejemplos de convenios etiqueta son:\nFIXME: para marcar código problemático potencial que requiere una atención especial y/o revisión.\nNOTE: peligros potenciales para documentar el funcionamiento interno del código y de indicar.\nTODO: para indicar las mejoras planificadas.\nXXX: para advertir a otros programadores de código problemático o equivoco.\nExiste el riesgo de que las etiquetas se acumulan con el tiempo, es conveniente incluir la fecha y el propietario de etiqueta en el comentario de etiquetas para facilitar el seguimiento."}]}, {"name": "Curiosidades", "text": "Whitespace es un lenguaje de programación esotérico en el cual la sintaxis consiste únicamente en espacios en blanco, tabulador y líneas nuevas, cualquier otro carácter es ignorado, por lo que en este lenguaje cualquier escrito es un comentario.", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": [{"name": "Ensamblador", "text": ";comentario"}, {"name": "Java", "text": "//comentario de línea\nQue la línea son instrumentos que utilizamos en una variante de series\n/*comentario \n de bloque*/\n/**\n comentario que será usado por javadoc\n */"}, {"name": "Delphi", "text": "  \n//comentario en línea\n{ comentario \n  en bloque }\n(* comentario \n  en bloque *)\nEn delphi se pueden anidar comentarios de bloque siempre que no usen el mismo delimitador, e.g.\n(* \n    comentario en bloque\n    { \n      que contiene otros\n      comentarios en bloque \n    }\n    // o de fin de línea\n    y que es perfectamente \n    válido\n  *)"}, {"name": "Lua", "text": "-- Un comentario de línea\n--[[\n     Un comentario de bloque\n ]]\n--"}, {"name": "Ruby", "text": "#comentario\nbegin\ncomentario\nde\nbloque\nend"}, {"name": "Python", "text": "\"\"\"\n comentario\n en bloque\n \"\"\""}, {"name": "Perl", "text": ""}, {"name": "Javascript", "text": "/* comentario\n en bloque */"}, {"name": "código HTML", "text": "En las páginas webs .html se introduce el comentario entre  <!--   --> .\n<!--\n   esto es un comentario en código HTML \n  // -->"}, {"name": "SQL", "text": "//\nesto\nes\nun\n--este también\n/* y este"}, {"name": "Visual Basic", "text": "'comentario\n'''comentario XML"}, {"name": "Pascal", "text": "' Comentario"}, {"name": "PHP", "text": "#este también"}, {"name": "Cobol", "text": " * Com\nentario"}]}, {"name": "Referencias", "text": "↑ Para los propósitos de este artículo, los comentarios de un lenguaje de programación son tratados indistintamente de comentarios que aparecen en lenguajes de marcas, archivos de configuración u otros contextos similares. Más aún, los lenguajes de marcas con frecuencia se relacionan de manera cercana con código de lenguajes de programación, especialmente en el contexto de generación de código. Ver por ejemplo Ganguli, Madhushree (2002). Making Use of Jsp (en inglés). Nueva York: Wiley. ISBN 0471219746. , Hewitt, Eben (2003). Java for Coldfusion Developers (en inglés). Upper Saddle River: Pearson Education. ISBN 0130461806. \n↑ Source code can be divided into program code (which consists of machine-translatable instructions); and comments (which include human-readable notes and other kinds of annotations in support of the program code).Penny Grubb, Armstrong Takang (2003). Software Maintenance: Concepts and Practice (en inglés). World Scientific. pp. 7, 120–121. ISBN 981238426X. \n↑ Algunos entornos de programación incluyen los comentarios como uno de los elementos de la sintaxis del lenguaje que son retenidos para procesamiento posterior, en lugar de ser descartados una vez han sido reconocidos por el procesador de lenguaje.\n↑ Los comentarios deben ser indicados de tal manera que sea posible para el procesador de código fuente reconocerlos como tal. Esto es usualmente simplificado al decir que los comentarios son \"ignorados\" (luego de ser reconocidos y desechados) por el procesador.\n↑ Dixit, J.B. (2003). Computer Fundamentals and Programming in C (en inglés). Laxmi Publications. ISBN 8170088828. \n↑ Desmond, Higham (2005). MATLAB Guide (en inglés). SIAM. ISBN 0898715784. \n↑ Vermeulen, Al (2000). The Elements of Java Style (en inglés). Cambridge University Press. ISBN 0521777682. \n↑ a b c «Using the right comment in Java» (en inglés). Consultado el 24 de julio de 2007. \n↑ W. R., Dietrich (2003). Applied Pattern Recognition: Algorithms and Implementation in C++ (en inglés). Springer. p. 66. ISBN 3528355581.  ofrece puntos de vista sobre el uso adecuado de comentarios en el código fuente\n↑ a b Keyes, Jessica (2003). Software Engineering Handbook (en inglés). CRC Press. p. 256. ISBN 0849314798.  discute los comentarios y la ciencia de la documentación\n↑ The Elements of Programming Style, Kernighan & Plauger\n↑ Code Complete, McConnell\n↑ Spinellis, Diomidis (2003). Code reading: The Open Source Perspective (en inglés). Addison-Wesley. ISBN 0201799405. \n↑ «CodePlotter 1.6 - Add and edit diagrams in your code with this 'Visio-like' tool». Archivado desde el original el 14 de julio de 2007. Consultado el 24 de julio de 2007. \n↑ a b Niederst, Jennifer (2006). Web Design in a Nutshell: A Desktop Quick Reference (en inglés). O'Reilly. ISBN 0596009879. En ocasiones la diferencia entre un \"comentario\" y otros elementos de la sintaxis de un lenguaje de programación o de marcas implica matices sutiles. Niederst indica una situación tal al decir: \"Unfortunately, XML software thinks of comments as unimportant information and may simply remove the comments from a document before processing it. To avoid this problem, use an XML CDATA section instead.\"\n↑ Véase e.g., Wynne-Powell, Rod (2008). Mac Os X for Photographers: Optimized Image Workflow for the Mac User (en inglés). Oxford: Focal Press. p. 243. ISBN 0240520270. \n↑ Lamb, Linda (1998). Learning the VI Editor (en inglés). Sebastopol: O'Reilly & Associates. ISBN 1565924266.  describe el uso de sintaxis modeline en los archivos de configuración de Vim\n↑ Ver e.g., Berlin, Daniel (2006). Practical Subversion, Second Edition (en inglés). Berkeley: APress. p. 168. ISBN 1590597532. \n↑ Ambler, Scott (2004). The Object Primer: Agile Model-Driven Development with UML 2.0 (en inglés). Cambridge University Press. ISBN 1397805218. \n↑ Murach. C# 2005. p. 56. ", "subsections": []}, {"name": "Enlaces externos", "text": "13 consejos para comentar tu código\nComo escribir comentarios (en inglés", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Compilaci%C3%B3n_en_tiempo_de_ejecuci%C3%B3n", "title": "Compilación en tiempo de ejecución", "summary": "Busca fuentes: «Compilación en tiempo de ejecución» – noticias · libros · académico · imágenes\nEn informática, la compilación en tiempo de ejecución (también conocida por sus siglas inglesas, JIT, just-in-time), también conocida como traducción dinámica, es una técnica para mejorar el rendimiento de sistemas de programación que compilan a bytecode, consistente en traducir el bytecode a  código máquina nativo en tiempo de ejecución. La compilación en tiempo de ejecución se construye a partir de dos ideas anteriores relacionadas con los entornos de ejecución: la compilación a bytecode y la compilación dinámica.\nEn un sistema que use interpretación de bytecode como por ejemplo Smalltalk, Perl, GNU CLISP o las primeras versiones de Java, el código fuente es traducido a un código intermedio llamado bytecode. El bytecode no es el código máquina de ninguna computadora en particular, y puede por tanto ser portable entre diferentes arquitecturas. El bytecode es entonces interpretado, o ejecutado por una máquina virtual.\nUn entorno con compilación dinámica es aquel en el que el compilador puede ser usado durante la ejecución. Por ejemplo, la mayoría de los sistemas Commons Lisp tienen una función compile que permite compilar nuevas funciones creadas durante la ejecución del programa. Aunque ventajoso en la depuración interactiva, la compilación dinámica es menos útil en un sistema en explotación desatendido. Ese método es más común en emuladores modernos y frecuentemente comerciales que requieren mucha velocidad, como el Qemu y el VirtualPC (PC) o el Executor (Macintosh 68k).\nEn un entorno de compilación en tiempo de ejecución, la compilación a bytecode es el primer paso, reduciendo el código fuente a una representación intermedia portable y optimizable. El bytecode se despliega en el sistema de destino. Cuando dicho código se ejecuta, el compilador en tiempo de ejecución lo traduce a código máquina nativo. Esto puede realizarse a nivel de fichero (programa) o de funciones, compilándose en este último caso el código correspondiente a una función justo cuando va a ejecutarse (de aquí el nombre de just-in-time, «justo a tiempo»).\nEl objetivo es combinar muchas de las ventajas de la compilación a código nativo y a bytecode: la mayoría del «trabajo pesado» de procesar el código fuente original y realizar optimizaciones básicas se realiza en el momento de compilar a bytecode, mucho antes del despliegue: así, la compilación a código máquina del programa resulta mucho más rápida que partiendo del código fuente. El bytecode desplegado es portable, a diferencia del código máquina para cualquier arquitectura concreta. Los compiladores dinámicos son más fáciles de escribir, pues el compilador a bytecode ya realiza buena parte del trabajo.\n7", "sections": [{"name": "Uso de compilación JIT en emuladores", "text": "Al momento de emular la CPU, el programa traduce el código máquina del software[1]​ emulado en código nativo de la máquina emuladora y lo escribe en una caché con permisos de ejecución y escritura (generalmente en UNIX o en sistemas compatibles con POSIX se asigna este permiso con la función mprotect()). La traducción se detiene cuando se encuentra cualquier instrucción que provoque un cambio en el contador de programa, como una interrupción, una instrucción de salto o una llamada a subrutina y es interpretado como un retorno de rutina al compilador o a otras tareas del programa. Luego el emulador ejecuta el código contenido en la caché.\nLa ventaja de este método es que si el tamaño de la caché es grande, el emulador no necesita recompilar el código, lo que aumenta mucho la velocidad. Sin embargo, surgen problemas cuando el programa emulado escribe su código, y es necesario volver a recompilar dicho código, a menos que el código emulado tenga permisos de solo lectura, por ejemplo, en sistemas UNIX con memoria protegida.", "subsections": []}, {"name": "Referencias", "text": "↑ ASALE, RAE-. «software | Diccionario de la lengua española». «Diccionario de la lengua española» - Edición del Tricentenario. Consultado el 14 de noviembre de 2022. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Conteo_de_referencias", "title": "Conteo de referencias", "summary": "Conteo de referencias, en inglés Reference counting, es una técnica para contabilizar las veces que un determinado recurso está siendo referido. Por lo general ese recurso son bloques de memoria y la técnica permite establecer cuando no existe ninguna referencia a ese bloque y este puede ser liberado. Es una técnica de muy fácil implementación, pero tiene una importante desventaja: Si las referencias forman un ciclo los objetos involucrados no se liberarán nunca. Otra técnica más efectiva es el uso de un recolector de basura.", "sections": [{"name": "Véase también", "text": "Recolector de basura\nFuga de memoria\nConteo de referencia automátic", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/CubicWeb", "title": "CubicWeb", "summary": "CubicWeb es un framework de código abierto para el desarrollo de aplicaciones con funciones integradas de web semántica, escrito en Python. El framework está formado por componentes (clases programadas en Python) llamados cubos, que pueden ser reutilizados para construir sistemas más complejos. CubicWeb sigue los principios de la programación orientada objetos.\nSe viene desarrollando desde 2000 pero es hasta 2008 cuando la empresa Logilab decide liberar el código bajo una licencia LGPL.", "sections": [{"name": "Características principales", "text": "CubicWeb se utilizó principalmente para sistemas internos de organismos y empresas europeas, antes de pasar a ser sistema libre.\nAlgunas aplicaciones de CubicWeb rebasan las 100,000 visitas diarias.[1]​ y es la aplicación seleccionada para administrar la interfaz de datos semántica de la Biblioteca Nacional de Francia. \nSus características principales son:\nUn motor que permite generar el sitio guiado por un modelo de datos propio a la applicación\nUn Lenguaje de consulta RQL similar a SPARQL del W3C (este último en proceso de integración)[2]​\nUn mecanismo para seleccionar y generar vistas con formato  XHTML, XML, JSON o texto\nUna biblioteca de componentes (modelos de datos y vistas) genéricos\nLa utilización del lenguaje de programación python\nIntegración de bases de datos SQL, directorios LDAP y como gestión de código Subversion y Mercurial.\nIntegrado con el cubo OrbUI, CubicWeb utiliza HTML5, CSS3 y el framework flexible de Bootstrap.", "subsections": []}, {"name": "Soporte de bases de datos", "text": "CubicWeb es un sistema multi base de datos. Funciona principalmente con PostgreSQL y MySQL.", "subsections": []}, {"name": "Premios", "text": "CubicWeb fue recompensado en febrero de 2013, concurso DataConnexions del gobierno de Francia en la categoría \"Utilidad Pública\".\nPremio Stanford para la Innovación en Investigación Bibliotecaria SPRIL, para la Biblioteca Nacional De Francia, Proyecto Discovery del sitio data.bnf.fr construido en CubicWeb.[3]​", "subsections": []}, {"name": "Véase también", "text": "Sesame\nJena\nMercurial\nDjango\nPython\nOrbUI", "subsections": []}, {"name": "Ejemplos de sitios públicos realizados con CubicWeb", "text": "Estos son algunos de los sitios que utilizan CubicWeb,\nhttp://www.logilab.org\nhttps://web.archive.org/web/20081214082405/http://www.musees-haute-normandie.fr/collections/\nhttp://www.118000.fr\nhttp://data.bnf.fr\nhttps://web.archive.org/web/20170421211315/http://zemantica.com/", "subsections": []}, {"name": "Enlaces externos", "text": "CubicWeb\nRepositorio del código libre de la empresa Logilab\nSitio de Python\nProyecto para incluir HTML5 y diseño flexible a CubicWeb", "subsections": []}, {"name": "Referencias", "text": "↑  Telegate . Anuario Francés realizado con Cubiweb\n↑  VanRees, Reinout . Semantic applications with CubicWeb\n↑ Stanford SPIRL Premio Stanford (SPIRL) 2013 para Discovery BNF, construido en CubicWeb", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Cython", "title": "Cython", "summary": "Cython es un lenguaje de programación para simplificar la escritura de módulos de extensión para Python en C y C++. Siendo estrictos, la sintaxis de Cython es la misma de Python pero con algunos agregados:\nSe pueden llamar funciones en C, o funciones/métodos de C++, directamente desde el código en Cython.\nEs posible usar tipos estáticos en las variables (enteros, flotantes, o cualquier tipo de dato).\nCython compila a código en C o C++ desde Python, y el resultado puede ser usado desde Python como un \"Modulo de extensión\", o como una aplicación embebida en el intérprete CPython.", "sections": [{"name": "Historia", "text": "Cython es un proyecto derivado de Pyrex, pero implementa más funcionalidades y optimizaciones que este.[1]​\nLos archivos Cython tienen una extensión .pyx. En su forma más básica, el código Cython se ve exactamente como el código Python.[2]​[3]​ Sin embargo, mientras que Python estándar se escribe dinámicamente, en Cython, los tipos se pueden proporcionar opcionalmente, lo que permite un rendimiento mejorado, permitiendo que los bucles se conviertan en bucles C siempre que sea posible. Por ejemplo:[4]​\ndef\nprimes\n(\nint\nkmax\n):\n# The argument will be converted to int or raise a TypeError.\ncdef\nint\nn\n,\nk\ni\n# These variables are declared with C types.\np\nAnother\nC\ntype\nresult\n=\n[]\n# A Python type\nif\n>\n1000\n:\nk\n0\nn\n2\nwhile\n<\ni\nand\n%\np\n[\n]\n!=\n+\n1\n==\n.\nappend\n)\nreturn", "subsections": []}, {"name": "Ventajas", "text": "La ventaja esencial de este enfoque, es que al entremezclar perfectamente código Python/C (es decir, C usando <python.h>) es que el código Python existente se puede ajustar a casi la velocidad de C con solo añadir unos pocos tipos estáticos a las declaraciones y haciendo algunas adaptaciones en los bucles críticos -sin necesidad de una interfaz complicada o muy invasiva del código. La velocidad de codificación y la legibilidad del código sigue siendo bastante similar a la que se tiene usando Python.\nDebido a reducción del consumo general en las estructuras de control (especialmente los bucles), las optimizaciones optimistas y la (limitada) inferencia de tipos, el código Python compilado con Cython normalmente se ejecuta más rápido que en el intérprete CPython 2.6.x, aunque las mejoras absolutas dependen en gran medida del código. Con las declaraciones de tipos estáticos, la aceleración típica en cálculos numéricos/matriciales es de 100x-1000x[5]​ En comparación a la típica optimización con Psyco (Python JIT compiler) qué es entre 4x-100x.[6]​", "subsections": []}, {"name": "Compatibilidad", "text": "Cython está escrito en Python, así que trabaja en Windows, Linux, y MacOS X.", "subsections": []}, {"name": "Usos", "text": "SageMath, un sistema de álgebra computacional está parcialmente escrito en Cython.", "subsections": []}, {"name": "Referencias", "text": "↑ Differences between Cython and Pyrex Archivado el 25 de julio de 2011 en Wayback Machine.\n↑ «Differences between Cython and Pyrex». \n↑ Ewing, Greg (21 de marzo de 2011). «Re: VM and Language summit info for those not at Pycon (and those that are!)» (Message to the electronic mailing-list python-dev). Consultado el 5 de mayo de 2011. \n↑ Zed Shaw (2017). Learn Python the hard way. Addison-Wesley Professional. ISBN 978-0134692883. Archivado desde el original el 6 de septiembre de 2021. Consultado el 22 de octubre de 2021. \n↑ «gmane.comp.python.cython.devel - Passing a pointer from Python». Archivado desde el original el 14 de febrero de 2017. Consultado el 3 de mayo de 2011. \n↑ Psyco - Introduction", "subsections": []}, {"name": "Páginas externas", "text": "Sitio web oficia", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/DARPA", "title": "Agencia de Proyectos de Investigación Avanzados de Defensa", "summary": "Sitio web oficial\nLa Agencia de Proyectos de Investigación Avanzados de Defensa, más conocida por su acrónimo DARPA, proveniente de su nombre original en inglés Defense Advanced Research Projects Agency, es una agencia del Departamento de Defensa de Estados Unidos responsable del desarrollo de nuevas tecnologías para uso militar. Fue creada en 1958 como consecuencia tecnológica de la llamada Guerra Fría y de la que surgieron los fundamentos de ARPANET, red que dio origen a Internet.\nLa agencia, denominada en su origen simplemente como ARPA, cambió su denominación en 1972, conociéndose en lo sucesivo como DARPA, por sus siglas en inglés. DARPA fue responsable de dar fondos para desarrollar muchas tecnologías que han tenido un gran impacto en el mundo: satélites, robots, redes de ordenadores (empezando con ARPANET, que después se desarrolló como Internet), así como NLS, el cual fue tanto un sistema de hipertexto como un precursor de la interfaz gráfica de usuario contemporánea.\nLa Agencia, bajo control del Departamento de Defensa se organizará en forma independiente de la comunidad de investigación y desarrollo militar. Su misión durante las próximas décadas la llevará a desarrollar y proveer aplicaciones tecnológicas no convencionales para la defensa de Estados Unidos ampliando la frontera tecnológica a favor de una organización reducida en número, pero flexible, libre de condicionamientos y dotada de científicos de élite. A.R.P.A. será la responsable de una gran parte de la investigación en ordenadores y comunicaciones de carácter innovador en EE. UU. durante los próximos años.\nSu nombre original fue simplemente Agencia de Investigación de Proyectos Avanzados pero se renombró a DARPA (por Defensa) el 23 de marzo de 1972, volvió a cambiarse a ARPA el 22 de febrero de 1993 y otra vez a DARPA el 11 de marzo de 1996.\nDARPA fue creado en 1958 en respuesta al lanzamiento soviético del Sputnik, con la misión de mantener a la tecnología de Estados Unidos en la carrera militar por delante de la de sus enemigos. Es independiente de otras agencias más convencionales de I+D y reporta directamente al consejo del Departamento de Defensa. DARPA tiene alrededor de 240 trabajadores, los cuales manejan un presupuesto de unos 3000 millones de dólares —2800 en 2012.[1]​ Estos datos son solo promedios, puesto que DARPA está enfocado en proyectos de corto plazo (de dos a cuatro años) llevados a cabo por equipos pequeños y constituidos expresamente para dichos proyectos.", "sections": [{"name": "Espionaje", "text": "DARPA fundó en enero de 2002 la Oficina de Información y Conocimiento (Information Awareness Office IAO por sus siglas en inglés) sin embargo dicha acción no tuvo una buena acogida alrededor del mundo, ya que sus actividades son criticadas duramente por incluir el acceso y búsqueda de información personal de cualquier ciudadano y sin necesidad de una orden judicial.\nEsto se logró mediante la creación de enormes bases de datos informáticas para recoger y almacenar la información personal de cada uno en los Estados Unidos, incluyendo correos electrónicos personales, redes sociales, registros de tarjetas de crédito, llamadas telefónicas, registros médicos, y numerosas otras fuentes, sin ningún requisito para una orden de registro.", "subsections": []}, {"name": "Misión de DARPA", "text": "Según su propia presentación:[2]​\nLas necesidades en tiempo inmediato y los requerimientos conducen en general a que el Ejército, la Armada, el Cuerpo de Marines y la Fuerza Aérea se enfoquen en aquellas necesidades que les reporten el mayor beneficio. En consecuencia, una extensa organización como el Departamento de Defensa necesita un lugar como DARPA cuyo único estatuto sea la innovación radical.\nDARPA parece ir más allá de necesidades y requerimientos que se conocen hoy en día. Tal como lo han notado los historiadores militares: “el desarrollo inicial de ninguna de las armas más importantes que han transformado la guerra en el siglo XX –el avión, el tanque, el radar, el motor de propulsión a chorro, el helicóptero, el computador electrónico, ni siquiera la bomba atómica– se puede atribuir a un requisito doctrinal o a petición de la milicia.” Y DARPA podría añadir a esta lista los sistemas no tripulados, el Sistema de Posicionamiento Global (GPS por sus siglas en inglés) y tecnologías para Internet.", "subsections": []}, {"name": "Historia", "text": "DARPA fue creada como la Agencia de Proyectos Avanzados de Investigación (ARPA, en inglés), mediante la Ley Pública 85-325 y la directiva del Departamento de Defensa 5105.41, en febrero de 1958. Su creación estuvo directamente atribuida al lanzamiento del Sputnik y al hecho de que los EE. UU se dieron cuenta de que la Unión Soviética había desarrollado la capacidad de explotar tecnología militar de forma rápida. Adicionalmente, las comunidades políticas y de defensa reconocieron la necesidad de una organización de alto nivel del Departamento de Defensa que formule y ejecute proyectos de I+D que expandieran las fronteras de la tecnología más allá de los requerimientos inmediatos y específicos de los servicios militares y de sus laboratorios. En búsqueda de esta misión, DARPA ha desarrollado y transferido programas de tecnología que abarcan una gran variedad de disciplinas científicas, los cuales están dirigidos al espectro completo de necesidades de seguridad nacional.\nDe 1958 a 1967, el énfasis de ARPA estuvo concentrado en problemas importantes de nivel nacional, como investigación aeroespacial, defensa contra misiles balísticos, y detección de pruebas nucleares. En 1960, todos los programas espaciales de carácter civil fueron transferidos a la NASA, y aquellos de carácter militar se transfirieron a servicios individuales. Esto permitió que DARPA concentrara sus esfuerzos en el DEFENDER (acrónimo de defensa contra misiles balísticos), el Proyecto Vela (detección de pruebas nucleares), y los Programas AGILE (I+D antiinsurgente); y empezaran a trabajar en procesamiento computacional, ciencias del comportamiento y ciencias materiales. Los programas DEFENDER y AGILE conformaron la I+D en DARPA en campos de detección, vigilancia y energía dirigida; particularmente en el estudio de radares, detección infrarroja y de rayos X y gamma.\nA finales de la década de 1960, con la transferencia de estos programas ya maduros a los Servicios, ARPA redefinió su papel y se concentró en un conjunto diverso de programas de investigación relativamente pequeños y esencialmente exploratorios. La agencia fue renombrada en 1972 como la Agencia de Proyectos Avanzados de Investigación en Defensa (DARPA en inglés), y a principios de los 70, se enfatizó en programas de energía directa, procesamiento de información y tecnología táctica.\nEn el área de procesamiento de información, DARPA dio grandes pasos, inicialmente a través del desarrollo de sistemas de tiempo compartido (todos los sistemas operativos modernos son descendientes del sistema Multics, que fue resultado del trabajo iniciado por DARPA en esta área), y posteriormente a través de la evolución de la ARPANET (red de telecomunicaciones precursora de Internet), e investigación de inteligencia artificial en campos como reconocimiento del habla y procesamiento de señales. DARPA también fundó el desarrollo del sistema de computación NLS por Douglas Engelbart y del Aspen Movie Map, el cual fue probablemente el primer sistema hipermedia y un importante precursor de la realidad virtual.\nLa polémica Enmienda Mansfield de 1973 limitó expresamente las asignaciones para investigación en defensa (a través de ARPA/DARPA) únicamente a proyectos que tuvieran aplicación militar directa. Algunos sostenían que la enmienda dejó devastada a la ciencia estadounidense, puesto que ARPA/DARPA en esa época fue una importante fuente de recursos para proyectos de ciencia básica; la National Science Foundation nunca asumió esta carencia de la forma que se esperaba. Pero la fuga de cerebros resultante fue también atribuida al estímulo que hubo al desarrollo de la naciente industria de computadores personales. Muchos jóvenes científicos de la computación migraron de las universidades a recién fundados laboratorios de investigación privados como el Xerox PARC.\nDe 1976 a 1981, predominaban proyectos de tecnología aérea, terrestre, marítima y espacial, tales como ataque a fuerzas de continuación con armas a distancia y Comando, Control, y Comunicaciones asociados; armamento táctico y programas antiarmamento; detección infrarroja para vigilancia espacial; tecnología de láser de alta energía para defensa espacial antimisiles; guerra antisubmarina; misiles de cruceros avanzados; aeronaves avanzadas; y aplicaciones de computación avanzada en defensa. Estas demostraciones de programas tecnológicos a gran escala iban en conjunto con investigación de circuitos integrados, que dio como resultado tecnología electrónica de escala ultrafina y dispositivos electrónicos que evolucionaron al programa VLSI y al programa de rayo de partículas, este último encargado por el congreso de Estados Unidos Muchos de los programas más exitosos fueron transformados a servicios, tales como las tecnologías de base en reconocimiento automático de objetivo, teledetección espacial, propulsión y materiales que fueron transferidas a la Organización de Iniciativas Estratégicas de Defensa (SDIO en inglés), ahora conocida como la Organización de Defensa de Misiles Balísticos (BMDO).\nDurante los años 80, la atención de la agencia se centró en procesamiento de información y programas relacionados con desarrollo de aeroplanos, que incluyen el Avión Aeroespacial Nacional (NASP) o el Programa de Investigación Hipersónica. El Programa de Computación Estratégica permitió a DARPA explotar tecnologías avanzadas de procesamiento y de redes, y reconstruir y fortalecer las relaciones con las universidades después de la guerra de Vietnam. Además, DARPA empezó a buscar nuevos conceptos para satélites pequeños y ligeros (LIGHTSAT) y dirigió nuevos programas relacionados con manufactura de defensa, tecnología de submarinos y armamento/antiarmamento.\nAlgunos rumores dicen que en los 70 el Pentágono financió un proyecto para relacionar ciertos gráficos de ondas cerebrales con ciertos pensamientos con el fin de que fuera posible a través de un equipo leer los pensamientos de una persona a cierta distancia esto se ocuparía con fines de defensa según los dichos de Robert Stone.", "subsections": []}, {"name": "Organización actual", "text": "DARPA tiene ocho oficinas de programa, las cuales dan informe al director de DARPA, Dr. Stefanie Tompkins:\nLa Oficina de Tecnología Avanzada (ATO) investiga, demuestra y desarrolla proyectos de gran factura en áreas de telecomunicaciones, marítima, operaciones especiales, comando y control, aseguramiento de información y misiones de supervivencia.\nLa Oficina de Ciencias de la Defensa (DSO) busca las tecnologías más novedosas dentro de un amplio espectro de comunidades de investigación científica y de ingeniería, y desarrolla estas tecnologías en nuevas capacidades militares importantes y radicalmente nuevas.\nLa Oficina de Tecnología en Procesamiento de Información está enfocada en la invención de tecnologías de redes, computación y de software vitales para asegurar las superioridad militar del Departamento de Defensa.\nLa Oficina de Explotación de Información desarrolla tecnología de detección y de sistemas de información y sistemas con aplicación a concepción del campo de batalla, blancos, comando y control, y la infraestructura de apoyo requerida para dirigir amenazas de tierra en procesos dinámicos y de ciclo cerrado.\nLa misión de la Oficina de Tecnología en Microsistemas (MTO) se enfoca en la integración heterogénea a escala de microchip de sistemas electrónicos, fotónicos y microelectromecánicos (estos últimos también conocidos como MEMS). Su tecnología de alto riesgo y factura está dirigida a resolver los problemas de nivel nacional de protección contrataques biológicos, químicos y de información, y para proporcionar dominio operacional para comando y control móvil distribuido, guerra tripulada/no-tripulada combinada, y planeación y ejecución militar dinámica y adaptativa.\nLa Oficina de Proyectos Especiales investiga, desarrolla, demuestra y transforma tecnologías enfocadas a confrontar desafíos nacionales presentes y emergentes. Sus inversiones abarcan desde el desarrollo de tecnologías hasta la demostración de extensos sistemas prototipo. La SPO desarrolla tecnologías para contrarrestar la amenaza de instalaciones subterráneas usadas para propósitos como comando y control, almacenamiento y puesta en marcha de armas, y manufactura de armas de destrucción masiva. También desarrolla formas significativamente más efectivas en costo para contrarrestar misiles múltiples de bajo costo, vehículos de asalto urbano, y otras plataformas usadas para entrega, interferencia y vigilancia de armas. La SPO invierte en novedosas tecnologías espaciales a lo largo del espectro de aplicaciones de control espacial que incluyen acceso rápido, concepción situacional de espacio, contra-espacio y enfoques de detección a nivel táctico persistente que incluyen aberturas y estructuras en el espacio extremadamente grandes.\nLa Oficina de Tecnología Táctica se encarga de investigación militar avanzada de alto coste y riesgo, enfatizando el enfoque de \"sistema\" y \"subsistema\" al desarrollo de sistemas aeronáuticos, espaciales y terrestres así también como de procesadores empotrados y sistemas de control.\nLa Oficina Conjunta de Sistemas de Combate Aéreo No Tripulado (J-UCAS) es la actividad en DARPA a la cual se le ha encomendado el esfuerzo del Departamento de Defensa de desarrollar y demostrar los Sistemas de Combate Aéreo No Tripulado.\nLa Oficina de Tecnologías Biológicas (BTO) fomenta, demuestra y transiciones, avances en la investigación fundamental, descubrimientos y aplicaciones que integran la biología, la ingeniería y la informática para la seguridad nacional. Creado en abril de 2014 por el entonces director Arati Prabhakar, tomando programas de las divisiones MTO y DSO.[4]​", "subsections": []}, {"name": "Proyectos DARPA", "text": "Los proyectos en DARPA son muy futuristas y los podemos tener desde investigar la invisibilidad de la materia, la inteligencia artificial, la robótica muy avanzada como son robots líquidos, el submarino volador o la granada nuclear, etc. Todos los nombres de los proyectos de DARPA están en inglés. Algunos de los proyectos reconocidos de DARPA más emblemáticos son los siguientes:", "subsections": [{"name": "Proyectos Activos", "text": "ACTUV - Un proyecto para construir un buque de guerra antisubmarino.\nArcLight (Missile) - Sistema de envío de armas con la capacidad de atacar objetivos casi en cualquier parte del mundo, basado en el misil SM-3.\nX-37b - Transbordador espacial robotizado sin tripulación y de pequeño tamaño fabricado por Boeing, que fue puesto en órbita en abril de 2010 utilizando un cohete de grandes dimensiones Atlas V para realizar experimentos científicos secretos. En el espacio despliega unas células solares en conjunto con unas baterías de ion-litio de última generación y está preparado para permanecer durante 9 meses en el espacio. Fue un proyecto original de la NASA iniciado en 1999 para después ser pasado a la Fuerza Aérea de los Estados Unidos y ser considerado como secreto. Tiene una masa de 5000 kg y unas dimensiones de 8,2 metros de largo x 4,5 metros de ancho. Dispone de un sistema de autodestrucción. Con una bodega para alojar diferentes cargas, diseñado para volar entre 200 y 900 km de altura y con aterrizaje sin tripulación y en modo automático.\nIntegrated Sensor is Structure\nBoomerang (mobile shooter detection system) - Sistema acústico desarrollado por BBN Technologies para detectar francotiradores en vehículos de combate militar.\nCALO o \"Cognitive Assistant that Learns and Organizes\" - Software\nCombat Zones That See - \"Rastrea todo lo visible\" en una ciudad con un sistema masivo de cámaras y procesado de imagen posterior.\nDARPA XG\nEATR - Un robot táctico energéticamente autónomo.\nFALCON\nHigh Energy Liquid Laser Area Defense System\nHigh Productivity Computing Systems\nHTV-2 (Hypersonic Technology Vehicle-2) - Vehículo hipersónico para vuelos estratosféricos sin piloto a velocidad 6 veces la del sonido (Mach 6) realizó el primer vuelo en abril de 2010, donde fracasó el intento perdiendo el artefacto.\nHulc - Exoesqueleto humano alimentado por baterías.\nMAHEM - Munición penetrante\nNorthrop Grumman Switchblade - Artefacto de alta velocidad de gran alcance basado en un ala oblicua.\nPersistent Close Air Support\nProtein Design Procesados\nRemote-controlled insects[5]​\nDARPA Silent Talk - Un programa capaz de identificar patrones EEG de palabras y capaz de transmitirlos para comunicaciones encubiertas.[6]​\nSystem F6 - Fractionated Spacecraft\nXOS - Exoesqueleto militar.\nTransformer - Vehículo terrestre armado capaz de pasar a vehículo aéreo.[7]​\nWolfPack[8]​\nJUGGERNAUTS - Prototipos de trajes antibalísticos, los artificieros llevan una protección similar a la que se quiere proponer para el diseño de los trajes."}, {"name": "Proyectos Pasados", "text": "Project AGILE\nARPANET, el predecesor de Internet\nAspen Movie Map\nASTOVL, precursor del Joint Strike Fighter Program[9]​\nBoeing X-45\nCPOF\nDAML\nDARPA Grand Challenge - Competición de vehículos sin conductor\nDARPA Network Challenge[10]​\nDEFENDER\nHigh Performance Knowledge Bases\nHISSS\nHypersonic Research Program\nI3 (Intelligent Integration of Information)\nInternet\nProject MAC\nMQ-1 Predator\nMultics\nNLS/Augment\nOnion routing\nPassive radar\nPolicy Analysis Market\nPOSSE\nRapid Knowledge Formation\nSea Shadow\nStrategic Computing Program\nSynthetic Aperture Ladar for Tactical Applications (SALTI)\nSURAN (1983–87)\nProject Vela (1963)"}]}, {"name": "Controversia", "text": "DARPA recibió la atención de los medios en 2002 y 2003 luego de haber creado proyectos como Information Awareness Officeen: y Combat Zones That See (CTS), los cuales fueron demandados por los activistas de libertades civiles tanto de izquierda como de derecha como inaceptablemente Orwellianos.", "subsections": []}, {"name": "ARPA y DARPA en la ficción", "text": "En la serie de videojuegos Metal Gear Solid, se mencionan tanto a ARPA como a DARPA como parte del argumento, y hace referencia a cómo ARPA finalmente se convierte en DARPA en el futuro. Se nota también la polémica propuesta de una Bolsa de Análisis de Políticas, que usa una bolsa electrónica futurista para ayudar a efectuar el comercio de contratos futuros basado en posibles desarrollos políticos en varios países de Oriente Medio. En el videojuego Vanquish el tutorial se realiza en un recinto de pruebas de DARPA.\nEn 2010, en el videojuego Tom Clancy's Splinter Cell: Conviction se hace referencia a Darpa como parte de la historia del juego.\nEn julio de 2013, en la película Pacific Rim también se menciona que la tecnología empleada para realizar la conexión entre Jagger y piloto, tiene una interfaz DARPA.\nEn la película de 2015 Project Almanac, unos adolescentes construyen una máquina del tiempo, con planos encontrados en el sótano de la casa de uno de ellos, ya que su padre trabaja para DARPA, a lo largo de la película se menciona en múltiples ocasiones esta organización.\nEn 2018, en el anime Steins;Gate 0 se presenta a DARPA como una de las tres facciones que están en la búsqueda de Rintaro Okabe y Amadeus (IA con los recuerdos de Kurisu Makise) para desarrollar y controlar la tecnología de salto y viajes en el tiempo.", "subsections": []}, {"name": "Véase también", "text": "DARPA Grand Challenge\nARPANET\nARPA-E\nInternet\n EDA", "subsections": []}, {"name": "Referencias", "text": "↑ Shachtman, Noah (14 de febrero de 2012). «DARPA DODGES OBAMA BUDGET DEATH RAY, KEEPS ITS $2.8 BILLION». Wired. Consultado el 20 de marzo de 2015. \n↑ https://web.archive.org/web/20070704001204/http://www.darpa.mil/body/pdf/BridgingTheGap_Feb_05.pdf (en inglés)\n↑ Nicholas Negroponte. Ser Digital. 1995\n↑ Klabukov, Ilya; Yakovets, Andrey; Alekhin, Maksim (2017). «Management of Systems Engineering and Technical Assistance of DARPA Research Programs». Innovatsii (innovations) (5(223)): 12-19. doi:10.5281/zenodo.1173043. \n↑ Ewen Callaway (1 de octubre de 2009). «Free-flying cyborg insects steered from a distance». New Scientist. Consultado el 4 de abril de 2010. \n↑ Warwick, Graham (22 de mayo de 2009). «Darpa Plans Triple-Target Missile Demo». Aviation Week. Archivado desde el original el 28 de noviembre de 2011. Consultado el 5 de diciembre de 2010. \n↑ Transformer (TX) darpa.mil. Retrieved: 4 August 2010.\n↑ «STO: WolfPack». Darpa.mil. Strategic Technology Office. Archivado desde el original el 4 de marzo de 2010. Consultado el 4 de abril de 2010. \n↑ A history of the Joint Strike Fighter Program, Martin-Baker. Retrieved 4 August 2010\n↑ «DARPA Network Challenge». Darpa.mil. Archivado desde el original el 31 de enero de 2010. Consultado el 4 de abril de 2010. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/D_(lenguaje_de_programaci%C3%B3n)", "title": "D (lenguaje de programación)", "summary": "[\n]\nD es un lenguaje de programación de propósito general desarrollado por Walter Bright cuya primera versión apareció en 1999. Se origina como un rediseño de C++, con un enfoque más pragmático, pero no es un lenguaje puramente derivado del anterior. D ha mantenido algunas características de C++ y también está influido por otros conceptos de otros lenguajes como Java, C# y Eiffel.", "sections": [{"name": "Características", "text": "D está siendo diseñado con lecciones aprendidas del uso de C++ en vez de ser diseñado desde una perspectiva teórica. Aunque usa muchos de los conceptos de C/C++ también descarta algunos, y por lo tanto no es compatible con código escrito en C o C++. D retiene la habilidad de C++ de hacer código de bajo nivel, permitiendo incluir código en ensamblador. La herencia múltiple de C++ es reemplazada por herencia simple e interfaces y 'mixins'. La sintaxis de declaración y la sintaxis para las expresiones se parecen a las de C++.\nEl soporte del lenguaje ensamblador demuestra una de las diferencias entre D con respecto a otros lenguajes como Java y C#. Esto permite incluir código específico de la máquina con código D, una técnica comúnmente usada por programadores de software de sistema para acceder a características de bajo nivel necesarias para interactuar directamente con el hardware, permitiendo escribir software como sistemas operativos y drivers.\nD incluye soporte para comentarios de documentación, pero hasta ahora sólo el compilador entregado por Digital Mars implementa un generador de documentación.", "subsections": [{"name": "Orientada a objetos", "text": "La programación orientada a objetos está basada en herencia simple, con todas las clases derivadas de la clase Object. D no soporta herencia múltiple; en vez de eso, usa interfaces parecidas a las de Java, que son comparables a las clases abstractas de C++."}, {"name": "Metaprogramación", "text": "La Metaprogramación está soportada por una combinación de plantillas, la ejecución de funciones en tiempo de compilación, tuplas y 'mixins' de cadenas. Soporta CTFE (evaluación de funciones en tiempo de compilación). Los siguientes ejemplos demuestran algunas de las características en tiempo de ejecución del lenguaje D.\nLas plantillas en D se pueden escribir en más de un estilo imperativo comparado con el estilo funcional de las plantillas de C++. El siguiente ejemplo es una función regular que calcula el producto factorial de un número:\nulong\n \nfactorial\n(\nn\n)\n{\n    \nProducto\n=\n1\n;\nfor\ni\n2\n<=\n++){\n        \n*=\n}\nreturn\nAquí, se muestra el uso de la palabra reservada static for (la construcción iterativa en tiempo de ejecución en D), para construir una plantilla que es capaz de realizar el mismo cálculo:\ntemplate\nFactorial\nstatic\nEn los siguientes dos ejemplos, la plantilla y la función definidas arriba se utilizan para calcular factoriales. No es necesario especificar explícitamente los tipos de las constantes cuando el compilador infiere sus tipos desde el lado derecho de las asignaciónes:\nenum\nfact_7\n!(\n7\n);\nEste es un ejemplo de una función en tiempo de ejecución. Las funciones ordinarias pueden usar constantes, aunque expresiones en tiempo de ejecución deben reunir ciertos criterios:\nfact_9\n9\nLa función std.string.format, del estilo printf, sirve para dar formato a los datos (también en tiempo de ejecución, a través de CTFE (ejecución de función en tiempo de ejecución), y el pragma \"msg\" (directiva) que muestra el resultado en tiempo de ejecución:\nimport\nstd\n.\nstring\n:\nformat\npragma\nmsg\n,\n\"7! = %s\"\n));\n\"9! = %s\"\nLos \"mixins\" de cadenas, combinadas con las CTFE, permiten generar código D usando operaciones expresadas en cadenas de caracteres, en tiempo de ejecución. Puede ser utilizado para análisis sintáctico de un lenguaje específico del dominio hacia código D, el cual se compila como parte del programa:\nFooToD\n// Modulo hipotetico que contiene una funcion que analiza el código fuente Foo\n               \n// y devuelve el código D equivalente\nvoid\nmain\n()\nmixin\nfooToD\n\"example.foo\"\n)));"}, {"name": "Funciones", "text": "D soporta características de programación funcional tal como funciones anónimas, clausuras, objetos recursivamente immutables y el uso de funciones de orden superior. Hay dos sintaxis para funciones anónimas, incluyendo una forma de declaración múltiple y una notación abreviada de expresiones simples:[6]​\nint\nfunction\ng\nx\n*\n};\n// forma larga\n=>\n// forma abreviada"}, {"name": "Manejo de memoria", "text": "La memoria es usualmente manejada por un recolector de basura, pero objetos específicos pueden ser finalizados inmediatamente cuando salen del ámbito. Es posible el manejo de memoria explícito usando los operadores sobrecargados new y delete, y simplemente llamando las funciones malloc y free de C directamente. La recolección de basura puede ser controlada: los programadores pueden agregar y excluir rangos de memoria de ser observados por el recolector, pueden pausar y reanudar el recolector y forzar un ciclo generacional o de recolección completa.[7]​ El manual da muchos ejemplos de cómo implementar diferentes esquemas de manejo de memoria altamente optimizados para cuando la recolección de basura es inadecuada para el programa."}, {"name": "Interacción con otros sistemas", "text": "La API de C es admitida, al igual que todos los tipos fundamentales y derivados de C, permitiendo acceso directo al código existente escrito en C y bibliotecas. La biblioteca estándar de C es parte del D estándar. A menos que se usen namespaces muy explícitos puede ser de alguna forma difícil de acceder, como se puede observar en módulos escritos en D que hagan uso de dicha característica. Pero la biblioteca estándar de D es usualmente suficiente."}]}, {"name": "Ejemplos", "text": "", "subsections": [{"name": "Ejemplo 1", "text": "Este programa imprime sus argumentos de la línea de comandos. La función principal main es el punto de inicio de un programa en D, y args es un arreglo de cadena de caracteres que representa los argumentos de línea de comandos. En D, string es un arreglo de caracteres, que se representa con char[] en D1, o immutable(char)[] en D2.\nstdio\nwritefln\nvoid main(string[] args)\n    efln(\"args[%d] = '%s'\", i, arg);\nLa palabra reservada foreach puede iterar cualquier colección. En este caso, produce una sucesión de índices (i) y valores (arg) desde el arreglo args. El índice i y el valor arg tiene sus tipos inferidos desde del tipo del arreglo args."}]}, {"name": "Implementación", "text": "Las implementaciones actuales de D compilan el código directamente a código máquina para lograr una ejecución eficiente.\nCambios al lenguaje no se hacen regularmente desde la versión 1.0. El diseño está virtualmente congelado, y nuevos lanzamientos se concentran en resolver bugs existentes. El compilador oficial de Walter Bright define el lenguaje.\nDMD: El compilador de Digital Mars, el compilador oficial de D. El front end está bajo la licencia Artistic License y la licencia GNU GPL; las fuentes para el front end son distribuidas con los binarios del compilador. El back end es propietario, pero el código es abierto.\nGDC: Un front end para el back end GCC, construido usando las fuentes del compilador DMD. Snapshots soportan la versión 2.0 del lenguaje.\nLDC: Un compilador basado en DMD y usa LLVM como back end. El backend LLVM permite que LDC logre optimizar el código alcanzando rendimiento similar a C/C++ e incluso superándolo en ocasiones.", "subsections": []}, {"name": "Herramientas de desarrollo", "text": "D todavía no está soportado en muchos entornos de desarrollo, lo cual es un problema esencial para muchos usuarios. Editores que pueden ser usados incluyen a Entice Designer, emacs, vim, SciTE y Zeus entre otros. Vim soporta el resaltado de sintaxis y completado de código (a través de ctags parcheados). Code::Blocks incluye soporte parcial del lenguaje.\nHay dos plu-gins en desarrollo para Eclipse, Descent y Mmrnmhrm.\nAdicionalmente, hay IDEs escritas en el propio D como Poseidon, que incluye completado de código, resaltado de sintaxis y depurador.\nAplicaciones escritas en D pueden ser depuradas con cualquier depurador de C o C++, como GDB o WinDbg, aunque soporte para varias características fundamentales de D es limitado. Un depurador con soporte explícito para D es Ddbg para Windows. El depurador comercial ZeroBUGS para Linux tiene soporte experimental para D. Ddbg puede ser usado con varios IDEs o desde la línea de comandos, ZeroBUGS tiene su propia interfaz gráfica.", "subsections": []}, {"name": "Problemas y controversias", "text": "", "subsections": [{"name": "Sobrecarga de operadores", "text": "La sobrecarga de operadores en D a veces son menos poderosas que las de C++. Un ejemplo es el opIndex, que sufre porque D no permite regresar referencias. Esto hace operaciones como obj[i]++; imposibles. La solución parcial de D es el operador opIndexAssign, que solo repara casos donde la expresión indexeada es solo un valor L como obj[i] = 5 pero no los casos originales."}, {"name": "División en la biblioteca estándar", "text": "La biblioteca estándar en D es llamada Phobos. Algunos miembros de la comunidad piensan que Phobos es demasiado simple y que posee numerosos problemas, por lo cual un reemplazo llamado Tango fue escrito.[8]​ Sin embargo, Tango y Phobos eran incompatibles debido a varias diferencias (soporte de hilos, recolector de basura, etc). La existencia de dos bibliotecas, ambas de uso elevado, llevó a problemas significativos donde algunos paquetes usan Phobos y otros usan Tango. Este problema fue resuelto con la versión 2.0 del lenguaje."}, {"name": "Soporte sin finalizar para bibliotecas compartidas/dinámicas", "text": "Bibliotecas compartidas ELF de Unix son soportadas hasta un punto usando el compilador GDC. En Windows, DLLs son soportadas y permiten a objetos recolectados por el recolector de basura de ser seguramente pasados a funciones de C, ya que el recolector de basura revisa el stack por punteros. Sin embargo, todavía hay limitaciones con DLLs en D incluyendo el hecho de que la información en tiempo de ejecución de clases definidas en la DLL es incompatible con esas definidas en el ejecutable, y que cualquier objeto creado desde la DLL debe ser finalizado antes de que la DLL sea descargada.[9]​"}]}, {"name": "Referencias", "text": "↑ «Change Log: 2.096.0 – D Programming Language». D Programming Language 2.0. D Language Foundation. Consultado el 6 de abril de 2021. \n↑ «Change Log: 2.105.2». Consultado el 22 de septiembre de 2023. \n↑ «Building  assert()  in Swift, Part 2:  __FILE__  and  __LINE__  - Swift Blog -». Apple Developer. Consultado el 26 de septiembre de 2014. «Swift borrows a clever feature from the D language: these identifiers expand to the location of the caller when evaluated in a default argument list.» \n↑ «readme.txt». DMD source code. GitHub. Consultado el 5 de marzo de 2012. \n↑ FAQ de digitalmars\n↑ «Expressions». Digital Mars. Consultado el 27 de diciembre de 2012. \n↑ «core.memory - D Programming Language - Digital Mars». Archivado desde el original el 28 de agosto de 2011. Consultado el 2009. \n↑ Wiki4D: Standard Lib\n↑ «Wiki4D: BestPractices/DLL». Consultado el 2009. \nAndrei Alexandrescu, The D Programming Language, Addison-Wesley Professional; 1.ª ed. (12 de junio de 2010)", "subsections": []}, {"name": "Enlaces externos", "text": "Digital Mars: D programming language\nDSource, una comunidad open source del lenguaje D\nWiki4D, una wiki sobre el lenguaje D\nD front-end for GCC\nThe Computer Language Benchmarks Game\nTabla de las características de D\nVideo de presentación de D por Walter Bright\nDdbg - Depurador de D para Windows\nComputerworld Interview with Walter Bright on D Programming Languag", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Diferencia_de_conjuntos", "title": "Diferencia de conjuntos", "summary": "A\nB\nEn teoría de conjuntos, la diferencia de dos conjuntos es una operación que da como resultado otro conjunto con los elementos del primer conjunto sin los elementos del segundo conjunto. Por ejemplo, la diferencia entre el conjunto de los números naturales, \nN\n{\\displaystyle \\mathbb {N} }\n, y el conjunto de los números pares sin incluir el cero, \nP\n{\\displaystyle P}\n, es el conjunto de los números que no son pares, es decir, los impares, \nI\n{\\displaystyle I}\n:\nN\n=\n{\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n,\n9\n,\n10\n,\n11\n,\n12\n…\n}\n{\\displaystyle \\mathbb {N} =\\{1,2,3,4,5,6,7,8,9,10,11,12\\ldots \\}}\nP\n=\n{\n2\n,\n4\n,\n6\n,\n8\n,\n10\n,\n12\n…\n}\n{\\displaystyle P=\\{2,4,6,8,10,12\\ldots \\}}\nI\n=\n{\n1\n,\n3\n,\n5\n,\n7\n,\n9\n,\n11\n,\n13\n,\n15\n,\n17\n…\n}\n{\\displaystyle I=\\{1,3,5,7,9,11,13,15,17\\ldots \\}}\nComo no hay ningún elemento del conjunto P que no sea un número natural, la diferencia P menos N no tiene ningún elemento, por lo que es el conjunto vacío. La diferencia entre dos conjuntos A y B se denota por A \\ B o A − B, por lo que: N \\ P = I, y también P − N = ∅.", "sections": [{"name": "Definición", "text": "Dados dos conjuntos A y B, su diferencia es el conjunto que contiene algunos  elementos de A que no están en B:\nLa diferencia de A menos B (o entre A y B) es otro conjunto A \\ B (o también A − B) cuyos elementos son todos aquellos elementos de A que no lo sean de B:\nx\n∈\nA\n∖\nB\n si y s\no\n´\nlo si \nx\n∈\nA\n pero \nx\n∉\nB\n{\\displaystyle x\\in A\\setminus B{\\text{ si y s}}{\\acute {\\text{o}}}{\\text{lo si }}x\\in A{\\text{ pero }}x\\notin B}\nLa diferencia entre A y B también se denomina complemento relativo de B en A, y se denota ∁AB, cuando el segundo es un subconjunto del primero. Este nombre proviene de la relación entre las operaciones de diferencia y complemento (ver más abajo). La norma ISO da preferencia a la notación cpero no se puedebarra invertida. [cita requerida]\nEjemplo.\nSean A = {♠, 5, z, R, 0} y B = {0, p, 9, z, Δ}. Sus diferencias son A \\ B = {♠, 5, R} y B \\ A = {p, 9, Δ}\nSean los conjuntos de números naturales P = {n: n es par} y P = {n: n es primo}. La diferencia P \\ P es entonces {n: n es par y no es primo} = {n: n es par y compuesto} = {4, 8, 6, ...}. Por otro lado, P \\ P = {n: n es primo y no es par} = {n: n es primo e impar} = {3, 5, 7, 11, ...}.\nEn la introducción se mostró que la diferencia P \\ N es el conjunto vacío. Además, P \\ I es igual a P: ningún número par es a la vez un número impar.", "subsections": []}, {"name": "Propiedades", "text": "Artículo principal:\nDe la definición de la diferencia de conjuntos, puede deducirse inmediatamente.\nElemento neutro. La diferencia entre un conjunto y el conjunto vacío es el propio conjunto:\nA\n∖\n∅\n=\nA\n{\\displaystyle A\\setminus \\varnothing =A}\nLa diferencia de un conjunto menos él mismo es el conjunto vacío:\nA\n∖\nA\n=\n∅\n{\\displaystyle A\\setminus A=\\varnothing }\nEstas igualdades son un caso particular de la siguiente propiedad:\nLa diferencia entre dos conjuntos es el conjunto vacío si y sólo si el primero es un subconjunto del segundo:\nA\n∖\nB\n=\n∅\n↔\nA\n⊆\nB\n{\\displaystyle A\\setminus B=\\varnothing \\leftrightarrow A\\subseteq B}\nLa diferencia entre dos conjuntos es igual al primer conjunto si y sólo si ambos conjuntos son disjuntos:\nA\n∖\nB\n=\nA\n↔\nA\n∩\nB\n=\n∅\n{\\displaystyle A\\setminus B=A\\leftrightarrow A\\cap B=\\varnothing }\nLa intersección de dos conjuntos es la parte que tienen en común, mientras que la diferencia es la parte que no comparten. Esto se traduce en la siguiente propiedad:\nDados dos conjuntos, su intersección y su diferencia son disjuntos entre sí, y su unión es el primero de los conjuntos iniciales:\n(\nA\n∩\nB\n)\n∩\n(\nA\n∖\nB\n)\n=\n∅\n \n,\n \n(\nA\n∩\nB\n)\n∪\n(\nA\n∖\nB\n)\n=\nA\n{\\displaystyle (A\\cap B)\\cap (A\\setminus B)=\\varnothing \\ ,\\ (A\\cap B)\\cup (A\\setminus B)=A}\nEsto quiere decir que la intersección y la diferencia entre A y B son una (posible) partición de A.\nLa diferencia de conjuntos está muy relacionada con el complemento de un conjunto:\nEl complemento de un conjunto es la diferencia entre el conjunto universal y él mismo:\nA\n∁\n=\nU\n∖\nA\n{\\displaystyle A^{\\complement }=U\\setminus A}\nEs por esto que la diferencia de dos conjuntos, A - B, se denomina también el complemento relativo de B respecto de A: A \\ B es el complemento absoluto de B, considerando a A como el conjunto universal . Las leyes de De Morgan y otras propiedades del complemento de un conjunto tienen entonces su contrapartida en la diferencia de conjuntos, si se tiene en cuenta que\nSi se considera un conjunto universal, la diferencia entre dos conjuntos es la intersección del primero con el complemento del segundo:\nA\n∖\nB\n=\nA\n∩\nB\n∁\n{\\displaystyle A\\setminus B=A\\cap B^{\\complement }}\nTambién es de hacer notar que si:\nA\n−\nB\n=\nC\n,\n{\\displaystyle A-B=C,}\nA\n≠\nC\n+\nB\n{\\displaystyle A\\neq C+B}", "subsections": []}, {"name": "Véase también", "text": "Álgebra de conjuntos\nDiferencia simétrica\nConjunto\nTeoría de conjuntos", "subsections": []}, {"name": "Bibliografía", "text": "Lipschutz, Seymour (1991). Teoría de conjuntos y temas afines. McGraw-Hill. ISBN 968-422-926-7.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Diferencia_sim%C3%A9trica", "title": "Diferencia simétrica", "summary": "A\nB\nEn teoría de conjuntos, la diferencia simétrica de dos conjuntos es una operación cuyo resultado es otro conjunto que contiene a aquellos elementos que pertenecen a cada uno de los conjuntos iniciales, pero no a ambos a la vez. Por ejemplo, la diferencia simétrica del conjunto de los números pares positivos P y el conjunto de los cuadrados perfectos C es un conjunto D que contiene los cuadrados impares y los pares no cuadrados:\nP\n=\n{\n2\n,\n4\n,\n6\n,\n8\n,\n10\n,\n12\n,\n14\n,\n16\n,\n…\n}\n{\\displaystyle P=\\{2,4,6,8,10,12,14,16,\\ldots \\}}\nC\n=\n{\n1\n,\n4\n,\n9\n,\n16\n,\n25\n,\n…\n}\n{\\displaystyle C=\\{1,4,9,16,25,\\ldots \\}}\nD\n=\n{\n1\n,\n2\n,\n6\n,\n8\n,\n9\n,\n10\n,\n12\n,\n14\n,\n18\n,\n…\n}\n{\\displaystyle D=\\{1,2,6,8,9,10,12,14,18,\\ldots \\}}", "sections": [{"name": "Definición", "text": "Dados dos conjuntos A y B, su diferencia simétrica, A Δ B, es un conjunto que contiene los elementos de A y B que no son comunes a ambos:\nLa diferencia simétrica de dos conjuntos A y B es otro conjunto A Δ B cuyos elementos son todos los elementos de A o B, a excepción de los elementos comunes a ambos:\nx\n∈\nA\n \nΔ\nB\n{\\displaystyle x\\in A\\ \\Delta \\,B}\n si y sólo si, o bien \nx\n∈\nA\n{\\displaystyle x\\in A}\n o bien \nx\n∈\nB\n{\\displaystyle x\\in B}\nEjemplo.\nSean A = {a, ♠, 5, Z} y B = {8, #, a, Γ, ♠}. La diferencia simétrica es A Δ B = {5, Γ, #, Z, 8}.\nSean los conjuntos de polígonos T = {pentágonos} y R = {polígonos regulares}. La diferencia simétrica contiene los polígonos regulares y pentágonos que no sean ambas cosas a la vez, o sea: R Δ T = {Pentágonos irregulares y polígonos regulares que no posean 5 lados}.\nLa definición de la diferencia simétrica puede reducirse fácilmente a las operaciones de unión, intersección y diferencia:\nA\n \nΔ\nB\n=\n(\nA\n∪\nB\n)\n∖\n(\nA\n∩\nB\n)\n=\n(\nA\n∖\nB\n)\n∪\n(\nB\n∖\nA\n)\n{\\displaystyle A\\ \\Delta \\,B=(A\\cup B)\\setminus (A\\cap B)=(A\\setminus B)\\cup (B\\setminus A)}", "subsections": [{"name": "Generalizaciones", "text": "La diferencia simétrica es conmutativa y asociativa por lo que al tomar la diferencia simétrica de más de dos conjuntos, el orden en el que se realizan las operaciones es irrelevante (ver más abajo). Así es que se puede definir la diferencia simétria de una familia de conjuntos finita:\nA\n1\n \n△\nA\n2\n \n△\n…\n \n△\nA\nn\n≡\n(\nA\n1\n \n△\n(\nA\n2\n \n△\n(\n…\n \n△\nA\nn\n)\n…\n)\n{\\displaystyle A_{1}\\ \\triangle \\,A_{2}\\ \\triangle \\,\\ldots \\ \\triangle \\,A_{n}\\equiv \\left(A_{1}\\ \\triangle \\,\\left(A_{2}\\ \\triangle \\,\\left(\\ldots \\ \\triangle \\,A_{n}\\right){\\scriptstyle \\ldots }\\right)\\right.}\nPuede comprobarse que una definición alternativa para esta diferencia de varios conjuntos es incluir sólo los elementos que aparecen un número impar de veces:\nA\n1\n \n△\nA\n2\n \n△\n…\n \n△\nA\nn\n=\n{\na\n∈\n∪\n1\n≤\ni\n≤\nn\nA\ni\n:\n el cardinal de \n{\nk\n:\na\n∈\nA\nk\n}\n es impar\n}\n{\\displaystyle A_{1}\\ \\triangle \\,A_{2}\\ \\triangle \\,\\ldots \\ \\triangle \\,A_{n}={\\big \\{}a\\in \\cup _{1\\leq i\\leq n}A_{i}:{\\text{ el cardinal de }}\\{k:a\\in A_{k}\\}{\\text{ es impar}}{\\big \\}}}"}]}, {"name": "Propiedades", "text": "Artículo principal:\nDe la definición de diferencia simétrica puede deducirse directamente:\nNilpotencia. La diferencia simétrica de un conjunto consigo mismo es el conjunto vacío:\nA\n△\nA\n=\n∅\n{\\displaystyle A\\,\\triangle A=\\varnothing }\nLa diferencia simétrica de un conjunto y uno de sus subconjuntos es la diferencia entre ellos:\nB\n⊆\nA\n→\nA\n△\nB\n=\nA\n∖\nB\n{\\displaystyle B\\subseteq A\\rightarrow A\\triangle B=A\\setminus B}\nLa diferencia simétrica tiene propiedades semejantes a las operaciones con números:\nPropiedad asociativa. La diferencia simétrica de los conjuntos A y B Δ C es igual que la diferencia simétrica de los conjuntos A Δ B y C :\n(\nA\n△\nB\n)\n△\nC\n=\nA\n△\n(\nB\n△\nC\n)\n{\\displaystyle (A\\triangle B)\\triangle C=A\\triangle (B\\triangle C)}\nPropiedad conmutativa. La diferencia simétrica de los conjuntos A y B es igual a la diferencia simétrica de los conjuntos B y A :\nA\n△\nB\n=\nB\n△\nA\n{\\displaystyle A\\triangle B=B\\triangle A}\nElemento neutro. La diferencia simétrica de un conjunto A con el conjunto vacío es el mismo conjunto A:\nA\n△\n∅\n=\nA\n{\\displaystyle A\\triangle \\varnothing =A}\nAdemás, con respecto a la intersección existe una ley distributiva:\nPropiedad distributiva\nA\n∩\n(\nB\n△\nC\n)\n=\n(\nA\n∩\nB\n)\n△\n(\nA\n∩\nC\n)\n{\\displaystyle A\\cap (B\\triangle C)=(A\\cap B)\\triangle (A\\cap C)}\nLas propiedades de la intersección y la diferencia simétrica son similares a las del producto y la suma en Z2. Esto implica que el conjunto potencia de un conjunto dado X tiene estructura de anillo considerando estas dos operaciones. Este anillo se corresponde (es isomorfo) al anillo de las funciones de X con valores en Z2, con la suma y producto punto a punto. La correspondencia asigna a cada subconjunto de X su función característica.", "subsections": []}, {"name": "Véase también", "text": "Álgebra de conjuntos\nDiferencia de conjuntos\nIntersección de conjuntos", "subsections": []}, {"name": "Referencias", "text": "M.I. Voitsekhovskii. «Symmetric difference of sets». Encyclopaedia of mathematics (en inglés). Archivado desde el original el 30 de julio de 2012.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Django_(framework)", "title": "Django (framework)", "summary": "Django es un framework de desarrollo web de código abierto, escrito en Python, que respeta el patrón de diseño conocido como modelo–vista–controlador (MVC). Fue desarrollado originalmente para gestionar páginas web orientadas a noticias de la World Company de Lawrence, Kansas, y fue liberada al público bajo una licencia BSD en julio de 2005; el framework fue nombrado en alusión al guitarrista de jazz gitano Django Reinhardt.\nEn junio de 2008 fue anunciado que la recién formada Django Software Foundation se haría cargo de Django en el futuro.\nLa meta fundamental de Django es facilitar la creación de sitios web complejos. Django pone énfasis en el re-uso, la conectividad y extensibilidad de componentes, el desarrollo rápido y el principio «DRY» (del inglés Don't Repeat Yourself,«No te repitas»). El lenguaje Python es usado en todos los componentes del framework, incluso en configuraciones, archivos,[1]​ y en sus modelos de datos.", "sections": [{"name": "Visión general y características", "text": "Al igual que Ruby on Rails, otro popular framework de código abierto, Django se usó en producción durante un tiempo antes de que se liberara al público; fue desarrollado por Adrian Holovaty, Simon Willison, Jacob Kaplan-Moss y Wilson Miner mientras trabajaban en World Online, y originalmente se utilizó para administrar tres sitios web de noticias: The Lawrence Journal-World, lawrence.com y KUsports.com.\nLos orígenes de Django en la administración de páginas de noticias son evidentes en su diseño, ya que proporciona una serie de características que facilitan el desarrollo rápido de páginas orientadas a contenidos. Por ejemplo, en lugar de requerir que los desarrolladores escriban controladores y vistas para las áreas de administración de la página, Django proporciona una aplicación incorporada para administrar los contenidos, que puede incluirse como parte de cualquier página hecha con Django y que puede administrar varias páginas a partir de una misma instalación; la aplicación administrativa permite la creación, actualización y eliminación de objetos de contenido, llevando un registro de todas las acciones realizadas sobre cada uno, y proporciona una interfaz para administrar los usuarios y los grupos de usuarios (incluyendo una asignación detallada de permisos).\nLa distribución principal de Django también aglutina aplicaciones que proporcionan un sistema de comentarios, herramientas para sindicar contenido via RSS y/o Atom, \"páginas planas\" que permiten gestionar páginas de contenido sin necesidad de escribir controladores o vistas para esas páginas, y un sistema de redirección de URLs.\nOtras características de Django son:\nUn mapeador objeto-relacional.\nAplicaciones \"enchufables\" que pueden instalarse en cualquier página gestionada con Django.\nUna API de base de datos robusta.\nUn sistema incorporado de \"vistas genéricas\" que ahorra tener que escribir la lógica de ciertas tareas comunes.\nUn sistema extensible de plantillas basado en etiquetas, con herencia de plantillas.\nUn despachador de URLs basado en expresiones regulares.\nUn sistema \"middleware\" para desarrollar características adicionales; por ejemplo, la distribución principal de Django incluye componentes middleware que proporcionan cacheo, compresión de la salida, normalización de URLs, protección CSRF y soporte de sesiones.\nSoporte de internacionalización, incluyendo traducciones incorporadas de la interfaz de administración.\nDocumentación incorporada accesible a través de la aplicación administrativa (incluyendo documentación generada automáticamente de los modelos y las bibliotecas de plantillas añadidas por las aplicaciones).\nDjango también es una plataforma habitual que brinda múltiples herramientas", "subsections": []}, {"name": "Arquitectura", "text": "Aunque Django está fuertemente inspirado en la filosofía de desarrollo Modelo Vista Controlador, sus desarrolladores declaran públicamente que no se sienten especialmente atados a observar estrictamente ningún paradigma particular, y en cambio prefieren hacer \"lo que les parece correcto\". Como resultado, por ejemplo, lo que se llamaría \"controlador\" en un \"verdadero\" framework MVC se llama en Django \"vista\", y lo que se llamaría \"vista\" se llama \"plantilla\".\nGracias al poder de las capas mediator y foundation, Django permite que los desarrolladores se dediquen a construir los objetos Entity y la lógica de presentación y control para ellos.", "subsections": [{"name": "Presentación", "text": "Aquí se maneja la interacción entre el usuario y el computador. En Django, esta tarea la realizan el motor de plantillas y el cargador de plantillas que toman la información y la presentan al usuario (vía HTML, por ejemplo). El sistema de configuración de URLs es también parte de la capa de presentación."}, {"name": "Control", "text": "En esta capa reside el programa o la lógica de aplicación en sí. En Django son representados por las vistas y los manipuladores.\nLa capa de presentación depende de esta y a su vez esta depende de la capa de dominio."}, {"name": "Mediator", "text": "Es el encargado de manejar la interacción entre el subsistema Entity y foundation. \nAquí se realiza el mapeo objeto-relacional a cargo del motor de Django."}, {"name": "Entity", "text": "El subsistema entity maneja los objetos de negocio. El mapeo objeto-relacional de Django permite escribir objetos de tipo entity de una forma fácil y estándar."}, {"name": "Foundation", "text": "La principal tarea del subsistema foundation es la de manejar a bajo nivel el trabajo con la base de datos. Se provee soporte a nivel de foundation para varias bases de datos y otras están en etapa de prueba."}]}, {"name": "Historial de versiones", "text": "02005-11-16 \n02006-01-11 \n02006-07-29 \n02007-03-23 \n02008-09-03 \n02009-07-29 \n02010-05-17 \n02011-03-23 \n02012-03-23 \n02013-02-26 \n02013-11-06 \n02014-09-02 \n02015-04-01 \n02015-12-01 \n02017-01-17 \n02017-04-01 \n02017-12-01 \n02018-08-01 \n02019-04-01 \n02019-12-02 \n02020-08-04 \n02021-04 \n02021-12 \n02022-08 \n02023-04 \n02023-12 ", "subsections": []}, {"name": "Soporte de bases de datos", "text": "Respecto a la base de datos, la recomendada es PostgreSQL, pero también son soportadas MySQL y SQLite 3. Se encuentra en desarrollo un adaptador para Microsoft SQL Server.\nUna vez creados los modelos de datos, Django proporciona una abstracción de la base de datos a través de su API que permite crear, recuperar, actualizar y borrar objetos. También es posible que el usuario ejecute sus propias consultas SQL directamente. En el modelo de datos de Django, una clase representa un registro de una tabla en la base de datos y las instancias de esta serán las tuplas en la tabla.", "subsections": []}, {"name": "Soporte de servidores Web", "text": "Como mencionamos en los requisitos, Django incluye un servidor web liviano para realizar pruebas y trabajar en la etapa de desarrollo.\nEn la etapa de producción, sin embargo, se recomienda Apache 2 con mod_python. Aunque Django soporta la especificación WSGI, por lo que puede correr sobre una gran variedad de servidores como FastCGI o SCGI en Apache u otros servidores (particularmente Lighttpd).", "subsections": []}, {"name": "Requerimientos", "text": "Django requiere Python 2.5 o superior. No se necesitan otras bibliotecas de Python para poder obtener una funcionalidad básica. \nEn un entorno de desarrollo –especialmente si queremos experimentar con Django—no necesitamos un web server instalado, ya que Django trae su propio servidor liviano para este propósito, con la restricción de solo permitir un usuario a la vez.\nDjango incorpora compatibilidad directa con las siguientes bases de datos relacionales: PostgreSQL, MySQL, Oracle, SQLite y MariaDB. En caso de querer usar otras bases de datos relacionales (como SQL Server) o no relacionales (como MongoDB) se debe hacer uso de librerías específicas para dicho propósito [25]​.", "subsections": []}, {"name": "Otros aspectos", "text": "", "subsections": [{"name": "Inconsistencias entre la nomenclatura Django y el patrón MVC", "text": "Django aparenta implementar el patrón MVC, pero su patrón es llamado MTV: modelo, template, vista.\nPrimero, debemos aclarar que al momento de diseñar Django, no se buscó apegarse a nada en particular, sino desarrollar una herramienta que funcione lo mejor posible.\nSi bien es cierto que se asemeja mucho a la implementación del patrón MVC, para Django la Vista describe “qué” datos serán presentados y no “cómo” se verán los mismos. Aquí es donde entran en juego los templates, que describen “cómo los datos son presentados”.\nSe dice que el “controller” de un MVC clásico está representado por el propio framework. Es decir, el sistema que envía un request a la vista correspondiente, de acuerdo a la configuración de URL de Django (archivo de configuración)."}, {"name": "Proceso de una Petición HTTP", "text": "Teniendo la arquitectura en cuenta, veremos a grandes rasgos como se procesa un request.\nCuando Django recibe una Petición HTTP, lo primero que se hace es crear un instancia de la clase HttpRequest que contiene todas las propiedades de la petición y diferentes métodos útiles.\nLuego se realiza la resolución de la URL. Esto consiste en seleccionar la función de la vista (a partir de la URL especificada en la petición HTTP) que participará en la creación de la respuesta de la aplicación.\nUna vez que hemos resuelto que función resolverá la URL especificada, se invoca a la función de la vista con la instancia **request** de la petición HTTP como primer parámetro, el método de la vista contiene generalmente todo el trabajo lógico, operaciones como obtener objetos de la base de datos a través de los modelos, cálculos, transformaciones y finalmente la construcción de la representación de la respuesta final al usuario."}, {"name": "Middleware", "text": "Django provee tres puntos diferentes en los que permite ejecutar clases middleware, previamente definidas en el archivo de configuración. Una misma clase puede ejecutarse en más de un punto, estas son las opciones:"}]}, {"name": "Django en la web", "text": "Estos son solo algunos de los sitios que utilizan Django, aquí se encuentra una lista más completa\nPinterest[26]​\nhttp://www.lawrence.com/[27]​\nhttps://web.archive.org/web/20070609122443/http://www.chicagocrime.org/[28]​\nhttp://www.ljworld.com/\nhttp://projects.washingtonpost.com/congress/\nhttp://www.torontolife.com/\nhttp://www.lawrencechamber.com/", "subsections": []}, {"name": "Referencias", "text": "↑ «Métodos File en Python: Creación y manipulación de archivos de texto». Consultado el 19 de febrero de 2017. \n↑ \"Introduciendo Django 0.90\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Django 0.91 liberado\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Introduciendo Django 0.95\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Anunciando Django 0.96!\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Django 1.0 liberado!\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Django 1.1 liberado\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Django 1.2 liberado\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Django 1.3 liberado\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ \"Django 1.4 liberado\". Django weblog. Extraído el 2 de Febrero de 2013.\n↑ «Django’s proceso de liberación - documentación Django - Django». Archivado desde el original el 6 de marzo de 2016. Consultado el 30 de abril de 2016. \n↑ \"Django 1.5 liberado\" Django weblog. Extraído el 27 de Febrero de 2013.\n↑ \"Django 1.6 liberado\" Django weblog. Extraído el 6 de Noviembre de 2013.\n↑ \"Django 1.7 liberado\" Django weblog. Extraído el 4 de Setiembre de 2014.\n↑ \"Django 1.8 liberado\" Django weblog. Extraído el 2 de Abril  de 2015.\n↑ \"Django 1.9 liberado\" Django weblog. Extraído el 1 de Diciembre de 2015.\n↑ \"Django 1.10 liberado\" Django weblog. Extraído el 17 de Enero de 2017.\n↑ \"Download Django\" Download Django. Extraído el 9 de Diciembre 2016.\n↑ a b \"Download Django\" Download Django. Retrieved 9 December 2016.\n↑ «Django 2.2.3 release notes | Django documentation | Django». docs.djangoproject.com. Consultado el 19 de noviembre de 2020. \n↑ «Django 3.0 release notes | Django documentation | Django». docs.djangoproject.com. Consultado el 19 de noviembre de 2020. \n↑ «Django 3.1 release notes | Django documentation | Django». docs.djangoproject.com. Consultado el 19 de noviembre de 2020. \n↑ «Django 3.2 release notes - UNDER DEVELOPMENT | Django documentation | Django». docs.djangoproject.com. Consultado el 19 de noviembre de 2020. \n↑ a b c «Download Django | Django». www.djangoproject.com. Consultado el 19 de noviembre de 2020. \n↑  https://developer.mozilla.org/es/docs/Learn/Server-side/Django/development_environment Puesta en marcha de un entorno de desarrollo Django \n↑ «El co-fundador Paul Sciarra responde que usan Django extensamente». \n↑ «Anuncio de trabajo donde afirman que ellos mantienen, promocionan y usan activamente Django como plataforma de desarrollo para sus aplicaciones». \n↑ «En la sección de Preguntas frecuentes responden Django a la pregunta \"¿Que tecnologías usan?\"». Archivado desde el original el 11 de marzo de 2015. Consultado el 1 de marzo de 2015. ", "subsections": []}, {"name": "Enlaces externos", "text": "Proyecto Django\nInstalador de Django\nGrupo LinkedIn Django en Latinoamérica\nWiki de la comunidad de Django y repositorio del código\nComunidad en español de Django Archivado el 19 de diciembre de 2008 en Wayback Machine.\nPlanet de Django en español Archivado el 21 de julio de 2009 en Wayback Machine.\nDjango Software Foundation\nLibros sobre Django Archivado el 19 de diciembre de 2008 en Wayback Machine.\nDjango Search Engine\nSobre la arquitectura de Django\nBiografía de Django Reinhardt, de quien proviene el nombre del framework\nThe Django Book\nGithub\nManejo de Dashboards a partir de Django Plotly Das", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Encapsulamiento_(inform%C3%A1tica)", "title": "Encapsulamiento (informática)", "summary": "En la Programación orientada a objetos (POO), la encapsulación se refiere a la agrupación de datos con los métodos que operan en esos datos, o la restricción del acceso directo a algunos de los componentes de un objeto.[1]​ La encapsulación se utiliza para ocultar los valores o el estado de un objeto de datos estructurados dentro de una clase, evitando el acceso directo a ellos por parte de los clientes de una manera que podría exponer detalles de Implementación ocultos o violar la invariancia de estado mantenida por los métodos.\nSin embargo, ocultar datos no es el alcance total de la ocultación de información. David Parnas introdujo por primera vez el concepto de ocultación de información alrededor de 1972. Argumentó que el criterio principal para la modularización del sistema debería referirse a la ocultación de decisiones críticas de diseño. Hizo hincapié en ocultar «decisiones de diseño difíciles o decisiones de diseño que probablemente cambien». Ocultar información de esa manera aísla a los clientes de requerir un conocimiento profundo del diseño para usar un módulo y de los efectos de cambiar esas decisiones.[1]​", "sections": [{"name": "Significado", "text": "Podríamos decir por tanto que con la encapsulación logramos agrupar datos o restringir el acceso directo a algunos componentes de un objeto, mediante métodos a modo de intermediarios que harán uso de ellos mediante unas reglas definidas. Ayudándonos así por ejemplo a alcanzar otro nivel de la programación orientada a objetos como sería el polimorfismo (no confundir con el polimorfismo en el malware).\nEl polimorfismo se refiere a la propiedad por la que es posible enviar mensajes sintácticamente iguales a objetos de tipos distintos. El único requisito que deben cumplir los objetos que se utilizan de manera polimórfica es saber responder al mensaje que se les envía. \nEl ejemplo más claro de encapsulación y polimorfismo sería un programa capaz de calcular las áreas de distintos polígonos, un cliente solo debería de conocer la existencia del método encargado de devolver el área, sin necesidad de preocuparse del proceso interno para calcular las mismas, puesto que el cálculo del área de un cono no se corresponde con la de un rectángulo. Será tarea del programador asegurar la encapsulación para que los métodos que devuelven el área de los distintos objetos de diferentes polígonos respondan de la misma manera, cada uno mediante su propia fórmula matemática de cálculo del área, logrando así el mencionado polimorfismo.\nDe esta forma además de que el usuario de la clase puede obviar la implementación de los métodos y propiedades para concentrarse solo en cómo usarlos, evita que el usuario pueda cambiar su estado de maneras imprevistas e incontroladas.", "subsections": [{"name": "Encapsulación y herencia", "text": "Los autores de \"Design Patterns\" [2]​ discuten la tensión entre la herencia y la encapsulación y afirman que, en su experiencia, los diseñadores abusan de la herencia. Afirman que la herencia a menudo rompe la encapsulación, dado que la herencia expone una subclase a los detalles de la implementación de su clase padre. Como se describe en el problema del yo-yo, el uso excesivo de la herencia y, por lo tanto, la encapsulación, puede volverse demasiado complicado y difícil de depurar."}]}, {"name": "Modificadores de acceso", "text": "Los modificadores de acceso son palabras clave que se usan para especificar la accesibilidad declarada de un miembro o un tipo. Depende del lenguaje de programación que se use, pero los más comunes son:\nDefault: En el caso del lenguaje Java, los miembros de datos, clase o métodos que no se declaran utilizando ningún modificador de acceso, es decir, que tengan un modificador de acceso predeterminado, solo son accesibles dentro del mismo paquete.[3]​\nPublic: El acceso público es el nivel de acceso más permisivo. No hay ninguna restricción para el acceso a miembros públicos.[4]​\nProtected: Un miembro protegido es accesible dentro de su clase y por parte de instancias de clases derivadas.[5]​\nPrivate: El acceso privado es el nivel de acceso menos permisivo. Los miembros privados solo son accesibles dentro del cuerpo de la clase o el struct[6]​ en el que se declaran.[7]​\nInternal: Solo se puede tener acceso a los tipos internos o los miembros desde los archivos del mismo ensamblado.[8]​\nProtected internal: Se puede obtener acceso a un miembro protected internal desde el ensamblado actual o desde tipos que se deriven de la clase contenedora.[9]​\nPrivate protected: Los miembros private protected están accesibles para los tipos que se deriven de la clase contenedora, pero solo desde dentro del ensamblado correspondiente que lo contenga.[10]​", "subsections": []}, {"name": "Ejemplos", "text": "Un ejemplo de la lógica empleada en pseudocódigo:\nDeclaración\n \nde\nla\nclase\ngenérica\n{\n\t\nvariable\n,\nmodificador\nacceso\ny\ntipo\n[ENCAPSULACIÓN]\nmétodo\npara\nleer\n\t\t\nAcceso\nal\nvalor\n}\nsobrescribir\na\ninsertar\nnuevo\nprincipal\nun\nobjeto\nLlamada\nsobreescritura\ndel\ncreado\nlectura\n[Salida]\n:\nValor\nintroducido\nen\nel\nmediante\nllamada\nUn ejemplo real en el lenguaje de programación C#:\n// ", "subsections": []}, {"name": "===============================================================================", "text": "//  Ejemplo de encapsulación en C#\n// Declaración de la clase \"ClaseEjemplo\"\npublic\nclass\nClaseEjemplo\n    \n// Campos declarados como privados\n// Por lo que solo podrán ser utilizados mediante métodos públicos de la clase\n// Campo de valor alfanumérico, su valor será tomado como texto\n// De introducirse números no serán matemáticamente computables\nprivate\nString\nnombre\n;\n// Campo de valor entero (integer), no aceptaría otra cosa que números enteros\n// Estos números si serían matemáticamente computables, por lo que se le podrían sumar años, por ejemplo \nint\nedad\n// Descriptores de acceso get/set para controlar el acceso al atributo nombre\nDescriptorNombre\n        \nget\n            \n// Devolvemos el valor del campo nombre\nreturn\nset\n// Asignamos valor al campo nombre\n// Es obligatorio usar value\n=\nvalue\n// Descriptores de acceso get/set para controlar el acceso al atributo edad\nDescriptorEdad\n// Devolvemos el valor del campo edad\n// Asignamos valor al campo edad\n// Declaración de la clase principal\nClasePrincipal\n// Método principal, es obligatorio que se llame \"Main\"\nstatic\nvoid\nMain\n()\n// Creamos un objeto de la clase \"ClaseEjemplo\"\nClaseEjemplo\nnew\n();\n// Llamamos al disruptor de acceso al atributo “nombre” del objeto creado\n// Le pasamos \"Nombre de la persona\" como valor alfanumérico para el parámetro value\n.\n\"Nombre de la persona\"\n// Llamamos al disruptor de acceso al atributo “edad” del objeto creado\n// Le pasamos \"00\" como valor entero para el parámetro value\n00\n// Mostramos el valor de los campos en la consola de comandos\n// Al no pasarle un valor, el descriptor entiende que lo que debe de hacer es devolverlo\nConsole\nWriteLine\n(\n\"Nombre: \"\n+\n);\n\"Edad: \"\nSalida:\nEdad: 00\nEn caso de intentar acceder directamente a uno de los campos de la clase, saltándonos por tanto la encapsulación: \nEl propio compilador ya nos avisaría del error con respecto a los modificadores de acceso:[11]​", "subsections": []}, {"name": "Referencias", "text": "↑ a b Wm. Paul Rogers (18 de mayo de 2001). «Encapsulation is not information hiding» (en inglés). \n↑ Gamma, Erich; Helm, Richard; Johnson, Ralph; Vlissides, John (1994). Design Patterns (en inglés). Addison-Wesley. ISBN 978-0-201-63361-0. (requiere registro). \n↑ Oracle - Java. «Controlling Access to Members of a Class» (en inglés). \n↑ Microsoft. «public (Referencia de C#)». \n↑ Microsoft. «protected (Referencia de C#)». \n↑ Microsoft. «struct (C++)». \n↑ Microsoft. «private (Referencia de C#)». \n↑ Microsoft. «internal (Referencia de C#)». \n↑ Microsoft. «protected internal (Referencia de C#)». \n↑ Microsoft. «private protected (Referencia de C#)». \n↑ Microsoft. «Error del compilador CS0122». ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Estilo_de_sangrado", "title": "Estilo de sangrado", "summary": "Busca fuentes: «Estilo de sangrado» – noticias · libros · académico · imágenes\nIndentación es un anglicismo (de la palabra inglesa indentation) de uso común en informática; no es un término reconocido por la Real Academia Española (consultado en la vigesimosegunda edición). La Real Academia recomienda utilizar «sangrado». \nEste término significa mover un bloque de texto hacia la derecha insertando espacios o tabuladores, para así separarlo del margen izquierdo y distinguirlo  mejor del texto adyacente; en el ámbito de la imprenta, este concepto siempre se ha denominado sangrado o sangría.\nEn los lenguajes de programación de computadoras, la indentación es un tipo de notación secundaria utilizado para mejorar la legibilidad del código fuente por parte de los programadores, teniendo en cuenta que los compiladores o intérpretes raramente consideran los espacios en blanco entre las sentencias de un programa. Sin embargo, en ciertos lenguajes de programación como Haskell, Occam y Python, el sangrado se utiliza para delimitar la estructura del programa permitiendo establecer bloques de código.\nSon frecuentes discusiones entre programadores sobre cómo o dónde usar el sangrado, si es mejor usar espacios en blanco o tabuladores, ya que cada programador tiene su propio estilo.", "sections": [{"name": "Ejemplos", "text": "", "subsections": [{"name": "Sangrado en SQL", "text": "Ejemplo 1 - Sentencia en el lenguaje SQL sin usar sangrado:\nEn este primer ejemplo se muestra la introducción de valores (valor1,valor2,valor3) en los campos (var1,var2,var3) de la tabla nombre_de_la_tabla. La instrucción se ejecutará de forma correcta, sin embargo, su lectura de un vistazo puede resultar confusa.\nEjemplo 2 - La misma sentencia aplicando sangrado:"}, {"name": "Sangrado en C", "text": "El siguiente código escrito en lenguaje C muestra en pantalla las tablas de multiplicar.\nSin sangrado:\nCon sangrado:\n==Notas"}]}]}
{"url": "https://es.wikipedia.org/wiki/Extensi%C3%B3n_de_archivo", "title": "Extensión de archivo", "summary": "Busca fuentes: «Extensión de archivo» – noticias · libros · académico · imágenes\nEn informática, el término extensión del fichero (también, extensión del archivo) es una cadena de caracteres anexada al nombre de un archivo, habitualmente predicha por un punto. Su función principal es distinguir el contenido del archivo, de modo que el sistema operativo disponga del procedimiento necesario para ejecutarlo o interpretarlo. Sin embargo, la extensión es solamente parte del nombre del archivo y no representa ningún tipo de obligación respecto a su contenido.\nAlgunos sistemas operativos, especialmente los herederos de DOS como Windows, utilizan las extensiones de archivo para reconocer su formato, incluso el de archivos ejecutables. Otros sistemas operativos, como los basados en Unix, utilizan las extensiones de archivo por simple convención, y no las usan necesariamente para determinar el tipo de archivo.\nDado que las extensiones de archivo legado son del sistema DOS, muchas de sus actuales características fueron heredadas por limitaciones en ese sistema. Los antiguos sistemas DOS limitaban la cantidad de caracteres de la extensión de archivo a tres, por lo que muchas extensiones convencionales poseen esa cantidad de caracteres. Además, los nombres de archivo en sistemas DOS son insensibles a las mayúsculas y minúsculas, por lo que la mayoría de las extensiones de archivo pueden escribirse en minúsculas o en mayúsculas o en una combinación de ambas.\nPor su extensión, un mismo nombre básico puede contener archivos de distinto propósito. Como en este ejemplo de DOS:\nAPLICACIÓN.BAS  Archivo Fuente escrito en lenguaje BASIC.\nAPLICACIÓN.OBJ  Archivo objeto (necesario para su compilación).\nAPLICACIÓN.EXE  Programa Ejecutable.\nARCHIVO.XXX  Archivo de texto ASCII \"texto plano\".\nARCHIVO.RTF  Archivo de texto con formato.\nARCHIVO.DOC  Archivo de texto con formato de Microsoft Word.\nARCHIVO.VBS  Archivo fuente escrito en lenguaje Visual Basic.\nEn todos estos casos, las extensiones diferencian los nombres de los archivos y, a la vez, los identifican ante las aplicaciones que pueden manejarlos, lo que facilita la obtención de resultados.", "sections": [{"name": "Historia", "text": "En los sistemas Unix los nombres de los archivos pueden contener cualquier carácter excepto el separador de directorios (\"/\") y por lo general no tienen límite en su tamaño o es un límite aceptable. La extensión no es un elemento diferenciado sino una convención dada a los nombres de archivo para reconocer su contenido.\nEn DOS los nombres de los archivos tenían un máximo de 8 caracteres, un punto y una extensión de como máximo tres letras, en total un máximo de 12 caracteres del Código ASCII que permitían distinguir unos archivos de otros dentro de un mismo directorio. No todos los caracteres del código ASCII estaban permitidos para nombrar un archivo, pues algunos (ejemplo: /*?+\\ y otros) estaban reservados para otras funciones. No hay diferencia entre mayúsculas y minúsculas.\nEn Windows 95 desaparecieron los límites impuestos por DOS en el número de caracteres del nombre de archivo y de la extensión.\nEn Mac OS Classic de Apple no hay extensiones. Finder asocia archivos con un código Filetype de cuatro caracteres a cada archivo con un programa o acción específica, por ejemplo el código TEXT significa que es un archivo de texto y puede ser abierto con cualquier software de edición de texto.[1]​ A partir de OS X se utiliza Uniform Type Identifier que maneja extensiones de forma idéntica a Microsoft Windows El Filetype fue declarado obsoleto con OS X 10.6 Snow Leopard.[2]​\nEn los Commondores los archivos solo pueden tener cuatro extensiones: PRG, SEQ, USR, REL. Sin embargo esto son para separar tipos de datos utilizado por un programa y son irrelevantes para identificar contenidos del mismo.", "subsections": []}, {"name": "Tipos de extensiones", "text": "", "subsections": [{"name": "Extensiones de sistema", "text": "Estas son las extensiones de archivos necesarios para el funcionamiento interno del sistema operativo Microsoft Windows así como de los diferentes programas que trabajan en él. No está recomendado moverlos, editarlos o variarlos de ningún modo ya que podrían afectar al funcionamiento del sistema. Se nombran en orden alfabético."}, {"name": "Extensiones de video", "text": "Los archivos de video se reproducen normalmente en películas o en páginas web que contengan videos. Los más comunes son:"}, {"name": "Extensiones de audio", "text": "Los archivos de audio son aquellos que reproducen sonido al ser ejecutados. Los más comunes son:"}]}, {"name": "Véase también", "text": "Lista de formatos de archivo", "subsections": []}, {"name": "Referencias", "text": "↑ «Mac Creator and File Type codes». livecode.byu.edu. Consultado el 2 de septiembre de 2022. \n↑ «Introduction to Uniform Type Identifiers Overview». developer.apple.com. Consultado el 2 de septiembre de 2022. \n↑ «Extensión de archivo DWG - AutoCAD Drawing Database Format». \n↑ «NEF, Nikon Digital Camera Raw Image File (.nef)». ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Extensiones", "title": "Extensión", "summary": "El término extensión (y otros términos derivados, como extensa, extenso, extensor) aparece en esta enciclopedia en referencia a los siguientes conceptos:", "sections": [{"name": "Filosofía, lógica y lingüística", "text": "medida del espacio físico que ocupa un cuerpo;\nRes extensa, una de las sustancias consideradas por Descartes;\nen semántica, definición extensional o por extensión;\nintención y extensión, conceptos lógicos y filosóficos (véase intención);\nen metafísica, extensión;\nen lógica, la extensión de un concepto, el dominio de objetos individuales y enumerables a los cuales puede aplicarse con propiedad;\nen la lógica de predicados, extensión;", "subsections": []}, {"name": "Matemáticas", "text": "extensión analítica (o continuación analítica) de una función compleja;\nextensión de cuerpos:\nextensión simple;\nextensión normal;\nextensión algebraica y extensión trascendente;\nextensión separable;\nextensión de Galois;\nextensión abeliana;\nextensión finita;\nextensión de grupo;", "subsections": []}, {"name": "Biología y medicina", "text": "extensión, la preparación microscópica de un fluido corporal sobre un portaobjetos;\nextensión convergente, una etapa del desarrollo embrionario;", "subsections": [{"name": "Anatomía", "text": "la extensión, el movimiento opuesto a la flexión, que consiste en aumentar el ángulo entre dos huesos, pivotando en una articulación;\nmúsculo extensor:\nmúsculo extensor largo de los dedos;\nmúsculo extensor corto del pulgar;\nmúsculo extensor largo del dedo gordo;\nmúsculo extensor del índice;\nmúsculo extensor radial corto del carpo;\nmúsculo extensor radial largo del carpo;\nmúsculo extensor ulnar del carpo;\ntríceps extensor cubiti;\nreflejo de extensión, un reflejo osteo-tendinoso;"}, {"name": "Ejercicio físico", "text": "estiramiento muscular;\nextensión de rodilla, tipo de entrenamiento;\nextensores, aparato de entrenamiento;"}]}, {"name": "Música", "text": "extensión, el intervalo entre el sonido más grave y el más agudo que puede emitir una voz o un instrumento, sin importar la calidad tímbrica o expresiva o por defecto añadirle otra parte;", "subsections": []}, {"name": "Informática", "text": "Extensión de archivo, un sufijo añadido al nombre de un archivo de ordenador aplicado para mostrar su formato.\nExtensión de dirección física, una característica de los procesadores x86 que permite a los sistemas de 32-bit utilizar hasta 64 gigabytes (64 GB) de memoria física;\nextensión, complemento o plug-in de un programa informático, como las extensiones de Mozilla;\nescalabilidad o extensibilidad, la propiedad de un sistema, red o proceso, de extender su margen de operaciones sin perder calidad;\nExtensiones Vectoriales Avanzadas, conjunto de instrucciones de 256 bits.", "subsections": []}, {"name": "Educación universitaria", "text": "educación por extensión;\nextensión agraria;\nextensión universitaria, concepto creado a partir de la Revolución Universitaria del 18, una de las tres funciones de las universidades modernas (además de la docencia y la investigación), consistente en la labor de difusión de la cultura y el conocimiento, realizada no solo en beneficio de la comunidad universitaria, sino extendida a toda la sociedad;\nDivisión de Extensión Cultural de la Universidad de Antioquia;", "subsections": []}, {"name": "Otros usos", "text": "en diseño aeronáutico, la extensión del borde de ataque;\nuna extensión capilar (en plural, extensiones): mechón o mechones de cabello que se adosan (con adhesivos) a la cabellera para darle más volumen o longitud;\nla extensión de una mesa (especialmente en las de comedor), suplemento que se añade al tablero y que suele guardarse debajo de este;\nla extensión de un cable eléctrico.", "subsections": []}, {"name": "Extensidad, extensitud, extensividad y extensivo", "text": "extensidad, como opuesto a intensidad: en las ciencias de la salud (la agnosia de extensidad) y como concepto gramático (la extensidad y extensitud);\nla oposición de los conceptos intensivo y extensivo (el término extensividad no aparece en el Diccionario de la lengua española)\nagricultura extensiva, la opuesta a la agricultura intensiva;\nla ganadería extensiva, la opuesta a la ganadería intensiva;\nlas propiedades intensivas y extensivas en las ciencias físicas;\nla prospección extensiva", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/FSF_Award_for_the_Advancement_of_Free_Software", "title": "FSF Award for the Advancement of Free Software", "summary": "El Free Software Foundation Award for the Advancement of Free Software (\"Premio para el Avance del Software Libre de la Fundación para el Software Libre\") se otorga anualmente a una persona que ha hecho una gran contribución al progreso y desarrollo del software libre, a través de actividades que vayan de acuerdo con el espíritu del software libre y a proyectos de beneficio social.", "sections": [{"name": "Ganadores", "text": "", "subsections": [{"name": "Personas", "text": "Los demás finalistas entre paréntesis\n2011: Yukihiro Matsumoto,.[1]​\n2010: Rob Savoye,[2]​ con un reconocimiento especial a Adrian Hands.\n2009: John Gilmore\n2008: Wietse Venema\n2007: Harald Welte\n2006: Theodore Ts'o - (Wietse Venema y Yukihiro Matsumoto)\n2005: Andrew Tridgell - (Harmut Pilch y Theodore T'so)\n2004: Theo de Raadt - (Andrew Tridgell y Cesar Brod)\n2003: Alan Cox- (Theo de Raadt y Werner Koch)\n2002: Lawrence Lessig - (Bruno Haible y Theo de Raadt)\n2001: Guido van Rossum - (L. Peter Deutsch y Andrew Tridgell)\n2000: Brian Paul - (Donald Becker y Patrick Lenz)\n1999: Miguel de Icaza - (Donald Knuth y John Gilmore)\n1998: Larry Wall - (Proyecto Apache, Tim Berners-Lee, Jordan Hubbard, Ted Lemon, Eric S. Raymond, Henry Spencer)\nLarry Wall, 1998\nMiguel de Icaza, 1999\nBrian Paul, 2000\nGuido van Rossum, 2001\nLawrence Lessig, 2002\nLawrence Lessig, 2002\nAlan Cox, 2003\nTheo de Raadt, 2004\nAndrew Tridgell, 2005\nTheodore Ts'o, 2006\nYukihiro Matsumoto, 2011"}, {"name": "Proyectos", "text": "2011 Proyecto GNU Health\n2010 Proyecto Tor\n2009 Internet Archive\n2008 Creative Commons\n2007 Groklaw\n2006 Sahana Disaster Management System\n2005 Wikipedia"}]}, {"name": "Referencias", "text": "↑ «FSF 2011 Free Software Awards announced» (en inglés). Archivado desde el original el 18 de abril de 2015. Consultado el 28 de abril de 2014. \n↑ «FSF 2010 Free Software Awards announced» (en inglés). Archivado desde el original el 14 de septiembre de 2011. Consultado el 26 de marzo de 2011. ", "subsections": []}, {"name": "Enlaces externos", "text": " Portal:Software libre. Contenido relacionado con Software libre.\nSitio oficia", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Factorial", "title": "Factorial", "summary": "n\n{\\displaystyle n}\nn\n!\n{\\displaystyle n!}\nEl factorial de un entero positivo n, el factorial de n o n factorial se define en principio como el producto de todos los números enteros positivos desde 1 (es decir, los números naturales) hasta n. Por ejemplo:\n5\n!\n=\n1\n×\n2\n×\n3\n×\n4\n×\n5\n=\n120.\n \n{\\displaystyle 5!=1\\times 2\\times 3\\times 4\\times 5=120.\\ }\nLa operación de factorial aparece en muchas áreas de las matemáticas, particularmente en combinatoria y análisis matemático.\nDe manera fundamental el factorial de n representa el número de formas distintas de ordenar n objetos distintos (elementos sin repetición). Este hecho ha sido conocido desde hace varios siglos, en el siglo XII por los estudiosos hindúes.\nLa definición de la función factorial también se puede extender a números no naturales manteniendo sus propiedades fundamentales, pero se requieren matemáticas avanzadas, particularmente del análisis matemático. El matemático francés Christian Kramp (1760-1826) fue la primera persona en usar la actual notación matemática n!, en 1808.[1]​\nLos factoriales han sido descubiertos en varias culturas antiguas, especialmente en las matemáticas indias en las obras canónicas de la literatura jainista, y por los místicos judíos en el libro talmúdico Sefer Yetzirah. La operación factorial se encuentra en muchas áreas de las matemáticas, sobre todo en combinatoria, donde su uso más básico cuenta las posibles secuencias distintas —las permutaciones— de \nn\n{\\displaystyle n}\n objetos distintos: hay  \nn\n!\n{\\displaystyle n!}\n. En análisis matemático, los factoriales se utilizan en series de potencias para la función exponencial y otras funciones, y también tienen aplicaciones en álgebra, teoría de números, teoría de la probabilidad e informática.\nGran parte de la matemática de la función factorial se desarrolló a partir de finales del siglo XVIII y principios del XIX.\nLa aproximación de Stirling proporciona una aproximación exacta al factorial de los grandes números, demostrando que crece más rápidamente que el crecimiento exponencial. La  fórmula de Legendre describe los exponentes de los números primos en una factorización prima de los factoriales, y puede utilizarse para contar los ceros finales de los factoriales. Daniel Bernoulli y Leonhard Euler  interpolaron la función factorial a una función continua de números complejos, excepto en los enteros negativos, la función gamma (compensada).\nMuchas otras funciones notables y secuencias de números están estrechamente relacionadas con los factoriales, incluyendo el coeficiente binomial, doble factorial, factorial descendente, primorial, y subfactorial. Las implementaciones de la función factorial se utilizan habitualmente como ejemplo de diferentes estilos de programación informática, y se incluyen en calculadoras científicas y bibliotecas de software de cálculo científico. Aunque calcular directamente factoriales grandes utilizando la fórmula del producto o la recurrencia no es eficiente, se conocen algoritmos más rápidos, que igualan con un factor constante el tiempo de los  algoritmos de multiplicación rápidos para números con el mismo número de dígitos.", "sections": [{"name": "Historia", "text": "El concepto de factoriales ha surgido de forma independiente en muchas culturas:\nEn las matemáticas indias, una de las primeras descripciones conocidas de los factoriales proviene del Anuyogadvāra-sūtra,[2]​ una de las obras canónicas de la literatura jainista, a la que se han asignado fechas que varían entre 300 a. C. y 400 d. C.[3]​ Separa el orden ordenado e invertido de un conjunto de elementos de los otros órdenes (\"mixtos\"), evaluando el número de órdenes mixtos restando dos de la fórmula habitual del producto para el factorial. La regla del producto para permutaciones también fue descrita por el monje jainista del siglo VI de nuestra era Jinabhadra.[2]​ Los eruditos hindúes han estado utilizando fórmulas factoriales desde al menos 1150, cuando Bhāskara II mencionó factoriales en su obra Līlāvatī, en relación con un problema de cuántas maneras Vishnu podría sostener sus cuatro objetos característicos (un concha de concha, disco, maza, y flor de loto) en sus cuatro manos, y un problema similar para un dios de diez manos.[4]​\nEn las matemáticas de Oriente Medio, el libro místico hebreo de la creación Séfer Ietzirá', del Período talmúdico (200 a 500 CE), enumera factoriales ¡hasta 7! como parte de una investigación sobre el número de palabras que se pueden formar a partir del alfabeto hebreo.[5]​[6]​ Los factoriales también fueron estudiados por razones similares por el gramático árabe del siglo VIII Al-Khalil ibn Ahmad al-Farahidi.[5]​ El matemático árabe Ibn al-Haytham (también conocido como Alhazen, c. 965 - c. 1040) fue el primero en formular el teorema de Wilson que conecta los factoriales con los números primos.[7]​\nEn Europa, aunque las matemáticas griegas incluían algo de combinatoria, y Platón utilizó célebremente 5.040 (un factorial) como población de una comunidad ideal, en parte por sus propiedades de divisibilidad,[8]​ no hay evidencia directa del estudio de los factoriales en la Grecia antigua. En su lugar, el primer trabajo sobre factoriales en Europa fue realizado por eruditos judíos como Shabbethai Donnolo, explicando el pasaje del Sefer Yetzirah.[9]​ En 1677, el autor británico Fabian Stedman describió la aplicación de los factoriales al toque de cambios, un arte musical que consistía en hacer sonar varias campanas afinadas.[10]​[11]​\nA partir de finales del siglo XV, los factoriales se convirtieron en objeto de estudio de los matemáticos occidentales. En un tratado de 1494, el matemático italiano Luca Pacioli calculó factoriales hasta ¡11!, en relación con un problema de ordenación de mesas de comedor.[12]​ Christopher Clavius discutió los factoriales en un comentario de 1603 sobre la obra de Johannes de Sacrobosco, y en la década de 1640, el polímata francés Marin Mersenne publicó grandes (¡pero no del todo correctas) tablas de factoriales, ¡hasta 64!, basadas en la obra de Clavius.[13]​ La serie de potencias para la función exponencial, con los recíprocos de factoriales para sus coeficientes, fue formulada por primera vez en 1676 por Isaac Newton en una carta a Gottfried Wilhelm Leibniz.[14]​ Otras obras importantes de las primeras matemáticas europeas sobre factoriales incluyen una amplia cobertura en un tratado de 1685 por John Wallis, un estudio de sus valores aproximados para grandes valores de \nn\n{\\displaystyle n}\n por Abraham de Moivre en 1721, una carta de 1729 de James Stirling a de Moivre en la que se enunciaba lo que se conoció como aproximación de Stirling, y el trabajo en la misma época de Daniel Bernoulli y Leonhard Euler formulando la extensión continua de la función factorial a la función gamma.[15]​ Adrien-Marie Legendre incluyó la fórmula de Legendre, que describe los exponentes en la factorización de factoriales en potencias primos, en un texto de 1808 sobre teoría de números.[16]​\nLa notación \nn\n!\n{\\displaystyle n!}\n para los factoriales fue introducida por el matemático francés Christian Kramp en 1808.[17]​ También se han utilizado muchas otras notaciones. Otra notación posterior, en la que el argumento del factorial estaba semicerrado por los lados izquierdo e inferior de una caja, fue popular durante algún tiempo en Gran Bretaña y América, pero cayó en desuso, tal vez porque es difícil de tipografiar.[17]​ La palabra \"factorial\" (originalmente en francés: factorielle) fue utilizada por primera vez en 1800 por Louis François Antoine Arbogast,[18]​ en el primer trabajo sobre la fórmula de Faà di Bruno,[19]​ sino que se refiere a un concepto más general de productos de progresión aritméticas. Los \"factores\" a los que se refiere este nombre son los términos de la fórmula del producto para el factorial.[20]​", "subsections": []}, {"name": "Definición por producto e inducción", "text": "Podemos definir el factorial de un número entero positivo n, expresado n!, como el producto de todos los números enteros positivos menores o iguales que n. \nn\n!\n=\n1\n×\n2\n×\n3\n×\n4\n×\n.\n.\n.\n×\n(\nn\n−\n1\n)\n×\nn\n{\\displaystyle n!=1\\times 2\\times 3\\times 4\\times ...\\times (n-1)\\times n}\nLa multiplicación anterior también se puede representar utilizando el operador productorio:\nn\n!\n=\n∏\nk\n=\n1\nn\nk\n{\\displaystyle n!=\\prod _{k=1}^{n}k}\nTambién es posible definirlo mediante la relación de recurrencia\nn\n!\n=\n{\n1\nsi, \nn\n<\n2\n(\nn\n−\n1\n)\n!\n×\nn\nsi, \nn\n>\n1\n{\\displaystyle n!={\\begin{cases}1&{\\text{si, }}n<2\\\\(n-1)!\\times n&{\\text{si, }}n>1\\end{cases}}}\nEn esta segunda definición el dominio de la función es el conjunto de los enteros no negativos ℤ≥0 y el codominio es el conjunto de los enteros positivos ℤ+.[21]​ En este caso hay una sucesión recurrente, el cálculo sucesivo de sus elementos se llama proceso recurrente y la igualdad n! = (n - 1)!n se nombra ecuación recurrente.[22]​\nLa segunda definición incorpora la premisa de que\n0\n!\n=\n1\n{\\displaystyle 0!=1}", "subsections": [{"name": "Cero factorial", "text": "Una extensión común, sin embargo, es la definición de factorial de cero. De acuerdo con la convención matemática de producto vacío, el valor de 0! debe definirse como:\nEs posible, sin embargo, dar un argumento intuitivo para justificar la elección, como sigue:\nPara cada número entero positivo n mayor o igual que 1, es posible determinar el valor del factorial anterior mediante el uso de la siguiente identidad:\n[\n(\nn\n−\n1\n)\n!\n=\nn\n!\nn\n]\n=\n[\nn\n⋅\n(\nn\n−\n1\n)\n!\n=\nn\n!\n]\n{\\displaystyle {\\bigg [}(n-1)!={\\frac {n!}{n}}{\\bigg ]}=[n\\cdot (n-1)!=n!]}\nválida para todo número mayor o igual que 1.\nAsí, si se conoce que 5! es 120, entonces 4! es 24 porque\n5\n!\n5\n=\n120\n5\n=\n24\n{\\displaystyle {\\frac {5!}{5}}={\\frac {120}{5}}=24}\ny por tanto 3! debe ser necesariamente 6 puesto que\n4\n!\n4\n=\n24\n4\n=\n6\n{\\displaystyle {\\frac {4!}{4}}={\\frac {24}{4}}=6}\nEl mismo proceso justifica el valor de 2! = 2 y 1! = 1  ya que:\n2\n!\n=\n3\n!\n3\n=\n6\n3\n=\n2\n,\n1\n!\n=\n2\n!\n2\n=\n2\n2\n=\n1\n{\\displaystyle 2!={\\frac {3!}{3}}={\\frac {6}{3}}=2,\\qquad 1!={\\frac {2!}{2}}={\\frac {2}{2}}=1}\nSi aplicamos la misma regla para el caso en que n = 1 tendríamos que 0! corresponde a:\n0\n!\n=\n1\n!\n1\n=\n1\n1\n=\n1\n{\\displaystyle 0!={\\frac {1!}{1}}={\\frac {1}{1}}=1}\nAunque el argumento puede resultar algo convincente, es importante tener en cuenta que no es más que un argumento informal y que la razón real por la cual se toma la convención de 0! = 1 es por ser un caso especial de la convención de producto vacío usada en muchas otras ramas de las matemáticas."}]}, {"name": "Propiedades", "text": "Si m y n son enteros positivos y m < n implica que m! < n!\nSi m < n resulta que m! es factor o divisor los cuales .. de n! y se tiene: n! = n(n-1)...(m+1).m! (1)\nEl número n(n-1)...(m+1) es el producto de los n-m factores expuestos mayores de n!\nn-m es menor que n y reemplazando en (1) se obtiene n! = n(n-1)...(n-m+1).(n-m)![23]​\nn\n!\n<\n(\nn\n+\n1\n2\n)\nn\n{\\displaystyle n!<\\left({\\frac {n+1}{2}}\\right)^{n}}\n, para n> 1. Se aplica propiedad de  que la media geométrica de los primeros enteros positivos no excede a la media aritmética de ellos.", "subsections": []}, {"name": "Aplicaciones", "text": "Los factoriales se usan mucho en la rama de la matemática llamada combinatoria, a través del binomio de Newton, que da los coeficientes de la forma desarrollada de (a + b)n:\n(\na\n+\nb\n)\nn\n=\n(\nn\n0\n)\na\nn\n+\n(\nn\n1\n)\na\nn\n−\n1\nb\n+\n(\nn\n2\n)\na\nn\n−\n2\nb\n2\n+\n⋯\n+\n(\nn\nn\n−\n1\n)\na\nb\nn\n−\n1\n+\n(\nn\nn\n)\nb\nn\n=\n∑\nk\n=\n0\nn\n(\nn\nk\n)\na\nn\n−\nk\nb\nk\n{\\displaystyle (a+b)^{n}={n \\choose 0}a^{n}+{n \\choose 1}a^{n-1}b+{n \\choose 2}a^{n-2}b^{2}+\\cdots +{n \\choose n-1}ab^{n-1}+{n \\choose n}b^{n}=\\sum _{k=0}^{n}{n \\choose k}a^{n-k}b^{k}}\ndonde \n(\nn\nk\n)\n{\\displaystyle {n \\choose k}}\n representa un coeficiente binomial:\n(\nn\nk\n)\n=\nn\n!\n(\nn\n−\nk\n)\n!\n⋅\nk\n!\n{\\displaystyle {n \\choose k}={\\frac {n!}{(n-k)!\\cdot k!}}}\nDe igual forma se puede encontrar en la derivación por la regla del producto para derivadas de orden superior de manera similar que el binomio de newton:\nd\nn\nx\nd\nx\nn\n(\nf\n(\nx\n)\ng\n(\nx\n)\n)\n=\n(\nf\ng\n)\n(\nn\n)\n=\n(\nn\n0\n)\nf\ng\n(\nn\n)\n+\n(\nn\n1\n)\nf\n′\ng\n(\nn\n−\n1\n)\n+\n(\nn\n2\n)\nf\n″\ng\n(\nn\n−\n2\n)\n+\n⋯\n+\n(\nn\nn\n−\n1\n)\nf\n(\nn\n−\n1\n)\ng\n′\n+\n(\nn\nn\n)\nf\n(\nn\n)\ng\n=\n∑\nk\n=\n0\nn\n(\nn\nk\n)\nf\n(\nk\n)\ng\n(\nn\n−\nk\n)\n{\\displaystyle {\\frac {d^{n}x}{dx^{n}}}(f(x)g(x))=(fg)^{(n)}={n \\choose 0}fg^{(n)}+{n \\choose 1}f^{'}g^{(n-1)}+{n \\choose 2}f^{''}g^{(n-2)}+\\cdots +{n \\choose n-1}f^{(n-1)}g^{'}+{n \\choose n}f^{(n)}g=\\sum _{k=0}^{n}{n \\choose k}f^{(k)}g^{(n-k)}}\nDonde f(n) es la derivada enésima de la función f.\nPor medio de la combinatoria, los factoriales intervienen en el cálculo de las probabilidades. Intervienen también en el ámbito del análisis, en particular a través del desarrollo polinomial de las funciones (fórmula de Taylor).\nSe generalizan a los reales con la función gamma, de gran importancia en la teoría de números.\nPara valores grandes de n, existe una expresión aproximada para el factorial de n, dado por la fórmula de Stirling:\nn\n!\n≈\n2\nπ\nn\n(\nn\ne\n)\nn\n(\n1\n+\n1\n12\nn\n+\n1\n288\nn\n2\n+\n⋯\n)\n{\\displaystyle n!\\approx {\\sqrt {2\\pi n}}\\left({\\frac {n}{e}}\\right)^{n}\\left(1+{\\frac {1}{12n}}+{\\frac {1}{288n^{2}}}+\\cdots \\right)}\nLa ventaja de esta fórmula es que no precisa inducción y, por lo tanto, permite evaluar n! más rápidamente cuando mayor sea n. ", "subsections": []}, {"name": "Extensión", "text": "Artículo principal:\nLa definición indicada de factorial es válida para números no negativos. Es posible extender la definición a otros contextos introduciendo conceptos más sofisticados, en especial es posible definirla para cualquier número real excepto para los números enteros negativos y para cualquier número complejo exceptuando de nuevo los números enteros negativos. El factorial de n es generalizado para cualquier número real n por la función gamma de manera que\nΓ\n(\nn\n)\n=\n(\nn\n−\n1\n)\n!\n=\n∫\n0\n∞\nt\nn\n−\n1\ne\n−\nt\nd\nt\n{\\displaystyle \\Gamma (n)=(n-1)!=\\int _{0}^{\\infty }\\;t^{n-1}e^{-t}\\;dt\\,}\nsolo para n > 0. Se puede generalizar aún más, para todo número complejo z que no sea igual a un entero no positivo, mediante la siguiente definición: \nΓ\n(\nz\n)\n=\n(\nz\n−\n1\n)\n!\n=\nlim\nn\n→\n∞\nn\n!\nn\nz\nz\n(\nz\n+\n1\n)\n⋯\n(\nz\n+\nn\n)\n{\\displaystyle \\Gamma (z)=(z-1)!=\\lim _{n\\to \\infty }{\\frac {n!\\;n^{z}}{z\\;(z+1)\\cdots (z+n)}}\\,}", "subsections": []}, {"name": "Productos similares", "text": "", "subsections": [{"name": "Primorial", "text": "El primorial (sucesión A002110 en OEIS) se define de forma similar al factorial, pero solo se toma el producto de los números primos menores o iguales que n:\nn\n#\n=\n∏\np\n≤\nn\np\n primo\np\n{\\displaystyle n\\#=\\prod _{p\\leq n \\atop p{\\text{ primo}}}p}"}, {"name": "Doble factorial", "text": "Se define el doble factorial de n mediante la relación de recurrencia:\nn\n!\n!\n=\n{\n1\nsi\nn\n=\n0\n(\nn\n−\n2\n)\n!\n!\n⋅\nn\nsi\nn\n≠\n0\n{\\textstyle n!!=\\left\\{{\\begin{array}{lcl}1&{\\mbox{si}}&n=0\\\\(n-2)!!\\cdot n&{\\mbox{si}}&n\\neq 0\\\\\\end{array}}\\right.}\nPor ejemplo:\n8\n!\n!\n=\n2\n⋅\n4\n⋅\n6\n⋅\n8\n=\n384\n{\\displaystyle 8!!=2\\cdot 4\\cdot 6\\cdot 8=384}\n9\n!\n!\n=\n1\n⋅\n3\n⋅\n5\n⋅\n7\n⋅\n9\n=\n945\n{\\displaystyle 9!!=1\\cdot 3\\cdot 5\\cdot 7\\cdot 9=945}\nLa sucesión de dobles factoriales (sucesión A006882 en OEIS) para:\nn\n=\n0\n,\n1\n,\n2\n,\n…\n{\\displaystyle n=0,1,2,\\dots }\nEmpieza así:\n1\n,\n1\n,\n2\n,\n3\n,\n8\n,\n15\n,\n48\n,\n105\n,\n384\n,\n945\n,\n3840\n,\n…\n{\\displaystyle 1,1,2,3,8,15,48,105,384,945,3840,\\dots }\nLa definición anterior puede extenderse para definir el doble factorial de números negativos:\n(\nn\n−\n2\n)\n!\n!\n=\nn\n!\n!\nn\n{\\displaystyle (n-2)!!={\\frac {n!!}{n}}}\nY esta es la sucesión de dobles factoriales para:\nn\n=\n−\n1\n,\n−\n3\n,\n−\n5\n,\n−\n7\n,\n…\n{\\displaystyle n=-1,-3,-5,-7,\\dots }\n1\n,\n−\n1\n,\n1\n3\n,\n−\n1\n15\n,\n…\n{\\displaystyle 1,-1,{\\frac {1}{3}},-{\\frac {1}{15}},\\dots }\nEl doble factorial de un número negativo par no está definido.\nAlgunas identidades de los dobles factoriales:\nn\n!\n=\nn\n!\n!\n(\nn\n−\n1\n)\n!\n!\n{\\displaystyle n!=n!!(n-1)!!\\,}\n(\n2\nn\n)\n!\n!\n=\n2\nn\nn\n!\n{\\displaystyle (2n)!!=2^{n}n!\\,}\n(\n2\nn\n+\n1\n)\n!\n!\n=\n(\n2\nn\n+\n1\n)\n!\n(\n2\nn\n)\n!\n!\n=\n(\n2\nn\n+\n1\n)\n!\n2\nn\nn\n!\n{\\displaystyle (2n+1)!!={(2n+1)! \\over (2n)!!}={(2n+1)! \\over 2^{n}n!}}\n(\n2\nn\n−\n1\n)\n!\n!\n=\n(\n2\nn\n−\n1\n)\n!\n(\n2\nn\n−\n2\n)\n!\n!\n=\n(\n2\nn\n)\n!\n2\nn\nn\n!\n{\\displaystyle (2n-1)!!={(2n-1)! \\over (2n-2)!!}={(2n)! \\over 2^{n}n!}}\nΓ\n(\nn\n+\n1\n2\n)\n=\nπ\n(\n2\nn\n−\n1\n)\n!\n!\n2\nn\n{\\displaystyle \\Gamma \\left(n+{1 \\over 2}\\right)={\\sqrt {\\pi }}\\,\\,{(2n-1)!! \\over 2^{n}}}\nΓ\n(\nn\n2\n+\n1\n)\n=\nπ\nn\n!\n!\n2\n(\nn\n+\n1\n)\n/\n2\n{\\displaystyle \\Gamma \\left({n \\over 2}+1\\right)={\\sqrt {\\pi }}\\,\\,{n!! \\over 2^{(n+1)/2}}}"}]}, {"name": "Véase también", "text": "Productorio\nSubfactorial\nFunción gamma\nFactorial exponencial", "subsections": []}, {"name": "Referencias y citas", "text": "↑ Higgins, Peter (2008), Number Story: From Counting to Cryptography, New York: Copernicus, p. 12, ISBN 978-1-84800-000-1 .\n↑ a b Datta, Bibhutibhusan; Singh, Awadhesh Narayan (2019).  Springer Singapore, Aditya; Mahesh, K., eds. Studies in Indian Mathematics and Astronomy: Artículos seleccionados de Kripa Shankar Shukla. Fuentes y Estudios en la Historia de las Matemáticas y las Ciencias Físicas. pp. 356-376. S2CID 191141516.  |editor1-last= y |editor= redundantes (ayuda). Revisado por K. S. Shukla a partir de un artículo publicado en Indian Journal of History of Science 27 (3): 231-249, 1992, MR 1189487. Véase p. 363. \n↑ Jadhav, Dipak (August 2021). «Jaina Thoughts on Unity Not Being a Number». History of Science in South Asia (University of Alberta Libraries) 9: 209-231. S2CID 238656716. doi:10.18732/hssa67. . Véase la discusión de la datación en la p. 211.\n↑ Biggs, Norman L. (Mayo 1979). «Las raíces de la combinatoria». Historia Mathematica 6 (2): 109-136. MR 0530622. doi:10.1016/0315-0860(79)90074-0. \n↑ a b Katz, Victor J. (June 1994). «Ethnomathematics in the classroom». Para el Aprendizaje de las Matemáticas 14 (2): 26-30. JSTOR 40248112. \n↑ Sefer Yetzirah en Wikisource, Capítulo IV, Sección 4\n↑ Rashed, Roshdi (1980). «Ibn al-Haytham et le théorème de Wilson». Archivo de Historia de las Ciencias Exactas (en francés) 22 (4): 305-321. MR 595903. S2CID 120885025. \n↑ Acerbi, F. (2003). «On the shoulders of Hipparchus: a reappraisal of ancient Greek combinatorics». Archivo de Historia de las Ciencias Exactas 57 (6): 465-502. JSTOR 41134173. MR 2004966. S2CID 122758966. doi:10.1007/s00407-003-0067-0. \n↑ Katz, Victor J. (2013). «Capítulo 4: Combinatoria judía».  En Wilson, Robin; Watkins, John J., eds. Combinatoria: Ancient & Modern. Oxford University Press. pp. 109-121. ISBN 978-0-19-965659-2. \n↑ Hunt, Katherine (May 2018). «The Art of Changes: Bell-Ringing, Anagrams, and the Culture of Combination in Seventeenth-Century England». Journal of Medieval and Early Modern Studies 48 (2): 387-412. doi:10.1215/10829636-4403136. \n↑ Stedman, Fabian (1677). Campanalogia. London. pp. 6-9. }  El editor aparece como \"W.S.\", que puede haber sido William Smith, posiblemente actuando como agente de la Sociedad de Jóvenes Universitarios, a cuya sociedad va dirigida la \"Dedicatoria\".\n↑ Knobloch, Eberhard (2013). «Capítulo 5: Combinatoria del Renacimiento».  En Wilson, Robin; Watkins, John J., eds. Combinatoria: Ancient & Modern. Oxford University Press. pp. 123-145. ISBN 978-0-19-965659-2.   Véase p. 126.\n↑ Knobloch, 2013.\n↑ Ebbinghaus, H.-D.; Hermes, H.; Hirzebruch, F.; Koecher, M.; Mainzer, K.; Neukirch, J.; Prestel, A.; Remmert, R. (1990). id=Z53SBwAAQBAJ&pg=PA131 Numbers. Graduate Texts in Mathematics 123. New York: Springer-Verlag. p. 131. ISBN 0-387-97202-1. MR 1066206. doi:10.1007/978-1-4612-1005-4. \n↑ Dutka, Jacques (1991). «La historia temprana de la función factorial». Archivo de Historia de las Ciencias Exactas 43 (3): 225-249. JSTOR 41133918. S2CID 122237769. doi:10.1007/BF00389433. \n↑ Dickson, Leonard E. (1919). «Capítulo IX: Divisibilidad de factoriales y coeficientes multinomiales». Historia de la Teoría de Números 1. Institución Carnegie de Washington. pp. 263-278.  Véase en particular la pág. 263.\n↑ a b Cajori, Florian (1929). «448-449. Factorial \"n\"». A History of Mathematical Notations, Volume II: Notations Mainly in Higher Mathematics. The Open Court Publishing Company. pp. 71-77. \n↑ Miller, Jeff. st-andrews.ac.uk/Miller/mathword/f/ «Usos más tempranos conocidos de algunas de las palabras de Matemáticas (F)». MacTutor History of Mathematics archive. University of St Andrews. \n↑ Craik, Alex D. D. (2005). «Prehistoria de la fórmula de Faà di Bruno». The American Mathematical Monthly 112 (2): 119-130. JSTOR 30037410. MR 2121322. S2CID 45380805. doi:10.1080/00029890.2005.11920176. \n↑ Arbogast, Louis François Antoine (1800). Du calcul des dérivations (en francés). Strasbourg: L'imprimerie de Levrault, frères. pp. 364-365. \n↑ «Sucesiones recurrentes» de A. I. Markushévich, Editorial Progreso, 1998\n↑ Fuente ut supra \n↑  A. Adrián Albert: Álgebra superior, UTEHA, México /1991", "subsections": []}, {"name": "Enlaces externos", "text": " Wikilibros alberga un libro o manual sobre  Implementaciones del factorial de un número.\nCalcular factorial de un número en PHP. \nAlgoritmos interesantes(en inglés)\nhttp://factorielle.free.fr\nCalculadora de factoriales - Hasta 200.00", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Falcon_(lenguaje_de_programaci%C3%B3n)", "title": "Falcon (lenguaje de programación)", "summary": "[\n]\nFalcon es un lenguaje de programación interpretado de código abierto multiparadigma diseñado por Giancarlo Niccolai. Se basa en una máquina virtual de propiedad y está disponible para las plataformas Microsoft Windows, GNU/Linux, Mac, Solaris y en el futuro BSD. Se propone como una herramienta para crear aplicaciones completas y aplicaciones web en relación con apache2. ", "sections": [{"name": "Hello, world!", "text": "o, utilizando el operador de impresión rápida \">\"\nFalcon totalmente compatible con Unicode y el ejemplo siguiente se muestra la capacidad de internacionalización:", "subsections": []}, {"name": "Paradigmas", "text": "Paradigma orientado a objetos\nParadigma funcional\nParadigma imperativo o por procedimientos\nOOP sobre tablas\nOrientada a los mensajes\nOOP con prototipos\nEn la versión final contará con el apoyo de el paradigma lógico.", "subsections": []}, {"name": "Referencias", "text": "↑ Getting Falcon\n↑ Falcon Programming Licence 1.1", "subsections": []}, {"name": "Enlaces externos", "text": "Sitio web oficial oficial\nFalcon en LinuxJournal\nFalcon en Free Software Magazin", "subsections": []}]}
